{"ingredient":"Anchovy","recipes":{"s":1,"d":[{"id":"82","Title":"Melted Broccoli Pasta With Capers and Anchovies","Ingredients":{"1":"Kosher salt","2":"2 heads (about 1 pound, or 454g, total) broccoli, cut into bitesize florets","3":"12 ounces (340 g) whole-wheat penne pasta, or other short tubular pasta","4":"3 tablespoons (45 ml) extra-virgin olive oil, divided","5":"1 cup (54 g) panko or Freezer Bread Crumbs (see Note)","6":"4 oil-packed anchovy fillets","7":"¼ cup (36 g) capers, chopped if large (rinsed well if salt-packed)","8":"2 garlic cloves, minced","9":"¼ teaspoon red pepper flakes"},"Instructions":"Bring a large pot of salted water to a boil over high heat. Add the broccoli florets and cook until bright green and crisp-tender, 2 to 3 minutes. Using a slotted spoon, transfer the broccoli to a large bowl.\nAdd the pasta to the boiling water and cook for 1 minute less than the package instructions for al dente, about 9 minutes.\nMeanwhile, toast the bread crumbs. Heat 1 tablespoon (15 ml) of olive oil in a large, high-sided sauté pan or skillet over medium heat. Add the breadcrumbs and sauté until the crumbs are golden brown and crisp, 4 to 5 minutes. Transfer to a small bowl and set aside.\nPour the remaining 2 tablespoons (30 ml) of olive oil into the pan. Add the anchovies and sauté until they disintegrate, about 1 minute. Add the capers, garlic, and red pepper flakes. Sauté until fragrant, about 1 minute, and remove from the heat.\nWhen the pasta is ready, reserve 1½ cups (360 ml) of pasta water with a measuring cup, then drain the pasta. Add the broccoli and reserved pasta water to the pan and bring to a simmer. Continue to simmer, using a wooden spoon to break the florets into small pieces as they become more tender, until the water is reduced by about half and you've been able to break apart enough florets that you're left with a very chunky mixture, 5 to 7 minutes.\nAdd the pasta to the pan. Cook, tossing and stirring, until the pasta is al dente and the sauce thickens and coats the pasta, 1 to 2 minutes. Remove from the heat, add half the toasted bread crumbs, and toss again to combine. Serve garnished with the remaining toasted bread crumbs.","Image":"//20fix.com/xfood/img/melted-broccoli-pasta-sheela-prakash.jpg"},{"id":"1222","Title":"Tomatoes and Haricots Verts with Anchovies","Ingredients":{"1":"4 oz. haricots verts or green beans, trimmed","2":"Kosher salt","3":"2 lb. medium tomatoes, some sliced, some cut into wedges","4":"1 pint Sun Gold and/or cherry tomatoes, halved crosswise","5":"16 oil-packed anchovy fillets","6":"1/4 cup celery leaves or parsley leaves","7":"2 Tbsp. red wine vinegar","8":"2 Tbsp. extra-virgin olive oil","9":"Smoked or regular flaky sea salt","10":"Freshly ground black pepper"},"Instructions":"Cook haricots verts in a large pot of boiling salted water until bright green and tender, about 5 minutes. Using a slotted spoon, transfer to a bowl of ice water; let cool. Drain and pat dry.\nToss haricots verts, both kinds of tomatoes, anchovies, celery leaves, and vinegar in a large bowl; season lightly with kosher salt.\nTransfer salad to a platter, drizzle with oil, and season with sea salt and pepper","Image":"//20fix.com/xfood/img/tomatoes-and-haricots-verts-with-anchovies.jpg"},{"id":"1297","Title":"Pantry Pasta with Garlic, Anchovies, and Parmesan","Ingredients":{"1":"12 oz. spaghetti or other long pasta","2":"Kosher salt","3":"4 garlic cloves, thinly sliced","4":"1/4 cup extra-virgin olive oil, plus more for drizzling","5":"3 oil-packed anchovy fillets (optional)","6":"1/4 tsp. crushed red pepper flakes","7":"1 cup finely grated Parmesan, plus more for serving","8":"4 Tbsp. unsalted butter, cut into pieces","9":"Freshly ground black pepper","10":"1/3 cup finely chopped parsley","11":"1 tsp. finely grated lemon zest","12":"1 Tbsp. fresh lemon juice"},"Instructions":"Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.\nMeanwhile, cook garlic and 1/4 cup oil in a large heavy pot over medium heat, stirring occasionally, until garlic is golden, about 4 minutes. Add anchovies (if using) and red pepper flakes and cook, smashing anchovies with a wooden spoon to break them up, until anchovies begin to dissolve, about 1 minute.\nAdd 1 1/4 cups pasta cooking liquid along with 1 cup Parmesan to pot with anchovies and garlic and cook, stirring, until cheese is melted, about 1 minute. Using tongs, add pasta to pot, then add butter and lots of black pepper. Cook, tossing energetically and adding more cooking liquid if needed, until pasta is al dente and sauce is thickened and coats pasta, about 4 minutes. Remove from heat; add parsley, lemon zest, and lemon juice.\nDivide pasta among bowls; drizzle with oil and top with more Parmesan.","Image":"//20fix.com/xfood/img/pantry-pasta-with-garlic-anchovies-and-parmesan.jpg"},{"id":"1663","Title":"Marinated Anchovies with Bread and Butter","Ingredients":{"1":"1 (4–5-ounce) jar oil-packed anchovies, drained","2":"1 tablespoon distilled white vinegar","3":"2 peperoncini, thinly sliced, or 1/2 red Fresno chile, thinly sliced, or 3/4 teaspoon crushed red pepper flakes","4":"1 lemon","5":"2 tablespoons olive oil","6":"1/2 cup (1 stick) unsalted butter, room temperature","7":"Flaky sea salt (optional)","8":"Freshly ground black pepper (optional)","9":"8 slices seedy whole wheat bread, each cut into 4 triangles"},"Instructions":"Place anchovies in a shallow dish or small serving bowl and drizzle vinegar over. Let sit 5 minutes, then add peperoncini. Finely grate zest from half of lemon over anchovies. Slice lemon in half and squeeze in juice from both halves; drizzle with oil.\nScoop butter into a small dish and sprinkle generously with salt and pepper if desired. Serve marinated anchovies with bread and butter alongside.","Image":"//20fix.com/xfood/img/marinated-anchovies-with-bread-and-butter.jpg"},{"id":"3735","Title":"Pan Bagnat Sandwich with Tuna, Anchovies, and Parsley","Ingredients":{"1":"1 crusty baguette, ends trimmed off","2":"Olive oil (for drizzling)","3":"1 garlic clove, smashed","4":"4 jarred anchovy fillets","5":"1/4 cup thinly sliced onion","6":"1 tablespoon red wine vinegar","7":"1/4 teaspoon salt, plus more","8":"1/4 teaspoon freshly ground black pepper, plus more","9":"1 (6-ounce) jar tuna fillets in olive oil, drained, flaked","10":"1/4 cup fresh parsley leaves","11":"2 hard-boiled eggs, peeled, sliced","12":"2 tablespoons pitted and halved Nicoise olives","13":"1 medium ripe tomato, cored, thinly sliced"},"Instructions":"Cut baguette in half crosswise with a serrated knife, then split each half lengthwise. Drizzle cut sides of bread with oil and rub with garlic. Arrange 2 anchovies on top half of each baguette.\nToss onion and vinegar in a medium bowl and season with 1/4 tsp. each salt and pepper. Let stand 5 minutes. Add tuna and parsley and toss gently to combine. Taste and adjust seasoning. Pile tuna mixture on bottom half of each baguette. Top tuna mixture with eggs and olives.\nArrange tomato slices on top of anchovies and close sandwiches. Wrap sandwiches tightly in foil and place a heavy pot or skillet on top. Add a few heavy objects such as cans to weigh down pot and press down on sandwiches. Let sit at room temperature at least 40 minutes and up to 1 hour. Unwrap, slice each sandwich in half crosswise (if desired), and serve.","Image":"//20fix.com/xfood/img/pan-bagnat-sandwich-with-tuna-anchovies-and-parsley-56389688.jpg"},{"id":"5033","Title":"Charred Romanesco with Anchovies and Mint","Ingredients":{"1":"1/2 cup olive oil, divided","2":"1 large onion, minced","3":"1 large carrot, minced","4":"1 celery stalk, minced","5":"4 Fresno chiles or jalapeños, thinly sliced into rounds, seeded","6":"Kosher salt","7":"3 pounds Romanesco or regular cauliflower (about 2 medium heads), cut into florets","8":"4 anchovy fillets packed in oil, drained","9":"1/2 cup dry white wine","10":"Freshly ground black pepper","11":"1/2 cup torn fresh mint leaves"},"Instructions":"Heat 1/2 cup oil in a medium saucepan over medium heat. Add onion, carrot, celery, and chiles; season with salt and cook, stirring occasionally, until vegetables are very soft but not brown, 12–15 minutes. Let soffritto cool.\nPreheat oven to 450°F. Heat 2 tablespoons oil in a large skillet over medium-high heat. Add half of Romanesco and cook, undisturbed, until deeply browned, about 4 minutes. Transfer to a roasting pan; repeat with remaining 2 tablespoons oil and remaining Romanesco. Add soffritto, anchovies, and wine to roasting pan; season with salt and pepper and toss to combine.\nRoast, tossing halfway through, until Romanesco is soft and liquid is mostly evaporated, 25–30 minutes; season with salt and pepper and top with mint.","Image":"//20fix.com/xfood/img/charred-romanesco-with-anchovies-and-mint-51205080.jpg"},{"id":"7224","Title":"Spaghetti with Walnuts and Anchovies","Ingredients":{"1":"1/4 cup extra virgin olive oil","2":"3 garlic cloves, sliced","3":"2 whole salt-cured anchovies, filleted, or 4-6 anchovy fillets","4":"3-4 tablespoons coarsely chopped walnuts","5":"Chili pepper to taste","6":"1 tablespoon minced fresh parsley","7":"Coarse sea salt","8":"14-16 ounces spaghetti"},"Instructions":"Bring 5 to 6 quarts of water to a rolling boil. Add about 3 tablespoons of sea salt, then add the spaghetti and cook until it offers considerable resistance to the tooth, approximately three-quarters of the package-recommended cooking time. Drain the pasta, reserving 2 cups of the starchy pasta cooking water.","Image":"//20fix.com/xfood/img/spaghetti-with-walnuts-and-anchovies-363303.jpg"},{"id":"7840","Title":"Orecchiette with Cauliflower, Anchovies, and Fried Croutons","Ingredients":{"1":"1 large head of cauliflower (28 to 30 ounces), trimmed, cut into 1-inch florets","2":"8 tablespoons extra-virgin olive oil, divided","3":"1 pound orecchiette (little ear-shaped pasta) or medium-size shell pasta","4":"1 1/2 cups 1/3-inch cubes crusty country-style bread","5":"3 medium zucchini, trimmed, cut into 1/3-inch cubes (about 3 cups)","6":"3 large garlic cloves, chopped","7":"7 anchovy fillets, finely chopped","8":"1/2 cup chopped fresh Italian parsley, divided","9":"1/3 cup (packed) freshly grated Parmesan cheese plus additional for serving","10":"2 tablespoons freshly grated Pecorino Romano cheese"},"Instructions":"Preheat oven to 425°F. Toss cauliflower florets with 1 tablespoon olive oil in large bowl to coat. Sprinkle with salt and pepper and spread in single layer on large rimmed baking sheet. Roast until cauliflower florets are tender and beginning to brown in spots, stirring occasionally, about 25 minutes. Cool to room temperature. DO AHEAD: Can be made 1 day ahead. Cover and chill.\nCook pasta in large pot of boiling generously salted water until just tender but still firm to bite, stirring occasionally. Drain pasta, reserving 1 1/3 cups pasta cooking liquid. Set pasta and cooking liquid aside separately.\nMeanwhile, heat 2 tablespoons olive oil in large deep nonstick skillet or large pot over medium-high heat. Add bread cubes and sauté until golden brown and crisp, 3 to 4 minutes. Transfer to small bowl and cool. Reserve skillet or pot.\nAdd 2 tablespoons olive oil to same skillet or pot and heat over medium-high heat. Add zucchini and garlic and sauté until zucchini is golden brown and crisp-tender, 3 to 4 minutes. Add cauliflower and anchovies and sauté until heated through, 3 to 4 minutes. Season to taste with salt and freshly ground black pepper. Add drained pasta, reserved 1 1/3 cups pasta cooking liquid, remaining 3 tablespoons olive oil, 1/3 cup parsley, 1/3 cup Parmesan, and Pecorino Romano cheese and toss to coat. Season pasta to taste with salt and freshly ground black pepper. Divide pasta among 6 bowls; sprinkle with fried croutons, remaining parsley, and additional Parmesan cheese and serve.","Image":"//20fix.com/xfood/img/orecchiette-with-cauliflower-anchovies-and-fried-croutons-358497.jpg"},{"id":"9258","Title":"Anchovies in Tomato Sauce with Pasta","Ingredients":{"1":"olive oil","2":"4 cloves of garlic, peeled and very finely sliced","3":"2 big handfuls of pine nuts","4":"A big handful of raisins","5":"12 salted anchovy fillets","6":"3 heaping tablespoons tomato purée","7":"a large wineglass of red wine","8":"1 3/4 cups stale bread crumbs","9":"1 pound dried margherita pasta"},"Instructions":"Heat a pan, add 6 tablespoons of olive oil, then add your garlic and fry slowly. As it begins to color, add the pine nuts, raisins, and anchovies and continue frying for 2 minutes, until the anchovies have melted. Add the tomato purée and the wine and stir in well. Leave to simmer on a medium heat for 3 minutes. The sauce should be quite thick, like tomato sauce, but if you think it needs thinning down, add a little water. Heat a little olive oil in a separate pan, add the bread crumbs and fry until toasted, crunchy, and golden. Leave to cool on paper towels. Meanwhile, cook your pasta in boiling salted water according to the package instructions. Drain and mix with the sauce. Check the seasoning and divide onto 4 plates, twizzling the pasta with tongs as you go. Serve sprinkled with the bread crumbs.","Image":"//20fix.com/xfood/img/anchovies-in-tomato-sauce-with-pasta-237164.jpg"},{"id":"11196","Title":"Gemelli with Broccoli Rabe and Anchovies","Ingredients":{"1":"1 pound gemelli or other corkscrew pasta","2":"1 (1-pound) bunch broccoli rabe, coarse stems discarded and remainder cut crosswise into 1-inch pieces","3":"1 cup panko (Japanese crisp bread crumbs)","4":"1/2 cup extra-virgin olive oil","5":"6 garlic cloves, coarsely chopped","6":"1 (2-ounce) can flat anchovy fillets, drained","7":"1/2 teaspoon dried hot red-pepper flakes, or to taste"},"Instructions":"Put oven rack in middle position and preheat oven to 350°F.\nCook pasta in a 7- to 8-quart pot of boiling salted water 6 minutes, then stir in broccoli rabe and boil until pasta is al dente, about 5 minutes more.\nWhile pasta is cooking, toss panko with 1 tablespoon oil in a shallow baking pan until coated and bake, stirring once or twice, until golden, 8 to 10 minutes. Season crumbs with salt.\nWhile broccoli rabe (with pasta) is cooking, cook garlic, anchovies, and red-pepper flakes in remaining 7 tablespoons oil in a 12-inch heavy skillet over moderate heat, stirring and mashing anchovies into oil with a wooden spoon, until garlic is golden, about 3 minutes. Remove from heat.\nDrain pasta and broccoli rabe in a colander, then add to anchovy mixture in skillet, tossing to combine.\nServe pasta sprinkled with some toasted panko and pass remainder.","Image":"//20fix.com/xfood/img/gemelli-with-broccoli-rabe-and-anchovies-236944.jpg"},{"id":"12337","Title":"Pasta with Anchovies, Currants, Fennel, and Pine Nuts","Ingredients":{"1":"1/2 cup extra-virgin olive oil","2":"8 anchovy fillets","3":"1 large onion, very thinly sliced","4":"1 large fresh fennel bulb, trimmed, halved, very thinly sliced","5":"1/4 teaspoon dried crushed red pepper","6":"2 plum tomatoes, chopped","7":"1/4 cup pine nuts","8":"1/4 cup dried currants","9":"3/4 pound perciatelli (thick hollow spaghetti) or linguine","10":"1/4 teaspoon saffron threads","11":"1 cup fresh breadcrumbs, toasted"},"Instructions":"Heat oil in large skillet over medium heat. Add anchovies; mash with back of fork. Add onion, fennel, and red pepper. Sauté vegetables until tender, about 5 minutes. Add tomatoes, pine nuts, and currants. Reduce heat to low and cook 5 minutes to blend flavors; season with salt and pepper.\nMeanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite.\nDrain pasta, reserving 1 cup cooking liquid. Add saffron to reserved liquid and stir to dissolve. Return pasta and saffron water to pot. Add tomato mixture; toss over low heat until sauce coats pasta. Mix in breadcrumbs and transfer to bowl.","Image":"//20fix.com/xfood/img/pasta-with-anchovies-currants-fennel-and-pine-nuts-232702.jpg"},{"id":"13237","Title":"Marinated Fresh Anchovies (Alici Marinati)","Ingredients":{"1":"2 pounds fresh anchovies","2":"2 cups white wine vinegar","3":"2 cups extra-virgin olive oil","4":"2 tablespoons dried oregano","5":"2 tablespoons hot red pepper flakes","6":"1/4 cup finely chopped Italian parsley","7":"4 garlic cloves, sliced paper-thin","8":"2 tablespoons sea salt","9":"Lemon wedges (optional)"},"Instructions":"Using scissors, trim the fins off of all the anchovies. Using a sharp paring knife, slit each fish along the belly from head to tail; remove the entrails and rinse well. Cut off the heads and carefully pull out the spine and pin bones from the top with your index finger and thumbnail. Separate the two fillets and rinse again. Arrange a layer of the fillets in a deep oval gratin dish and sprinkle with a tablespoon or two of vinegar. Continue until all the fish fillets are used, then pour the rest of the vinegar over the fish. Cover and marinate in the fridge for at least 4 hours.\nRemove the anchovies from the vinegar, rinse, and pat dry with a kitchen towel. Wash out the dish and dry well. Return a single layer of cured anchovies to the dish and sprinkle with 2 or 3 tablespoons olive oil, a pinch of oregano, a pinch of pepper flakes, a pinch of parsley, three or four garlic slices, and a pinch of salt. Layer in the rest of the anchovies, sprinkling each layer with oil, oregano, pepper flakes, parsley, garlic, and salt. Cover again and marinate in the fridge for at least 2 hours.\nTo serve, bring anchovies to just below room temperature (in Italy they would be served at about 58°F). Remove from the oil and arrange six or seven on each plate with a lemon wedge if desired.","Image":"//20fix.com/xfood/img/marinated-fresh-anchovies-em-alici-marinati-em-107539.jpg"},{"id":"13301","Title":"Broccoflower with Anchovies and Garlic","Ingredients":{"1":"1 head broccoflower or cauliflower (1 1/2 pounds), cut into 2-inch-wide florets","2":"1/4 cup olive oil","3":"3 garlic cloves, thinly sliced","4":"21/2 teaspoons chopped canned anchovies, or to taste","5":"1/4 teaspoon dried hot red pepper flakes","6":"1/4 cuppine nuts, toasted","7":"1/4 cup golden raisins","8":"2 tablespoons chopped fresh parsley"},"Instructions":"Cook broccoflower in 2 batches in a 5- to 6-quart pot of <\"\">boiling salted water< > until crisp-tender, about 5 minutes, then transfer with a slotted spoon to a large bowl of ice and cold water to stop cooking. Drain florets and pat dry with paper towels.\nHeat oil in a 12-inch nonstick skillet over moderately high heat until hot but not smoking, then sauté garlic, stirring, until golden, about 1 minute. Add anchovies and red pepper flakes and sauté, stirring, until anchovies are dissolved, about 1 minute, then add florets and toss to coat. Add pine nuts, raisins, and salt to taste and sauté, stirring, until heated through, about 2 minutes. Remove from heat and stir in parsley.","Image":"//20fix.com/xfood/img/broccoflower-with-anchovies-and-garlic-107222.jpg"},{"id":"13465","Title":"Spaghetti with Anchovies, Olives, and Toasted Bread Crumbs","Ingredients":{"1":"1 pound dried spaghetti or linguine","2":"3 slices firm white sandwich bread","3":"1 onion","4":"3 large garlic cloves","5":"8 to 10 bottled or canned flat anchovy fillets","6":"a 12-ounce jar roasted red peppers","7":"a 2 1/4-ounce jar pitted green olives (about 3/4 cup)","8":"6 tablespoons olive oil","9":"1 cup dry white wine","10":"1/2 cup chopped fresh flat-leafed parsley leaves"},"Instructions":"Fill a 6-quart pasta pot three fourths full with salted water and bring to a boil for pasta.\nTear bread into pieces and in a blender or food processor pulse to make coarse crumbs. Finely chop onion. Mince garlic. Rinse anchovies and pat dry. In a sieve rinse and drain peppers and olives. Cut peppers into 1‚-inch-long strips and quarter olives.\nIn a deep 12-inch heavy skillet heat 2 tablespoons oil over moderate heat until hot but not smoking and stir in bread crumbs. Toast bread crumbs, stirring constantly, until golden and crisp, about 2 minutes, and transfer to a plate to cool. Wipe skillet clean.\nIn skillet heat remaining 4 tablespoons oil over moderately high heat until hot but not smoking and cook onion, stirring, until golden brown on edges. Remove skillet from heat and add garlic and anchovies. Cook mixture over moderately low heat, stirring until fillets are dissolved, about 2 minutes. Carefully pour wine down side of skillet and simmer, stirring occasionally, until liquid is reduced to about 2 tablespoons. Remove skillet from heat and stir in peppers, olives, and 1/4 cup parsley.\nCook pasta in boiling water, stirring occasionally, until al dente and ladle out and reserve 1 cup pasta water. Drain pasta in a colander and add to sauce with 1/2 cup reserved pasta water and salt and pepper to taste. Heat mixture over low heat, gently tossing (and adding more pasta water as needed if mixture becomes dry), until just heated through. Sprinkle pasta with remaining 1/4 cup parsley and some bread crumbs and serve remaining bread crumbs on the side.","Image":"//20fix.com/xfood/img/spaghetti-with-anchovies-olives-and-toasted-bread-crumbs-101772.jpg"}],"t":14,"p":{"limitstart":0,"limit":25,"total":14,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}