{"ingredient":"Spread","recipes":{"s":1,"d":[{"id":"1245","Title":"Eggplant and Yogurt Spread (Borani-E Bâdenjân)","Ingredients":{"1":"2 large eggplants (1 pound 2 ounces/500 g)","2":"1/4 cup (60 ml) extra-virgin olive oil","3":"1 medium onion (5 ounces/150 g), halved lengthwise and cut into thin wedges","4":"1 clove garlic, minced to a fine paste","5":"Sea salt and finely ground black pepper","6":"1/2 cup (125 g) labneh","7":"Pinch of saffron threads, soaked in 1 tablespoon water","8":"1/3 cup (50 g) walnuts, coarsely chopped","9":"Iranian flatbread, for serving"},"Instructions":"Preheat the broiler to high.\nPrick the eggplants in several places with the tip of a knife and place under the hot broiler. Broil for 30 to 40 minutes, turning them halfway through, until the skin is charred and the flesh is very soft. Halve the grilled eggplant lengthwise. Scoop out the flesh and place in a colander for about 20 minutes to drain off the excess liquid. Mash the eggplants.\nHeat the olive oil in a skillet over medium-high heat. Add the onion and cook until soft and lightly golden, about 5 minutes. Add the garlic and sauté for another minute or so. Add the mashed eggplants and season with salt and pepper to taste. Cook for another 5 minutes, stirring occasionally. Take off the heat and let cool.\nStir the strained yogurt into the cooled mixture. Transfer to a serving dish. Drizzle with the saffron water and sprinkle the chopped walnuts all over. Serve with the bread.","Image":"//20fix.com/xfood/img/iranian-eggplant-and-labneh-yogurt-spread-borani-e-badenjan.jpg"},{"id":"2902","Title":"Homemade Cheese Spread with Garlic and Herbs","Ingredients":{"1":"8 ounces cream cheese, softened","2":"2 tablespoons unsalted butter, softened","3":"1 small garlic clove, quartered","4":"1/4 teaspoon kosher salt","5":"1/4 cup chopped parsley leaves","6":"1 tablespoon chopped chives","7":"Crackers or toasts (for serving)"},"Instructions":"Combine cream cheese, butter, garlic, and salt in the bowl of a food processor. Pulse until smooth. Add parsley and chives and pulse a few times until well combined. Pack mixture into a small bowl, ramekin, or glass jar. Cover and chill at least 30 minutes. Serve with crackers or toasts.\nCheese can be made 5 days ahead. Cover and chill.","Image":"//20fix.com/xfood/img/homemade-cheese-with-garlic-and-herbs.jpg"},{"id":"2995","Title":"French Toast Fingers With Chocolate Hazelnut Spread and Blueberries","Ingredients":{"1":"2 cups half and half (500 mililiters)","2":"1 tablespoon honey","3":"1/2 ounce butter (15 grams) butter","4":"Zest of 1 orange","5":"1 vanilla bean, split and seeds scraped","6":"4 eggs","7":"5 1/2 ounces caster (superfine) sugar (150 grams)","8":"1 brioche loaf","9":"2 tablespoons homemade chocolate hazelnut spread","10":"1 cup blueberries (9 1/2 ounces/270 grams)","11":"1 1/2 fluid ounces coconut oil (50 milliliters)"},"Instructions":"Preheat oven to 325°F (175°C).\nPut the cream, honey, butter, orange zest and vanilla bean in a medium saucepan over medium-high heat. Bring to a boil, stirring, and remove from the heat.\nPut the eggs and sugar in a large bowl and whisk to combine.\nPour the hot cream mixture over the egg mixture and whisk to combine.\nUsing a bread knife, cut the crust off the brioche loaf to create a square log. Slice the loaf in half lengthways. Spread both halves with chocolate hazelnut spread, like you’re making a big sandwich, then add the blueberries to the middle and close the sandwich.\nSoak the brioche loaf in the warm egg custard for 10 minutes, or until it’s well soaked.\nPut coconut oil in a medium pan over medium heat and cook the brioche loaf until it’s golden brown all over, then finish in the oven for 5 minutes. Transfer to a plate lined with paper towel and slice into fingers.","Image":"//20fix.com/xfood/img/french-toast-fingers-with-chocolate-hazelnut-spread-and-blueberries.jpg"},{"id":"3070","Title":"Deviled Egg Salad Spread","Ingredients":{"1":"1/3 cup mayonnaise","2":"2 tablespoons Dijon mustard","3":"2 teaspoons fresh lemon juice","4":"1/4 teaspoon kosher salt","5":"1/4 teaspoon freshly ground black pepper","6":"1/4 teaspoon paprika, plus more for serving","7":"6 hard-boiled (12-minute) eggs, cut into 1/4-inch pieces","8":"1 tablespoon sliced chives, plus more for serving","9":"Sliced bread, preferably pumpernickel or rye, cut into triangles, toasted (for serving)"},"Instructions":"Mix mayonnaise, Dijon, lemon juice, salt, pepper, and 1/4 tsp. paprika in a medium bowl. Fold in eggs and 1 Tbsp. chives and stir to combine.\nSpread on toasts, then garnish with chives and a sprinkle of paprika.\nEgg salad spread, without chives, can be made 3 days ahead. Store in an airtight container and chill. Fold in chives when ready to serve.","Image":"//20fix.com/xfood/img/deviled-egg-salad-spread.jpg"},{"id":"3627","Title":"Creamy Black Bean Spread","Ingredients":{"1":"2 tablespoons vegetable oil or lard","2":"1 large white onion, finely chopped","3":"1 1/2 teaspoons kosher salt, divided","4":"1/2 teaspoon ground fennel seeds","5":"2 (15-ounce) cans black beans, drained"},"Instructions":"Heat oil in a large skillet over medium-high. Add onion and 1/2 tsp. salt and cook, stirring occasionally, until caramelized, about 15 minutes. Stir in fennel and cook 30 seconds. Add beans, remaining 1 tsp. salt, and 2 Tbsp. water and heat through, stirring to combine. Transfer to a food processor or blender and purée until smooth.\nBean spread can be stored in an airtight container and chilled for up to 3 days. Bring to room temperature before serving.","Image":"//20fix.com/xfood/img/creamy-black-bean-spread-56389830.jpg"},{"id":"4809","Title":"Charred Eggplant and Tahini Spread","Ingredients":{"1":"1 large eggplant, cut lengthwise into quarters","2":"1/4 cup olive oil, plus more for drizzling","3":"Kosher salt and freshly ground black pepper","4":"1 clove garlic finely grated","5":"1 teaspoon finely grated lemon zest","6":"1 tablespoon fresh lemon juice","7":"1 tablespoon tahini (sesame seed paste)","8":"3/4 teaspoon ground cumin","9":"Toasted sesame seeds"},"Instructions":"Preheat oven to 475°F. Place eggplant on a baking sheet and toss with 1/4 cup oil; season with salt and pepper. Roast until lightly charred and very tender, 20–25 minutes; let cool slightly. Chop eggplant (skin and all) until almost a paste.\nMix eggplant in a medium bowl with garlic, lemon zest, lemon juice, tahini, and cumin; season with salt and pepper. Drizzle with oil and top with sesame seeds.","Image":"//20fix.com/xfood/img/charred-eggplant-and-tahini-spread-51223610.jpg"},{"id":"5202","Title":"Cheddar and Horseradish Spread","Ingredients":{"1":"3 cups grated cheddar","2":"1/3 cup dry white wine","3":"1/3 cup sour cream","4":"3 tablespoons drained prepared horseradish","5":"1/2 teaspoons hot paprika","6":"Kosher salt","7":"Freshly ground black pepper"},"Instructions":"Process 3 cups grated cheddar, 1/3 cup dry white wine, 1/3 cup sour cream, 3 tablespoons drained prepared horseradish, and 1/2 teaspoons hot paprika in a food processor until smooth; season with kosher salt and freshly ground black pepper. Serve topped with more paprika.","Image":"//20fix.com/xfood/img/cheddar-and-horseradish-spread-51193050.jpg"},{"id":"5380","Title":"Kimchi Spread","Ingredients":{"1":"1 1/2 cups Napa cabbage kimchi (a 12-ounce jar; do not drain), chopped","2":"2 tablespoons gochujang (Korean hot pepper paste)","3":"Ingredient info: Gochujang is available at Korean markets and online."},"Instructions":"Mix kimchi and gochujang in a small bowl.\nDO AHEAD: Kimchi spread can be made 1 week ahead. Cover and chill.","Image":"//20fix.com/xfood/img/kimchi-spread-51178650.jpg"},{"id":"5668","Title":"Egg and Gribenes Spread","Ingredients":{"1":"4 large eggs","2":"1/2 Spanish onion, finely diced","3":"1 to 2 tablespoons/15 to 30 grams Schmaltz","4":"Kosher salt","5":"Freshly ground black pepper","6":"1/4 teaspoon cayenne","7":"1 tablespoon minced shallot macerated in a tablespoon of lemon juice for at least 5 minutes","8":"1 teaspoon fish sauce","9":"1 small celery stalk, diced","10":"2 tablespoons/15 grams gribenes"},"Instructions":"1. In a small saucepan, cover the eggs with 1 inch/3 centimeters of water and bring the water to a boil over high heat. As soon as the water reaches a full boil, cover the pan and take it off the heat. Let the eggs sit in the covered pan, off the heat, for 12 to 15 minutes, then remove them from the water. (Or, if you have a pressure cooker, steam them for 7 minutes, then chill; these are invariably easier to peel.) Run the eggs under cold water, or transfer them to an ice bath, till they're thoroughly chilled. Peel the eggs.\n2. Meanwhile, in a separate small saucepan over medium heat, saute half the onion in 1 teaspoon schmaltz till translucent. It's a good idea to give them a pinch of salt as you do this, don't be shy. Transfer the onions to a plate and allow to cool slightly.\n3. Combine all the ingredients except the celery and gribenes and do any of the following: put them through a meat grinder fitted with a medium or small die; coarsely chop them in a food processor; chop by hand and finish by mashing to a pleasing consistency with a fork. Then fold in the celery and the gribenes.","Image":"//20fix.com/xfood/img/egg-and-gribenes-spread-51150200.jpg"},{"id":"5866","Title":"Better Than Nutella (Chocolate-Hazelnut Spread)","Ingredients":{"1":"2 cups (heaping) hazelnuts, preferably skinned (about 10 ounces)","2":"1/4 cup sugar","3":"1 pound semisweet or bittersweet chocolate, coarsely chopped","4":"1/2 cup (1 stick) unsalted butter, cut into 1\" pieces, room temperature","5":"1 cup heavy cream","6":"3/4 teaspoon kosher salt","7":"Four clean 8-ounce jars"},"Instructions":"Preheat oven to 350°F. Spread out nuts on a rimmed baking sheet or in an ovenproof skillet. Roast, shaking sheet once for even toasting, until deep brown, 13-15 minutes. Let cool completely. (If nuts have skins, rub them in a kitchen towel to remove.)\nGrind hazelnuts and sugar in a food processor until a fairly smooth, buttery paste forms, about 1 minute.\nPlace chocolate in a medium metal bowl. Set bowl over a large saucepan of simmering water; stir often until chocolate is melted and smooth. Remove bowl from over saucepan; add butter and whisk until completely incorporated. Whisk in cream and salt, then hazelnut paste.\nPour gianduja into jars, dividing equally. Let cool. (Gianduja will thicken and become soft and peanut butter- like as it cools.) Screw on lids. DO AHEAD: Gianduja can be made up to 4 weeks ahead; keep chilled. Let stand at room temperature for 4 hours to soften. Can stand at room temperature up to 4 days.","Image":"//20fix.com/xfood/img/better-than-nutella-chocolate-hazelnut-spread-51134600.jpg"},{"id":"6773","Title":"Chocolate and Hazelnut Spread","Ingredients":{"1":"1/2 cup blanched hazelnuts","2":"3 1/2 oz (100g) dark chocolate (72% cacao), chopped","3":"1/3 cup and 2 tablespoons sweetened condensed milk","4":"1-2 tablespoons hazelnut oil","5":"Pinch of salt","6":"3-4 tablespoons hot water"},"Instructions":"Preheat the oven to 350°F (180°C). Turn the hazelnuts out onto a baking sheet and toast in the preheated oven for about 5-7 minutes, until pale golden. Remove the nuts from the oven and cool slightly. Put the warm hazelnuts into a food processor and chop until they become an almost smooth paste.\nGently melt the chocolate, condensed milk, and hazelnut oil in a small saucepan over low heat. Stir until smooth and add to the hazelnut paste in the food processor. Add a pinch of salt and blend, then add the hot water and blend again until the mixture has a thick, spreadable consistency.\nSpoon into a pretty sterilized jar and let cool. Cover with a lid and label when cold.","Image":"//20fix.com/xfood/img/chocolate-and-hazelnut-spread-367792.jpg"},{"id":"7857","Title":"Spicy Sweet Potato Spread","Ingredients":{"1":"2 or 3 small to medium sweet potatoes (about 12 ounces)","2":"2 large garlic cloves, minced","3":"1 teaspoon hot red pepper sauce","4":"1/2 teaspoon salt","5":"1/4 teaspoon cayenne pepper","6":"1/4 cup juice from 2 limes","7":"2/3 cup olive oil","8":"1/3 cup canned chicken broth"},"Instructions":"1. Cook the potatoes in the microwave on high power until soft, 10 to 12 minutes. Holding potatoes in an oven mitt, peel (or peel when cool enough to handle).\n2. Process the potatoes, garlic, pepper sauce, salt, cayenne, and lime juice in the workbowl of the food processor fitted with the metal blade until puréed. With the machine running, gradually add oil through the feeder tube. Continue to process, adding broth through the feeder tube until the mixture is light and silky. Transfer to a serving bowl.","Image":"//20fix.com/xfood/img/spicy-sweet-potato-spread-358369.jpg"},{"id":"8164","Title":"Chickpea Spread","Ingredients":{"1":"1/2 Spanish or sweet onion, thickly sliced","2":"Extra-virgin olive oil","3":"Kosher salt and cracked black pepper","4":"40 large, plump sun-dried tomatoes (about 2 cups)","5":"6 cloves garlic, smashed","6":"2 large shallots, thickly sliced","7":"8 leaves basil","8":"1 teaspoon ground cumin","9":"1 cup extra-virgin olive oil","10":"3 tablepoons fresh lemon juice","11":"3 cups Chickpea Confit , drained"},"Instructions":"Brush the onion slices with a little olive oil and season with kosher salt and pepper. On a hot griddle pan or in a cast-iron skillet, grill until tender and slightly char-marked.\nIn a food processor, combine the grilled onion, sun-dried tomatoes, garlic, shallots, basil, and cumin. Pulse into a chunky purée. With the motor running, slowly drizzle in the olive oil, then the lemon juice. The mixture should be quite smooth.\nTransfer to a large bowl and add the Chickpea Confit. Fold together to blend. Return to the food processor in batches, and purée until the mixture is smooth and thick. Season to taste with pepper and salt (if the sun-dried tomatoes are very salty, you may not need much). The texture is a matter of taste; if it is very thick, add a little more olive oil to yield a creamier result. Well covered, the spread will last for at least a week in the refrigerator.\nFor two different textures, puree half the spread until very smooth and pale, and leave the other half chunky.\nIf you refrigerate the spread overnight, you can return it to a nice creamy texture by rewhipping in the food processor (pulse on and off for 1 minute).\nThe Wedge: Cut a small triangle of pita and smear with Chickpea Spread. Top with a pinch of crumbled feta and some sliced scallions, picked sprigs of parsley or dill, and a few slivers of olive.","Image":"//20fix.com/xfood/img/chickpea-spread-356229.jpg"},{"id":"8238","Title":"Baccalà Mantecato: A Savory Spread of Whipped Salt Cod","Ingredients":{"1":"1 pound boneless baccalà (salt cod), soaked to remove salt","2":"1 medium russet potato (about 1/2 pound)","3":"2 plump garlic cloves, finely minced","4":"1 cup extra-virgin olive oil","5":"1/2 cup half-and-half or light cream","6":"1/2 cup poaching water from cooking the baccalà","7":"freshly ground black pepper to taste","8":"A heavy-duty electric mixer with the paddle attachment or a food processor"},"Instructions":"When the baccalà is sufficiently soaked, cut it into small pieces—6 inches or so—and put them in a saucepan or deep skillet with at least an inch of water to cover. Bring to a boil, set the cover ajar (rest it on a wooden spoon set on the rim of the pan), and cook at a steady bubbling boil for 20 minutes or more, until the cod is easy to flake but still has body and shape. Don't let it start to break apart. Lift it out of the cooking water, and let it drain and cool in a colander. Reserve a cup of the cooking water.\nMeanwhile, rinse the potato but leave it whole and unpeeled. Put it in a small pot covered with cold water. Bring to the boil, and cook steadily until you can easily pierce the potato with a knife blade.\nLet it cool, and peel it.\nSet up the electric mixer and flake all the fish into the bowl. Beat with the paddle at low speed to break the fish up more; drop in the minced garlic, and beat at medium speed while you pour in half the olive oil very gradually in a thin stream, then add the potato and incorporate it; continue beating at low speed as you gradually add the rest of the oil.\nNow raise the speed to high and whip the fish to lighten it.\nReduce the speed to medium and incorporate the half-and- half gradually, then whip at high speed again. At this point the whipped cod should be smooth and fluffy, almost like mashed potatoes but with texture. If it is very dense, you can thin it with the cooking water (but be careful: too much water will make it too salty).\nFinally, season with pepper and beat it in to blend. If you use a food processor instead of a mixer, follow the same order of additions, and process as needed to form a light, smooth spread. Put the spread in containers and store sealed, in the refrigerator, for up to a week. You can also freeze baccalà mantecato; the texture will not be as creamy, but it will have good flavor and makes a delicious pasta sauce.","Image":"//20fix.com/xfood/img/baccala-mantecato-a-savory-spread-of-whipped-salt-cod-355908.jpg"},{"id":"8526","Title":"Roasted Red Pepper and Walnut Spread","Ingredients":{"1":"2 (7-to 8-ounces) jars roasted red peppers, rinsed and drained","2":"1 cup coarse fresh bread crumbs (from a baguette)","3":"1 cup walnuts (4 ounces), toasted","4":"1 tablespoon red-wine vinegar","5":"1/2 teaspoon cumin","6":"1/8 teaspoon cayenne","7":"1/4 cup extra-virgin olive oil"},"Instructions":"Purée roasted red peppers, bread crumbs, walnuts, vinegar, cumin, cayenne, and 1/4 teaspoon salt in a food processor until almost smooth.\nWith motor running, add oil in a slow stream, blending until incorporated.","Image":"//20fix.com/xfood/img/roasted-red-pepper-and-walnut-spread-354472.jpg"},{"id":"8632","Title":"Eggplant and Sun-dried Tomato Spread","Ingredients":{"1":"1 head garlic","2":"6 1/2 tablespoons extra-virgin olive oil, divided","3":"2 1/2 pounds eggplant","4":"1/2 cup oil-packed sun-dried tomatoes (3 ounces), chopped, plus 2 tablespoons tomato oil","5":"1/2 cup chopped flat-leaf parsley","6":"1/2 cup chopped basil","7":"1 tablespoon fresh lemon juice","8":"Accompaniment: toasted baguette slices"},"Instructions":"Preheat oven to 400°F with rack in middle.\nCut off and discard top of garlic head to expose cloves. Brush top of head with 1/2 tablespoon olive oil. Wrap garlic in foil and roast until tender, about 45 minutes. Cool to warm, then squeeze garlic cloves from skins into a small bowl, discarding skins.\nMeanwhile, cut eggplant into 1/2-inch pieces and toss with 1 1/2 teaspoons salt in a large colander. Let drain 30 minutes. Squeeze eggplant in a kitchen towel to remove liquid.\nHeat 2 tablespoons olive oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then sauté one third of eggplant until browned and tender, about 6 minutes. Transfer to a bowl. Cook remaining eggplant in olive oil in same manner (in 2 batches), transferring to bowl.\nAdd 1 cup cooked eggplant to garlic and coarsely mash together. Stir into remaining eggplant with sun-dried tomatoes (without tomato oil), parsley, basil, lemon juice, and 3/4 teaspoon pepper. Season with salt and drizzle with tomato oil.\nArtezin Mendocino Zinfandel '07 or Château de Chamirey Mercurey Rouge '07","Image":"//20fix.com/xfood/img/eggplant-and-sun-dried-tomato-spread-354212.jpg"},{"id":"10710","Title":"Crostini with Feta-Chile Spread","Ingredients":{"1":"3 large fresh poblano chiles*","2":"1 jalapeño chile","3":"4 ounces feta cheese (about 1/2 cup)","4":"1/4 cup low-fat sour cream","5":"1 tablespoon finely chopped fresh dill","6":"2 teaspoons fresh lemon juice","7":"18 (1/2-inch-thick) baguette slices","8":"Extra-virgin olive oil', \"*Poblano chiles are often called pasillas. They're available at some supermarkets and at specialty foods stores and Latin markets.\"]"},"Instructions":"Prepare barbecue (medium heat). Char poblano and jalapeño chiles until blackened all over. Wrap chiles in paper bag and let stand 15 minutes. Peel, seed, and coarsely chop 2 poblano chiles and jalapeño chile; transfer to processor. Add feta cheese, sour cream, chopped fresh dill, and lemon juice to processor; puree until smooth. Season with salt and pepper. Cover and chill until firm enough to spread, about 2 hours. Peel, seed, and thinly slice remaining poblano chile. DO AHEAD Can be made 1 day ahead. Keep spread chilled. Cover and chill sliced chile.\nPrepare barbecue (medium-high heat). Brush 1 side of baguette slices with extra-virgin olive oil. Grill oiled side of bread until toasted, about 2 minutes. Transfer toasts to platter. Spoon about 2 teaspoons chile spread over each toast, top with thinly sliced poblano chile, and serve.","Image":"//20fix.com/xfood/img/crostini-with-feta-chile-spread-239083.jpg"},{"id":"11629","Title":"Smoked-Trout Spread","Ingredients":{"1":"1 lb smoked trout fillets, skin discarded and any silver skin scraped off","2":"2 sticks (1 cup) unsalted butter, softened","3":"1/3 cup finely chopped shallot","4":"1/4 cup finely chopped fresh dill","5":"1 tablespoon fresh lemon juice","6":"1/2 teaspoon hot sauce such as Tabasco","7":"1/4 teaspoon black pepper","8":"1 cup cold water","9":"Accompaniment: whole-grain crackers"},"Instructions":"Flake trout and transfer 2 cups to a food processor, then blend with butter, shallot, dill, lemon juice, hot sauce, and pepper until smooth. Reserve remaining trout.\nWith motor running, add water to trout purée in a slow stream and process until water is absorbed, about 1 minute. Transfer to a bowl and fold in reserved trout, then pack mixture into a 4-cup glass or ceramic mold or bowl. Cover surface with wax paper, then tightly cover with plastic wrap and chill at least 6 hours to allow flavors to develop. Bring spread to room temperature before serving. (This will take 1 to 2 hours.)","Image":"//20fix.com/xfood/img/smoked-trout-spread-233241.jpg"},{"id":"11757","Title":"Shrimp with Zucchini Fritters and Grape-Leaf Spread","Ingredients":{"1":"4 ounces cream cheese","2":"4 grape leaves in brine from jar, drained","3":"1 tablespoon fresh lemon juice","4":"1/2 cup all purpose flour","5":"3/4 teaspoon salt","6":"1/4 teaspoon ground black pepper","7":"1/4 teaspoon baking soda","8":"1/8 teaspoon ground nutmeg","9":"1 3/4 cups coarsely grated zucchini (about 1 medium)","10":"1/4 cup chopped fresh Italian parsley","11":"1 tablespoon chopped fresh chives","12":"3 tablespoons (about) extra-virgin olive oil","13":"12 cooked large shrimp, peeled, deveined","14":"Additional fresh lemon juice","15":"Grated lemon peel"},"Instructions":"Blend cream cheese, grape leaves, and lemon juice in mini processor until grape leaves are minced and mixture is blended. Season spread to taste with salt and pepper. Can be made 1 day ahead. Transfer spread to small bowl. Cover and refrigerate. Bring spread to room temperature before using.\nWhisk first 5 ingredients in medium bowl to blend. Mix in zucchini, parsley, and chives. Let stand until batter becomes moist, about 15 minutes. Using wet hands, shape by rounded tablespoonfuls into twelve 2-inch-diameter patties; place on foil.\nHeat 2 tablespoons oil in heavy large skillet over medium-high heat. Add about half of patties. Sauté until cooked through, browned, and crisp, about 3 minutes per side. Transfer to platter. Repeat with remaining patties, adding more oil, if needed.\nSpread heaping teaspoon grape-leaf spread on each fritter. Top each with 1 shrimp. Sprinkle fritters with lemon juice, then lemon peel, and serve.","Image":"//20fix.com/xfood/img/shrimp-with-zucchini-fritters-and-grape-leaf-spread-235145.jpg"},{"id":"11912","Title":"BLT with Avocado Spread","Ingredients":{"1":"1 extra ripe avocado","2":"2 tablespoons fresh lemon juice","3":"1/2 teaspoon salt","4":"1/8 teaspoon cayenne pepper","5":"8 slices turkey bacon","6":"8 slices whole-wheat bread","7":"8 leaves romaine lettuce","8":"2 medium tomatoes, cut into 12 slices","9":"1 small red onion, thinly sliced"},"Instructions":"Combine spread ingredients in a bowl. Mash until smooth and set aside. Prepare bacon as directed on package; drain thoroughly on paper towels. Toast bread. Place 4 slices on 4 plates. Spread an equal amount of avocado spread on each slice. Top each with 1/4 of the bacon, lettuce, tomato, and onion. Cover each with another slice of toast. Cut sandwiches in half and serve immediately.","Image":"//20fix.com/xfood/img/blt-with-avocado-spread-230138.jpg"},{"id":"12410","Title":"Sardine \"Tonnato\" Spread","Ingredients":{"1":"2 (3 3/4-oz) cans brisling sardines packed in olive oil, drained","2":"1/4 cup mayonnaise","3":"1 tablespoon finely chopped fresh flat-leaf parsley","4":"2 teaspoons drained bottled capers, chopped","5":"1 teaspoon finely grated fresh lemon zest","6":"2 teaspoons fresh lemon juice","7":"1/4 teaspoon black pepper","8":"1/8 teaspoon salt"},"Instructions":"Mash together all ingredients in a bowl with a fork until combined well.","Image":"//20fix.com/xfood/img/sardine-tonnato-spread-232506.jpg"},{"id":"12411","Title":"Ham and Cheese Spread","Ingredients":{"1":"1/2 lb sliced good-quality cooked smoked ham","2":"1 1/2 oz finely shredded Gruyère (1/2 cup)","3":"3/4 stick (6 tablespoons) unsalted butter, softened","4":"1 rounded tablespoon whole-grain mustard","5":"4 cornichons (French sour gherkins), finely chopped","6":"1/4 teaspoon black pepper"},"Instructions":"Pulse ham in a food processor until finely chopped, then transfer to a bowl. Stir in remaining ingredients with a rubber spatula until combined well.","Image":"//20fix.com/xfood/img/ham-and-cheese-spread-232505.jpg"},{"id":"12416","Title":"Mozzarella Pesto Spread","Ingredients":{"1":"1/2 lb coarsely grated mozzarella (2 cups)","2":"1/4 cup well-stirred prepared pesto","3":"1/4 cup finely chopped drained oil-packed sun-dried tomatoes"},"Instructions":"Stir together all ingredients in a bowl until combined well.","Image":"//20fix.com/xfood/img/mozzarella-pesto-spread-232500.jpg"},{"id":"12417","Title":"Cheddar, Red Pepper, and Horseradish Spread","Ingredients":{"1":"1/2 lb finely grated extra-sharp Cheddar (2 1/4 cups)","2":"1 (7-oz) bottle roasted red peppers, rinsed, drained, patted dry, and finely chopped (1/2 cup)","3":"1/3 cup mayonnaise","4":"1 rounded tablespoon drained bottled horseradish","5":"1/2 teaspoon Worcestershire sauce","6":"1/4 teaspoon salt","7":"1/4 teaspoon black pepper"},"Instructions":"Stir together all ingredients in a bowl until combined well.","Image":"//20fix.com/xfood/img/cheddar-red-pepper-and-horseradish-spread-232499.jpg"}],"t":24,"p":{"limitstart":0,"limit":25,"total":24,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}