{"ingredient":"Biscuit","recipes":{"s":1,"d":[{"id":"210","Title":"Sour Cream and Onion Biscuits","Ingredients":{"1":"2½ tsp. Diamond Crystal or 1½ tsp. Morton kosher salt","2":"1 tsp. freshly ground black pepper","3":"1¾ tsp. baking powder","4":"½ tsp. baking soda","5":"1¼ tsp. sugar","6":"2½ cups (313 g) all-purpose flour, plus more for surface","7":"10 Tbsp. chilled unsalted butter, cut into (½\") pieces, plus 2 Tbsp. melted","8":"8 scallions, thinly sliced crosswise (not on a diagonal)","9":"1¼ cups sour cream, plus more for serving","10":"Flaky sea salt"},"Instructions":"Place a rack in middle of oven; preheat to 425°F. Whisk salt, pepper, baking powder, baking soda, sugar, and 2½ cups flour in a large bowl to combine. Add chilled butter and toss to coat. Using your hands, work butter into dry ingredients until there are lots of flat pieces and pea-size bits. Add scallions and toss to evenly distribute.\nCreate a well in the center of mixture and add 1¼ cups sour cream into the center. Using a fork and working in circles, mix until large shaggy clumps form. Turn dough out onto a lightly floured surface and knead once or twice until it comes together (flour your hands if needed). If there are any loose bits, add them to center of dough and knead once more to incorporate. Pat dough into an 8x4\" rectangle about 1\" thick.\nWorking from a short side, fold dough in thirds as you would a letter. It doesn’t need to overlap perfectly. Pat dough into another 8x4\" rectangle, then fold dough in thirds like a letter one more time. Pat dough back into an 8x4\" rectangle and cut in half lengthwise. Cut each half crosswise into 4 squares for a total of 8 biscuits.\nTransfer biscuits to a parchment-lined baking sheet. Brush tops gently with melted butter; sprinkle with sea salt. Bake biscuits until golden brown, 18–22 minutes. Serve warm with sour cream (or more butter!) for slathering.","Image":"//20fix.com/xfood/img/sour-cream-and-onion-biscuits.jpg"},{"id":"267","Title":"Sourdough Biscuits","Ingredients":{"1":"1½ tsp. baking powder","2":"½ tsp. baking soda","3":"1 tsp. kosher salt","4":"½ tsp. sugar","5":"1½ cups (188 g) all-purpose flour, plus more for dusting","6":"½ cup (1 stick) chilled unsalted butter or vegan butter (preferably Miyoko’s), cut into small pieces, plus 2 Tbsp. melted for brushing","7":"1 cup (270 g) sourdough starter discard from a starter fed within the previous 24 hours, room temperature","8":"Flaky sea salt (optional)"},"Instructions":"Preheat oven to 425°. Stir together baking powder, baking soda, kosher salt, sugar, and 1½ cups flour with a fork in a large bowl. Add ½ cup chilled butter and toss with your hands or fork just to coat. Using your fingers, smash butter into flat disks (if you miss a few, it will be fine). Using a pastry cutter or fork, work butter into dry ingredients until shaggy crumbles form (you should have some large pieces, some small pieces, some flat pieces, and some sandy flour).\nAdd sourdough starter and mix gently with fork to incorporate, then fold with your hands just until dough comes together with just a few crumbly pieces in the bottom of the bowl.\nTransfer dough to a well-floured surface and pat out with your hands until about ½” thick (the shape doesn’t matter too much at this point). Fold into thirds as you would a letter to create a rough rectangle. Working from short sides, fold in thirds like a letter again. Pat dough out to a ½”-thick square. Repeat folding process. Pat out dough for a third time to a 1”-thick square—it should feel airy, like a pillow at this point. Using a floured 2½”-diameter biscuit cutter or glass, punch out as many biscuits as you can (do not twist cutter). Transfer biscuits to a parchment-lined rimmed baking sheet, spacing at least 1” apart.\nUsing your hands, gently press scraps into a rectangle, then fold in half. Pat out to a 1”-thick rectangle and cut out more biscuits. Gather remaining scraps together to form 1 final biscuit (you should have 10 total). Transfer to baking sheet. Brush biscuit tops with 2 Tbsp. melted butter and sprinkle with sea salt if desired\nBake biscuits until tall and golden and an instant-read thermometer inserted into the side of a biscuit registers 205°F), 12–15 minutes.","Image":"//20fix.com/xfood/img/sourdough-biscuits.jpg"},{"id":"643","Title":"Cherry Biscuit Cobbler","Ingredients":{"1":"1/4 cup granulated sugar","2":"1 Tbsp. baking powder","3":"2 tsp. finely grated lemon zest","4":"1 tsp. kosher salt","5":"2 cups all-purpose flour, plus more for surface","6":"1/2 cup (1 stick) chilled unsalted butter, cut into pieces","7":"1 1/3 cups chilled heavy cream","8":"2 lb. fresh (or frozen) sweet cherries, pitted","9":"1/2 cup granulated sugar","10":"1/4 cup fresh lemon juice","11":"3 Tbsp. cornstarch","12":"1/2 tsp. ground cinnamon","13":"1 tsp. vanilla extract","14":"1/4 tsp. almond extract","15":"1/4 tsp. kosher salt","16":"3 Tbsp. unsalted butter, melted, slightly cooled","17":"2 Tbsp. raw sugar","18":"Vanilla ice cream or softly whipped cream (for serving)","19":"A 1 1/2\"-diameter cookie cutter"},"Instructions":"Whisk granulated sugar, baking powder, lemon zest, salt, and 2 cups flour in a medium bowl. Add butter and toss to coat. Quickly smash butter into flour mixture with your fingers, working until the largest pieces are about the size of a pea. Gradually stream cream into bowl, tossing flour mixture constantly with a fork to distribute. Using a flexible bench scraper or a hard plastic spatula, fold dough over and onto itself several times, scraping bottom and sides of the bowl, to bring together into a mass (dough will feel very wet and sticky).\nTurn out dough onto a generously floured surface. Pat into a 3/4\"-thick rectangle or square with floured hands, using bench scraper or spatula to lift up dough and dust underneath with more flour as needed to prevent sticking. Dust surface with more flour, then cut dough into 4 equal pieces and stack on top of each other. Dust with flour and press down on stack with a rolling pin to flatten to a workable height. Roll out to 1/2\" thick, dusting with more flour as needed.\nUse cutter to punch out biscuits as closely as possible, dipping cutter in flour often. Transfer biscuits to a plate. You should have about 40. Gather up dough scraps, reroll, and punch out more biscuits if needed. Chill until ready to use.\nDo Ahead: Dough can be made 1 day ahead; wrap tightly and chill.\nPlace a rack in middle of oven and preheat to 400°F. Mix cherries, granulated sugar, lemon juice, cornstarch, cinnamon, vanilla extract, almond extract, and salt in a large bowl. Scrape filling into a 2-qt. baking dish or 9\"-diameter cake pan with 2\" sides and press down on it firmly to compact. Place on a foil-lined baking sheet.\nArrange chilled biscuits over filling, fitting snugly so they’re touching with only a few gaps. Brush generously with butter; sprinkle with raw sugar.\nBake cobbler 10 minutes. Reduce heat to 350°F and continue to bake until biscuits are golden brown and juices are bubbling, 50–65 minutes more. Let cool slightly. Serve cobbler with ice cream.\nDo Ahead: Cobbler can be baked 1 day ahead; store tightly covered at room temperature.","Image":"//20fix.com/xfood/img/cherry-biscuit-cobbler.jpg"},{"id":"945","Title":"Skillet Dressing with Cornbread and Biscuits","Ingredients":{"1":"1 1/2 cups fine-grind white cornmeal","2":"1/2 cup all-purpose flour","3":"1 Tbsp. sugar","4":"1 tsp. baking powder","5":"1 tsp. baking soda","6":"1 tsp. kosher salt","7":"1/2 tsp. freshly ground black pepper","8":"1 large egg","9":"2 cups buttermilk","10":"1/4 cup grapeseed, vegetable, or other neutral oil","11":"2 Tbsp. unsalted butter","12":"2 Tbsp. unsalted butter, plus more for pan","13":"1 large onion, finely chopped","14":"3 large celery stalks, finely chopped","15":"2 1/4 tsp. kosher salt, divided","16":"4 biscuits (about 12 oz. total), such as Fluffy Cathead Biscuits","17":"2 Tbsp. ground dried sage","18":"1 tsp. freshly ground black pepper","19":"3 large eggs","20":"3 1/2 cups turkey stock or low-sodium chicken or vegetable broth","21":"1/4 cup apple cider vinegar"},"Instructions":"Place a large cast-iron skillet in oven; preheat to 425°F. Whisk cornmeal, flour, sugar, baking powder, baking soda, salt, and pepper in a large bowl to combine. Whisk egg, buttermilk, and oil in a medium bowl to combine. Create a well in dry ingredients. Pour buttermilk mixture into well and whisk until no dry spots remain.\nRemove cast-iron skillet from oven (be careful; pan will be very hot). Add butter to pan and swirl to coat. Pour batter into pan and spread evenly. Bake cornbread until edges are golden brown and top is golden, 20–25 minutes.\nImmediately turn cornbread out onto a wire rack so bottom stays crisp. Let cool slightly, then invert onto another wire rack and let cool completely.\nDo Ahead: Cornbread can be baked 5 days ahead. Store tightly wrapped at room temperature, or freeze up to 3 months.\nPreheat oven to 375°F. Butter a large cast-iron skillet; set aside. Melt remaining 2 Tbsp. butter in a large skillet over medium heat. Add onion, celery, and a pinch of salt and cook, stirring occasionally, until vegetables are softened and just starting to take on some color, about 10 minutes.\nMeanwhile, tear cornbread into roughly 1\" pieces and transfer to a large bowl. Tear biscuits into slightly smaller pieces and add to same bowl.\nScrape vegetable mixture into bowl with bread and add sage, pepper, and remaining 2 tsp. salt. Gently toss to combine. Whisk eggs, stock, and vinegar in a medium bowl to combine. Drizzle over cornbread mixture and gently toss again to incorporate. Spoon dressing into prepared pan and bake until set and browned and crisp across the top, 45–55 minutes.\nDo Ahead: Dressing can be baked 1 day ahead. Let cool, then cover with foil and chill. Reheat in a 350°F oven, covered, until warmed through, 25–30 minutes, before serving.","Image":"//20fix.com/xfood/img/skillet-dressing-with-cornbread-and-biscuits.jpg"},{"id":"1551","Title":"Gold Medal® Classic Biscuits","Ingredients":{"1":"2 cups Gold Medal™ all-purpose flour","2":"1 tablespoon sugar","3":"3 teaspoons baking powder","4":"1 teaspoon salt","5":"1/2 cup shortening, butter, or margarine","6":"3/4 cup milk"},"Instructions":"Heat the oven to 450°F. In a medium bowl, stir the flour, sugar, baking powder and salt until mixed. Cut in the shortening using a pastry blender or fork, until mixture looks like fine crumbs. Stir in the milk until mixture forms a soft dough and leaves the side of the bowl (dough will be soft and sticky).\nLightly sprinkle flour over a cutting board or countertop. Place dough on floured surface; gently roll in the flour to coat. To knead dough, fold dough toward you. With the heels of your hands, lightly push dough away from you with a short rocking motion. Move dough a quarter turn and repeat 10 times. Dough will feel springy and smooth.\nOn the floured surface, flatten dough evenly, using hands or a rolling pin, until dough is 1/2 inch thick.\nBefore cutting each biscuit, dip a 2 1/2-inch round cutter into flour to lightly coat it so it will cut cleanly through the dough without sticking. To cut, push the cutter straight down through the dough without twisting or turning. Cut the biscuits as close together as possible. On an ungreased cookie sheet, place biscuits about 1 inch apart for biscuits with crusty sides, or place with sides touching for biscuits with soft sides.\nBake 10 to 12 minutes or until golden brown. Immediately remove from cookie sheet. Serve warm.\nThis recipe is made available as a courtesy by BettyCrocker.com, a property of General Mills Inc.","Image":"//20fix.com/xfood/img/gold-medal-classic-biscuits.jpg"},{"id":"1553","Title":"Garlic Cheddar Biscuits","Ingredients":{"1":"2 3/4 cups all-purpose flour","2":"1 tbsp Davis or Clabber Girl Baking Powder","3":"1/2 tsp garlic powder, plus an extra 1/4 tsp (optional)","4":"1/2 tsp salt","5":"1 cup shortening","6":"1 cup buttermilk","7":"1 cup shredded cheddar cheese","8":"2 tbsp butter, melted"},"Instructions":"Preheat oven to 425°F. Combine flour, baking powder, 1/2 teaspoon garlic powder and salt. Using a pastry blender or 2 forks cut in shortening until mixture is crumbly. With a fork, add buttermilk and cheese and stir until mixture forms a soft dough. Drop dough by 1/4 cupfuls onto greased cookie sheet. Combine butter and remaining 1/4 teaspoon garlic powder (if using); brush on biscuit tops. Bake 10-12 minutes or until golden brown.\nThis recipe is made available as a courtesy by Davis, a trademark of the Clabber Girl Corporation.","Image":"//20fix.com/xfood/img/garlic-cheddar-biscuits.jpg"},{"id":"2383","Title":"Cornmeal Biscuits with Chorizo Gravy and Scallions","Ingredients":{"1":"1 cup all-purpose flour","2":"3/4 cup cornmeal","3":"1 tablespoon sugar","4":"1 1/2 teaspoons baking powder","5":"1 teaspoon baking soda","6":"1 teaspoon kosher salt","7":"1/4 teaspoon black pepper, freshly ground","8":"1/2 cup (1 stick) chilled unsalted butter, cut into pieces","9":"3/4 cup buttermilk","10":"1 tablespoon vegetable oil","11":"1 pound fresh chorizo, casings removed","12":"3 tablespoons all-purpose flour","13":"2 1/2 cups whole milk","14":"Kosher salt, freshly ground pepper","15":"Hot sauce","16":"1 avocado, sliced","17":"4 scallions, thinly sliced","18":"2 radishes, thinly sliced","19":"1/2 cup cilantro leaves with tender stems","20":"1/2 cup Cotija cheese or queso fresco (optional)"},"Instructions":"Preheat oven to 425°F. Combine flour, cornmeal, sugar, baking powder, baking soda, salt, and pepper in a large bowl. Using your hands, work butter into flour until pieces are chickpea-size. Add buttermilk and mix just to blend.\nDrop dough by heaping 1/4-cupfuls into an 8\" cast-iron skillet, spacing about 1\" apart. Bake, rotating skillet once, until biscuits are puffed, golden brown, and cooked through, 12–15 minutes.\nWhile biscuits are baking, heat oil in a medium skillet over medium. Add chorizo, breaking up any large pieces with a spatula. Cook, stirring occasionally, until chorizo is browned and crisp, 8–10 minutes. Transfer to a small bowl with a slotted spoon.\nWhisk flour into drippings in skillet and cook, whisking constantly, until roux is very smooth and starting to turn a light golden brown, about 5 minutes. Gradually add milk, whisking constantly until incorporated. Reduce heat to medium-low and cook gravy, whisking constantly, until thickened, 5–8 minutes. Stir half of chorizo into gravy; season with salt, pepper, and hot sauce.\nSpoon some gravy over hot biscuits and top with avocado, scallions, radishes, cilantro, Cotija (if using), remaining chorizo, and more hot sauce. Serve remaining gravy alongside.","Image":"//20fix.com/xfood/img/cornmeal-biscuits-with-chorizo-gravy-and-scallions.jpg"},{"id":"2711","Title":"Baked-Potato Buttermilk Biscuits","Ingredients":{"1":"1 medium baking potato, rinsed and dried","2":"2 cups all-purpose flour","3":"1 tablespoon baking powder","4":"1/4 teaspoon baking soda","5":"1 teaspoon salt","6":"1/2 teaspoon coarsely ground black pepper","7":"6 tablespoons very cold unsalted butter, diced, plus 2 tablespoons, melted","8":"1/4 cup shredded white Cheddar cheese","9":"2 tablespoons chopped chives","10":"1 cup buttermilk"},"Instructions":"Preheat the oven to 425°F. Line a baking sheet with parchment paper, and set aside.\nCook the potato in a microwave, an oven, or in boiling water until almost fork-tender (see Cooks' Note). Let cool completely. Using a paring knife, peel the potato, and then shred with a box grater.\nIn a large mixing bowl, combine the flour, baking powder, baking soda, salt, and pepper. Add the cold butter and cut in using 2 knives, a pastry blender, potato masher, or your hands, until the dough resembles coarse crumbs the size of peas. Fold in the cheese, chives, and shredded potato.\nAdd the buttermilk and stir with a wooden spoon until the dough just comes together. It’ll be sticky, but don’t panic. Transfer to a well-floured work surface and knead a few times to smooth it out. Fold the dough onto itself about 4 times, turning clockwise after each fold. Pat the dough with your hands until it’s about 3/4 inch thick.\nUse a 2-inch round cookie or biscuit cutter to cut into rounds. Place the biscuits on the prepared baking pan just barely touching each other. Gather scraps and repeat patting and cutting (you should have 20).\nBrush the biscuits with the melted butter, and bake until golden brown, 18 to 20 minutes. Let cool before serving. Store any leftovers in an airtight container in the refrigerator for up to 4 days.","Image":"//20fix.com/xfood/img/baked-potato-buttermilk-biscuits.jpg"},{"id":"2905","Title":"Fluffy Cathead Biscuits with Honey Butter","Ingredients":{"1":"1/2 cup buttermilk powder","2":"3 tablespoons baking powder","3":"1 1/2 teaspoons kosher salt","4":"Pinch of sugar","5":"6 tablespoons lard or bacon fat, cut into pieces and slightly softened","6":"6 tablespoons unsalted butter, cut into pieces and slightly softened, plus more, melted, if desired","7":"3 1/2–4 cups all-purpose flour, divided, plus more","8":"1/2 cup flavorful honey (such as buckwheat)","9":"1/4 cup unsalted butter, slightly softened","10":"1/2 teaspoon sea salt or kosher salt"},"Instructions":"Arrange rack in middle of oven; preheat to 400°F. Whisk buttermilk powder, baking powder, salt, and sugar in a large bowl until evenly distributed and no lumps remain. Add 2 cups water and whisk to combine. Add lard and butter.\nAdd 2 cups flour and mix with a fork until mixture resembles porridge. Using fork, press fats against side of bowl to cut into smaller, irregular, flattened pieces.\nFold in remaining 1 1/2–2 cups flour by the half cup with fork until a wet dough forms. Turn out dough onto a well-floured surface. Dust top of dough with more flour. Gently fold dough into itself until it feels like a pillow and is no longer sticky. Using a floured bench scraper or butter knife, divide dough into 12 equal pieces.\nWorking with 1 piece at a time, dip cut sides in flour and gently roll into a ball with your hands. Nestle each ball side by side in a large cast-iron skillet or on a rimmed baking sheet. Bake biscuits until lightly browned, 25–30 minutes. Brush with melted butter, if desired. Serve with honey butter.\nCombine honey, butter, and salt in a medium bowl. Mash with fork until just combined but not emulsified.","Image":"//20fix.com/xfood/img/fluffy-cathead-biscuits-with-honey-butter.jpg"},{"id":"2990","Title":"3-Ingredient Buttermilk Biscuits","Ingredients":{"1":"2 cups self-rising flour, plus more","2":"1/4 cup chilled vegetable shortening","3":"2/3 cup buttermilk"},"Instructions":"Position rack in middle of oven; preheat to 500°F. Grease a rimmed baking sheet with nonstick vegetable oil spray or butter.\nPlace 2 cups flour in a large bowl. Cut in shortening with a pastry cutter or 2 butter knives until pea-sized lumps form. Stir in buttermilk until a shaggy dough forms.\nOn a lightly floured work surface, turn out dough and gently knead 2–3 times until dough just comes together, being careful to not overwork. Roll out dough to a 1/2\" thickness; cut with a 2\" biscuit cutter or small glass that has been dipped in flour.\nTransfer biscuits to prepared baking sheet and bake until golden brown, 6–8 minutes. Transfer to a wire rack and let cool.","Image":"//20fix.com/xfood/img/3-ingredient-buttermilk-biscuits.jpg"},{"id":"3132","Title":"Sour Cream and Scallion Drop Biscuits","Ingredients":{"1":"2 cups all-purpose flour","2":"2 teaspoons baking powder","3":"2 teaspoons kosher salt","4":"1 teaspoon sugar","5":"1/2 teaspoon baking soda","6":"1/2 cup unsalted butter, melted, cooled, divided","7":"4 scallions, thinly sliced","8":"1 1/2 cups sour cream","9":"Hungarian hot paprika (for serving)"},"Instructions":"Preheat oven to 400°F. Whisk flour, baking powder, salt, sugar, and baking soda in a large bowl. Drizzle in 6 Tbsp. butter and mix lightly with your hands just to distribute butter. Make a well in center of bowl and add scallions and sour cream. Mix with a wooden spoon until no dry spots remain and mixture forms a shaggy dough.\nUsing 2 spoons, drop 1/2-cupfuls of dough onto a parchment-lined baking sheet, spacing at least 1 1/2\" apart, or into a 12\" cast-iron skillet, arranging so sides of biscuits are just touching (you should have 8). Brush tops with remaining 2 Tbsp. butter; sprinkle with paprika. Bake biscuits until tops and bottoms are golden brown on top and bottom, 12–15 minutes.","Image":"//20fix.com/xfood/img/sour-cream-and-scallion-drop-biscuits.jpg"},{"id":"3264","Title":"Buttermilk Biscuits With Honey Butter","Ingredients":{"1":"1 tablespoon plus 1 1/2 teaspoons sugar","2":"4 teaspoons baking powder","3":"1 1/2 teaspoons kosher salt","4":"1/2 teaspoon baking soda","5":"3 cups all-purpose flour, plus more for surface","6":"3/4 cup plus 2 Tbsp. (1 3/4 sticks) chilled unsalted butter, cut into small cubes","7":"1 1/4 cups buttermilk","8":"1/2 cup (1 stick) unsalted butter, softened","9":"2 tablespoons honey","10":"2 teaspoons flaky sea salt, plus more for serving","11":"A 2 1/2-inch-diameter round cutter or glass"},"Instructions":"Position rack in middle of oven and preheat to 425°F. Whisk sugar, baking powder, kosher salt, baking soda, and 3 cups flour in a large bowl. Cut in butter using a pastry cutter or 2 butter knives until pea-sized lumps form. Stir in buttermilk until a shaggy dough forms.\nGather dough into a ball. On a lightly floured surface, press into an 8\" square. Fold sides over like a letter. Turn 90º and fold sides again, forming a small square. Press or roll to an 8\" square and repeat once, adding flour as needed to prevent sticking.\nPat dough into a scant 3/4\" round. Cut out rounds with 2 1/2\" cutter; transfer to a parchment-lined rimmed baking sheet. Gather scraps and repeat patting and cutting (you should have 14). Freeze until chilled, about 15 minutes.\nBake biscuits, rotating sheet halfway through, until golden brown, 22–24 minutes.\nStir butter, honey, and 2 tsp. sea salt in a medium bowl until well combined.\nTop biscuits with Honey Butter and sprinkle with sea salt; serve warm or at room temperature.","Image":"//20fix.com/xfood/img/buttermilk-biscuits-with-honey-butter.jpg"},{"id":"3275","Title":"Individual Orange Cranberry Biscuits","Ingredients":{"1":"1 1/4 cups (150 g) whole wheat flour, preferably homemade","2":"1 cup (125 g) unbleached all-purpose flour","3":"2 1/4 teaspoons baking powder","4":"1/2 teaspoon baking soda","5":"1/4 teaspoon sea salt","6":"1 1/4 cups (300 ml) plain 0% Greek yogurt, stirred","7":"1/4 cup (60 ml) fresh orange juice","8":"1/3 cup firmly packed (73 g) light brown sugar","9":"1 tablespoon grated orange zest","10":"1 teaspoon vanilla extract","11":"1 cup (100 g) frozen cranberries, coarsely chopped","12":"1/4 cup (60 ml) reduced-fat (2%) milk"},"Instructions":"1. Preheat the oven to 400°F (200°C). Line a baking sheet with parchment paper or a silicone baking mat.\n2. Combine the flours, baking powder, baking soda, and salt in a medium bowl.\n3. Place the yogurt, orange juice, brown sugar, orange zest, and vanilla into the Vitamix container in the order listed and secure the lid. Select Variable 1. Turn the machine on and slowly increase the speed to Variable 10, then to High. Blend for 20 seconds.\n4. Pour the yogurt mixture into the flour mixture and fold in the cranberries.\n5. On a floured surface, pat the dough into a 9-inch (23-cm) round about 1/2 inch (1.3 cm) thick. Cut into 12 wedges.\n6. Place the wedges on the baking sheet and brush the tops with the milk. Bake for 30 to 35 minutes, until lightly browned.\n7. Remove from the baking sheet and cool on a wire rack.","Image":"//20fix.com/xfood/img/individual-orange-cranberry-biscuits.jpg"},{"id":"3333","Title":"Cracked Black Pepper Pull-Apart Biscuits","Ingredients":{"1":"4 tablespoons (1/2 stick) unsalted butter, melted, divided, plus 1/2 pound (2 sticks), cut into pieces, softened","2":"4 cups all-purpose flour","3":"2 cups cake flour","4":"2 tablespoons baking powder","5":"1 tablespoon freshly ground black pepper","6":"2 teaspoons kosher salt","7":"1 teaspoon baking soda","8":"1/2 cup vegetable shortening","9":"2 1/2 cups buttermilk","10":"1 teaspoon flaky sea salt","11":"Two (8\") cake pans or one (9x13\") baking dish"},"Instructions":"Preheat oven to 425°F. Grease cake pans or baking dish with 1 Tbsp. melted butter.\nCombine all-purpose flour, cake flour, baking powder, pepper, kosher salt, and baking soda in a large bowl. Add shortening and 1/2 pound softened butter. Using your hands or a fork, mix just until mixture is coarse and mealy. Stir in buttermilk just until a shaggy dough forms.\nDivide dough into 16 heaping 1/3-cup portions. Place 7 around the perimeter and 1 in the center of each cake pan (or nestle all 16 into baking dish). Brush biscuits with remaining 3 Tbsp. melted butter, sprinkle with sea salt, and bake until puffed and golden brown, 35–40 minutes. Let cool in pan 10 minutes. Invert onto a wire rack, then reinvert. Serve warm or at room temperature.","Image":"//20fix.com/xfood/img/cracked-black-pepper-pull-apart-biscuits.jpg"},{"id":"3445","Title":"Sour Cream Biscuits With Sausage Gravy","Ingredients":{"1":"2 teaspoons baking powder","2":"1 teaspoon kosher salt","3":"2 cups all-purpose flour, plus more","4":"1/2 cup (1 stick) chilled unsalted butter, cut into pieces; plus","5":"2 tablespoons, melted","6":"1/2 cup sour cream","7":"1/2 cup whole milk","8":"8 ounces breakfast sausage links, chopped","9":"2 tablespoons unsalted butter","10":"1/4 cup all-purpose flour","11":"2 1/2 cups whole milk","12":"Kosher salt, freshly ground pepper","13":"A 2 1/4\"-diameter biscuit cutter"},"Instructions":"Preheat oven to 425°F. Whisk baking powder, salt, and 2 cups flour in a large bowl to combine. Using a pastry cutter or your fingers, work chilled butter into dry ingredients until mixture resembles coarse meal. Using a wooden spoon or fork, mix in sour cream and milk until a shaggy dough forms.\nTurn out dough onto a lightly floured surface and knead a few times just to bring together. Roll out until 1/4\" thick, then fold in half. Roll dough out again until 1/4\" thick, then fold in half again. Repeat once more, rolling out to a 3/4\"-thick round.\nPunch out biscuits as close together as possible with cutter. Pat scraps together and punch out more biscuits; repeat until you can't cut out any more (you should have 12 total). Transfer biscuits to a parchment-lined baking sheet, spacing 1\" apart, and bake, rotating sheet once, until golden brown and baked through, 10–12 minutes. Brush biscuits with melted butter.\nDough can be made 1 day ahead. Cover and chill, or freeze up to 1 week.\nWhile biscuits are baking, cook sausage in a medium saucepan over medium heat, stirring occasionally, until cooked through and starting to brown, 5–8 minutes. Transfer to a small bowl with a slotted spoon.\nAdd butter to drippings in pan and melt over medium. Whisk flour into butter mixture and cook, whisking constantly, until roux is very smooth and starting to bubble, about 2 minutes (don't let it color; this is a white gravy).\nGradually add milk, whisking until incorporated. Reduce heat to mediumlow and cook gravy, still whisking, until thickened, 8–10 minutes. Stir in sausage; season with salt and pepper.\nServe hot biscuits with gravy alongside for spooning over top.","Image":"//20fix.com/xfood/img/sour-cream-biscuits-with-sausage-gravy-56390132.jpg"},{"id":"4411","Title":"Rosa's Biscuits","Ingredients":{"1":"2 1/2 cups all-purpose flour","2":"3/4 cup sugar","3":"2 1/2 teaspoons baking powder","4":"1 1/2 teaspoons kosher salt, plus more","5":"1 cup (2 sticks) chilled unsalted butter, cut into pieces; plus 6 tablespoons (3/4 stick), melted","6":"3/4 cup chilled buttermilk"},"Instructions":"Preheat oven to 350°. Whisk flour, sugar, baking powder, and 1 1/2 teaspoons salt in a large bowl. Add chilled butter and toss to coat. Work butter into flour mixture with your fingers until mixture resembles coarse meal with several pea-size pieces of butter remaining.\nUsing a fork, gently mix in buttermilk, then gently knead just until dough comes together (do not overmix).\nPinch off pieces of dough and gently roll into 1\" balls; place on 2 parchment-lined baking sheets, spacing 2\" apart (you should have about 24). If butter softens too much while you are working, chill dough until firm before baking, 15–20 minutes.\nBake biscuits until golden brown, 25–30 minutes. Brush with melted butter and sprinkle with more salt. Serve warm.","Image":"//20fix.com/xfood/img/rosas-biscuits-51247410.jpg"},{"id":"4775","Title":"Sophie's Chocolate Biscuit Cake","Ingredients":{"1":"250g (9oz) milk chocolate","2":"100g (4oz) unsalted butter","3":"5 tbsp whipping cream","4":"1 tbsp golden syrup","5":"400g (14oz) packet digestive biscuits","6":"100g (4oz) white chocolate (optional)"},"Instructions":"Break the chocolate into squares and place in a heatproof bowl with the butter. Set over a pan of simmering water and allow to melt. Remove from the heat and mix in the cream and golden syrup by hand, which will take a few minutes.\nBreak the digestive biscuits into large chunks and gently fold into the chocolate mixture so as not to break up the biscuits too much. Using a spatula, transfer to a 900ml (1 1/2 pints) loaf tin that has been double lined with clingfilm, as this makes the cake much easier to lift out. Chill for at least 2 hours, though overnight is best.\nTo serve, turn out the chocolate biscuit cake onto a platter. Break the white chocolate into squares, if using, and melt in a heatproof bowl over a pan of simmering water. Drizzle all over the chocolate biscuit cake and leave at room temperature to set for about 20 minutes before cutting into slices and arranging on plates.","Image":"//20fix.com/xfood/img/sophies-chocolate-biscuit-cake-51230020.jpg"},{"id":"4868","Title":"Fried Chicken Biscuits","Ingredients":{"1":"1 cup buttermilk","2":"1 tablespoon hot sauce","3":"1/2 teaspoon kosher salt","4":"1/4 teaspoon freshly ground black pepper","5":"1/4 teaspoon cayenne pepper","6":"4 skinless, boneless chicken cutlets (about 1 1/2 pounds total), pounded to 1/4\" thickness","7":"1/2 cup (1 stick) unsalted butter, room temperature","8":"1/4 cup honey","9":"1/2 teaspoon kosher salt, plus more","10":"Vegetable oil (for frying; about 2 1/2 cups)","11":"2 cups panko (Japanese breadcrumbs)","12":"Freshly ground black pepper","13":"4 Pies-N-Thighs Biscuits","14":"Hot sauce (for serving)"},"Instructions":"Combine buttermilk, hot sauce, salt, black pepper, and cayenne in a resealable plastic bag; add chicken. Seal bag, turn to coat, and chill at least 3 hours.\nDO AHEAD: Chicken can be marinated 8 hours ahead. Keep chilled.\nMix butter, honey, and 1/2 teaspoon salt in a small bowl until smooth; set honey butter aside.\nPour oil into a large skillet, preferably cast iron, to a depth of 1/2\" and heat over medium-high heat until oil bubbles immediately when a little panko is added.\nMeanwhile, place panko in a shallow bowl. Remove chicken from marinade; season with salt and pepper. Dredge chicken in panko, shaking off excess. Working in 2 batches and maintaining oil temperature, fry chicken until golden brown, crisp, and cooked through, about 3 minutes per side. Transfer chicken to a paper towel–lined baking sheet to drain.\nSplit biscuits and spread each side with 1 tablespoon reserved honey butter. Build sandwiches with biscuits, chicken, and hot sauce.","Image":"//20fix.com/xfood/img/fried-chicken-biscuits-51214410.jpg"},{"id":"4894","Title":"Drop-Biscuit Pear and Dried Cherry Cobbler","Ingredients":{"1":"6 medium Bosc pears (about 3 pounds), peeled, cored, cut into 1/2\" pieces","2":"1 cup dried tart cherries","3":"2/3 cup (packed) light brown sugar","4":"2 tablespoons all-purpose flour","5":"2 tablespoons fresh lemon juice","6":"1/4 teaspoon ground cinnamon","7":"1/8 teaspoon kosher salt","8":"Pinch of ground cloves","9":"2 cups all-purpose flour","10":"2 teaspoons baking powder","11":"1 teaspoon kosher salt","12":"3/4 cup plus 2 tablespoons sugar","13":"3/4 cup (1 1/2 sticks) chilled unsalted butter, cut into pieces","14":"Vanilla ice cream (for serving)"},"Instructions":"Preheat oven to 400°F. Toss pears, cherries, sugar, flour, lemon juice, cinnamon, salt, and cloves in a large bowl. Transfer to a 13x9\" baking dish.\nWhisk flour, baking powder, salt, and 3/4 cup sugar in a medium bowl. Rub in butter with your fingers until a coarse meal forms. Gradually mix in 1/3 cup hot water until a soft wet dough forms (a few lumps are okay). Drop clumps of dough over filling; sprinkle with remaining 2 tablespoons sugar.\nBake until filling is bubbling and top is golden brown and cooked through, 40–45 minutes; let cool. Serve with ice cream.","Image":"//20fix.com/xfood/img/drop-biscuit-pear-and-dried-cherry-cobbler-51215030.jpg"},{"id":"4935","Title":"Pillsbury Biscuit Dough Fried Doughnuts","Ingredients":{"1":"1/2 cup sugar","2":"2 tablespoons ground cinnamon","3":"2 tablespoons roasted and crushed sesame seeds","4":"1 tube Pillsbury original biscuit dough","5":"4 cups Crisco shortening"},"Instructions":"Mix the sugar, cinnamon, and sesame seeds in a medium-size bowl.\nPop open the tube of dough and pull apart the biscuits—they come preportioned, so this will be easy. In a big, heavy pot, heat the shortening over high heat; you'll know it's ready when a tiny piece of biscuit dough sizzles when added to the oil. Fry the biscuit dough until each piece becomes puffy and brown on all sides, about 2 minutes. Flip the pieces over and fry them for 2 minutes more.\nPull out the doughnuts and rest them on paper towels for a minute or two, then toss them immediately in the sugar mixture.\nRepeat. Eat. Get bloated.","Image":"//20fix.com/xfood/img/pillsbury-fried-doughnuts-51210810.jpg"},{"id":"5119","Title":"Salt-and-Pepper Biscuits","Ingredients":{"1":"3/4 cup sour cream","2":"4 tablespoons heavy cream, divided","3":"1 tablespoon baking powder","4":"1 teaspoon kosher salt","5":"1 teaspoon sugar","6":"1/2 teaspoon coarsely ground black pepper plus more","7":"2 cups all-purpose flour plus more for surface","8":"6 tablespoons (3/4 stick) chilled unsalted butter, cut into pieces","9":"Flaky sea salt (such as Maldon)","10":"Salt-and-Pepper Butter (optional)","11":"A 2 1/4\"-diameter biscuit or cookie cutter"},"Instructions":"Preheat oven to 425°F. Whisk sour cream and 3 tablespoonss heavy cream in a small bowl.\nPulse baking powder, kosher salt, sugar, 1/2 teaspoon pepper, and 2 cups flour in a food processor until combined; add butter and pulse until the texture of coarse meal with a few pea-size pieces of butter remaining.\nTransfer mixture to a large bowl. Using a spoon, mix in sour cream mixture, then gently knead a few times just until a shaggy dough comes together (a light hand is key to tender biscuits, so be careful not to overmix).\nRoll out dough on a lightly floured surface until 3/4\" thick. Using cutter, cut out biscuits, rerolling scraps as needed.\nPlace biscuits on a parchment-lined baking sheet and brush with remaining 1 tablespoon heavy cream; sprinkle with sea salt and more pepper. Bake until golden brown on the tops and bottoms, 15–20 minutes. Serve warm with Salt-and-Pepper Butter, if desired.\nDO AHEAD: Dough can be made and cut out 6 hours ahead. Cover and chill. Biscuits can be baked 2 hours ahead. Reheat before serving, if desired.","Image":"//20fix.com/xfood/img/salt-and-pepper-biscuits-51198740.jpg"},{"id":"5407","Title":"Angel Biscuits","Ingredients":{"1":"5 cups sifted all-purpose flour (preferably a fine southern flour; see headnote)","2":"1 tablespoon baking powder","3":"1 teaspoon baking soda","4":"1/4 cup sugar","5":"2 teaspoons salt","6":"1 cup firmly packed vegetable shortening or lard or a half-and-half mixture of the two","7":"2 cups buttermilk","8":"One 1/4- ounce package active dry yeast dissolved in 1/4 cup very warm water (105°to 115°F.)"},"Instructions":"1. Preheat the oven to 400°F.\n2. Sift the flour, baking powder, baking soda, sugar, and salt into a large mixing bowl. Using a pastry blender, cut in the shortening until the texture of coarse meal. Add the buttermilk and yeast mixture and toss briskly with a fork just until the mixture forms a soft dough.\n3. Turn the dough onto a well-floured surface and with floured hands, knead lightly for about a minute. With a floured rolling pin, roll the dough out until 5/8 inch thick; then, using a well-floured 2 1/2- to 2 3/4-inch cutter, cut into rounds. Place on ungreased baking sheets, spacing about 1 1/2 inches apart. Gather scraps, reroll, and cut as before.\n4. Bake in the lower third of the oven for 15 to 18 minutes or until the biscuits are nicely puffed and pale tan on top. Serve at once with plenty of butter.","Image":"//20fix.com/xfood/img/angel-biscuits-51175800.jpg"},{"id":"5488","Title":"Moroccan Tea Biscuits","Ingredients":{"1":"1 cup sugar","2":"1 stick unsalted butter, melted","3":"3/4 cup whole almonds, toasted, cooled, and coarsely chopped","4":"2 tablespoons orange-flower water","5":"2 teaspoons anise seeds","6":"1 teaspoon pure vanilla extract","7":"1/2 teaspoon pure almond extract","8":"1/4 cup plus 1 tablespoon sesame seeds, toasted and cooled, divided","9":"3 large eggs","10":"2 1/2 cups all-purpose flour","11":"1 1/2 teaspoons baking powder","12":"1/4 teaspoon salt","13":"1 large egg beaten with 1 tablespoon water for egg wash"},"Instructions":"Stir together sugar, butter, almonds, orange-flower water, anise seeds, extracts, and 1/4 cup sesame seeds in a large bowl. Add eggs and stir until well combined. Stir in flour, baking powder, and salt until just combined. Chill dough, covered, 1 hour.\nPreheat oven to 350°F with rack in middle.\nUsing moistened hands, halve dough and form 2 (11- by 3-inch) loaves on an ungreased baking sheet. Brush with enough egg wash to coat, then sprinkle with remaining tablespoon sesame seeds.\nBake until pale golden, about 30 minutes. Loosen from baking sheet with a spatula, then transfer loaves to a rack and cool 15 minutes. (Leave oven on.)\nCut warm loaves into 3/4-inch slices with a serrated knife and arrange biscuits, with a cut side down, on a clean baking sheet. Bake until golden, 20 to 25 minutes. Transfer to rack to cool completely.","Image":"//20fix.com/xfood/img/moroccan-tea-biscuits-51169800.jpg"},{"id":"5707","Title":"Chicken and Biscuits","Ingredients":{"1":"2 tablespoons vegetable oil","2":"1 1/2 pounds skin-on, bone-in chicken thighs","3":"Kosher salt, freshly ground pepper","4":"8 medium carrots (about 1 lb.), peeled, cut into 2\" pieces","5":"1 small celery root (about 12 ounces), peeled, cut into 1/2\" pieces","6":"1 medium onion, chopped","7":"1 leek, white and pale-green parts only, chopped","8":"1/4 cup (1/2 stick) unsalted butter","9":"1/4 cup all-purpose flour","10":"1 cup dry white wine","11":"4 cups low-sodium chicken broth","12":"4 sprigs thyme","13":"1 sprig rosemary","14":"2 bay leaves","15":"1 1/2 teaspoons (or more) Sherry vinegar","16":"2 1/4 cups all-purpose flour plus more","17":"2 teaspoons kosher salt","18":"3/4 teaspoon baking powder","19":"1/2 cup (1 stick) cold unsalted butter, cut into 1/2\" cubes","20":"3/4 cup buttermilk","21":"2 tablespoons crème fraîche or sour cream","22":"2 tablespoons chopped fresh chives","23":"1 large egg, beaten to blend"},"Instructions":"Preheat oven to 400°F. Heat oil in a large pot over medium-high heat. Season chicken with salt and pepper. Cook skin side down until skin is golden, 8-10 minutes; transfer to a plate.\nCarefully drain all but 2 tablespoons fat from pot. Add carrots, celery root, onion, and leek; stir frequently until softened and beginning to brown, 8-10 minutes.\nAdd butter; stir until melted. Add flour and stir constantly until well blended, about 2 minutes. Add wine and 1/2 cup water. Bring to a boil; reduce heat and simmer until liquid is reduced by half, 5-8 minutes.\nAdd chicken, broth, thyme, rosemary, and bay leaves. Bring to a boil; reduce heat. Simmer until chicken is fork-tender, 35-40 minutes. Transfer chicken to a plate. Let cool slightly; shred meat, discarding skin and bones.\nReturn shredded chicken to soup. Add 1 1/2 teaspoons vinegar. Season with salt, pepper, and more vinegar, if desired. DO AHEAD: Soup can be made 2 days ahead. Let cool slightly; chill until cold. Cover and keep chilled. Reheat before serving.\nWhisk flour, salt, and baking powder in a large bowl. Add butter. Using your fingertips, blend until pea-size lumps form. Add buttermilk, crème fraîche, and chives. Using a fork, mix until just combined. Gather mixture into a ball and knead in bowl just until a shaggy dough forms, 3 or 4 times.\nTransfer dough to a floured work surface and pat into a 3/4\"- to 1\"-thick round. Cut out rounds with a 2\" biscuit cutter or small glass. Gather dough and repeat patting and cutting. Transfer to a parchment-lined rimmed baking sheet; brush with egg.\nBake biscuits until golden brown, 25-30 minutes. Serve warm or at room temperature. DO AHEAD: Biscuits can be made 8 hours ahead. Let cool completely and store airtight at room temperature.\nDivide soup among bowls and top with biscuits.","Image":"//20fix.com/xfood/img/chicken-and-biscuits-51149130.jpg"},{"id":"5856","Title":"Biscuits","Ingredients":{"1":"Parchment paper","2":"2 cups all-purpose flour, plus additional for dusting","3":"2 teaspoons baking powder","4":"1/2 teaspoon baking soda","5":"1/2 teaspoon salt","6":"5 tablespoons cold unsalted butter, thinly sliced","7":"2/3 cup lowfat buttermilk, plus additional for brushing","8":"3 tablespoons nonfat plain Greek yogurt"},"Instructions":"Heat oven to 425&Deg;F. Line a baking sheet with parchment paper. In a bowl, whisk flour, baking powder, baking soda and salt. Rub butter into flour with fingertips until butter pieces are coated and about the size of peas. Stir in buttermilk and yogurt until just combined. Scrape dough onto a lightly floured surface; very gently shape it into an 8\"x 6\" rectangle, being careful not to overwork dough. Cut into 12 square biscuits. Transfer biscuits to baking sheet; brush tops with buttermilk. Bake until puffed and lightly golden, 15 minutes; serve.","Image":"//20fix.com/xfood/img/biscuits-51136820.jpg"}],"t":57,"p":{"limitstart":0,"limit":25,"total":57,"pagesStart":1,"pagesStop":3,"pagesCurrent":1,"pagesTotal":3}}}