{"ingredient":"Sake","recipes":{"s":1,"d":[{"id":"532","Title":"Sake-Braised Mustard Greens with Sesame","Ingredients":{"1":"¼ cup toasted sesame oil","2":"6 garlic cloves, thinly sliced","3":"4 large bunches mustard greens or kale, ribs and stems removed, leaves torn into large pieces","4":"½ cup sake or dry white wine","5":"1 Tbsp. finely grated lemon zest","6":"Kosher salt","7":"Toasted sesame seeds (for serving)"},"Instructions":"Pour oil into a large high-sided skillet, add garlic, and set over medium heat. Cook, stirring often, until garlic is barely golden, about 2 minutes.\nAdd a third of the greens to skillet and toss to coat with oil and garlic. Cover skillet with a lid and cook until greens are slightly wilted, about 2 minutes. Uncover skillet; add sake and another third of greens and toss to combine. Cover and cook until greens are slightly wilted, about 2 minutes, then add remaining greens. Cover and cook until slightly wilted, about 2 minutes. Remove lid from skillet, add lemon zest to greens, and continue to cook, stirring often, until greens are completely wilted and tender and most of the liquid has evaporated, about 2 minutes. Season with salt.\nTransfer greens to a serving bowl and top with sesame seeds.","Image":"//20fix.com/xfood/img/sake-braised-mustard-greens-with-sesame.jpg"},{"id":"3201","Title":"Sake-Steamed Chicken and Kabocha Squash","Ingredients":{"1":"2 dried chiles de árbol, seeded, crushed, or 1/2 teaspoon crushed red pepper flakes","2":"1 cup sake","3":"1 (2-inch) piece ginger, peeled, cut into thin matchsticks","4":"2 (8-ounce) skin-on or skinless, boneless chicken breasts","5":"Kosher salt","6":"1/4 small kabocha or red kuri squash, seeded, sliced crosswise into 3/4-inch-thick half-moons, then sliced in half again","7":"2 scallions, sliced on a diagonal, plus more for serving"},"Instructions":"Combine chiles, sake, and 1 cup water in a pot. Fit with a steamer basket and arrange ginger in basket. Season chicken with salt and place in steamer basket, skin side up; add squash and 2 sliced scallions. Cover pot and steam chicken and squash over medium heat, adding more water by 1/4-cupfuls if needed, until squash is tender and chicken is just cooked through, 16–20 minutes.\nRemove steamer basket from pot and bring liquid to a boil. Cook until flavors are concentrated and liquid thickens, 6–8 minutes (you should have about 3 Tbsp.).\nSlice chicken and arrange on plates with squash. Pour steaming liquid over and top with additional scallions.","Image":"//20fix.com/xfood/img/sake-steamed-chicken-and-kabocha-squash.jpg"},{"id":"6027","Title":"Crunchy Sake Pickles","Ingredients":{"1":"2 pounds mixed vegetables, such as 4x1/2\" spears of English hothouse or Persian cucumbers, 4x1/4\" spears of peeled carrots, and quartered radishes","2":"1 1/2 tablespoons kosher salt","3":"8 thinly sliced shiso or large basil leaves","4":"1 red Fresno chile or jalapeño cut into 1/2\" rings","5":"3 tablespoons sake","6":"2 tablespoons seasoned rice vinegar","7":"2 teaspoons sesame seeds","8":"1 teaspoon finely grated peeled ginger"},"Instructions":"Toss 2 pounds mixed vegetables, such as 4x1/2\" spears of English hothouse or Persian cucumbers, 4x1/4\" spears of peeled carrots, and quartered radishes, with 1 1/2 tablespoons kosher salt in a large wide nonreactive bowl. Press plastic wrap on surface of vegetables. Place a small plate over, then weigh down with two 28-ounce cans (such as canned tomatoes). Let stand at room temperature for 2 hours.\nRemove cans, plate, and plastic wrap; transfer vegetables to a colander. Rinse well with cold water. Transfer drained vegetables to a large bowl. Add 8 thinly sliced shiso or large basil leaves, 1 red Fresno chile or jalapeño cut into 1/2\" rings, 3 tablespoons sake, 2 tablespoons seasoned rice vinegar, 2 teaspoons sesame seeds, and 1 teaspoon finely grated peeled ginger. Toss to coat; cover and refrigerate, tossing occasionally, for at least 1 hour. DO AHEAD: Pickles can be made 1 week ahead. Keep chilled, tossing occasionally.\nTo serve, use a slotted spoon to transfer vegetables from pickling liquid to large mugs, mason jars, or bowls.","Image":"//20fix.com/xfood/img/crunchy-sake-pickles-51117470.jpg"},{"id":"7386","Title":"Mango Sake","Ingredients":{"1":"1.8 quarts Hokusetsu saké (pure rice)","2":"7 ounces sugar syrup","3":"10 1/2 ounces mango flesh","4":"3 tablespoons and 1 teaspoon mango syrup","5":"10 drops ginger juice, squeezed from the root in a ginger press"},"Instructions":"Combine a little Japanese saké, syrup and fresh mango in a blender and blend.\nAdd the mango syrup and ginger juice, then strain through a cloth. Add the remaining saké and store in the refrigerator.","Image":"//20fix.com/xfood/img/mango-sake-363341.jpg"},{"id":"7749","Title":"Cucumber Sake-Tini","Ingredients":{"1":"3/4 cup/180 ml gin","2":"1/4 cup/60 ml premium sake","3":"1/4 cup/60 ml fresh lime juice","4":"2 cups/280 g peeled, seeded, and diced cucumber, frozen","5":"1/2 cup/85 g green grapes, frozen","6":"1/4 cup/10 g firmly packed fresh mint leaves","7":"2 tbsp agave nectar","8":"Pinch of sea salt"},"Instructions":"Combine the gin, sake, lime juice, cucumber, grapes, mint, agave nectar, and salt in a blender. Blend until frothy and smooth.","Image":"//20fix.com/xfood/img/cucumber-sake-tini-358951.jpg"},{"id":"8122","Title":"Gardein \"Chicken\" Scaloppini with Shiitake Sake Sauce, Pea Shoots, and Udon Noodle Cakes","Ingredients":{"1":"4 (7-ounce single-serving) packs precooked udon noodles, still in their packages (see note)","2":"Sea salt","3":"2 tablespoons extra-virgin olive oil","4":"Freshly ground black pepper","5":"Pinch of sea salt","6":"1 tablespoon sesame oil","7":"2 garlic cloves, minced","8":"1/4 cup faux chicken stock","9":"2 cups packed pea shoots","10":"4 Gardein breasts","11":"Sea salt and freshly ground black pepper","12":"1/2 cup unbleached all-purpose flour","13":"4 tablespoons extra-virgin olive oil","14":"1 pound shiitake mushrooms, stemmed and cut into 1/4-inch slices","15":"1 cup dry sake","16":"1/2 cup faux chicken stock","17":"1/2 cup Earth Balance","18":"1 tablespoon minced fresh chives","19":"Microgreens to garnish"},"Instructions":"1. Make the udon noodle cakes: Preheat the oven to 200°F. Remove the plastic from the noodles, keeping the noodles tightly packed. Using a 3-inch round cutter or ring mold, cut one round of noodles from each pack.\n2. Place a large sauté pan over high heat. Sprinkle the bottom with a pinch of salt and heat for 1 minute. Add the oil and heat for 30 seconds, being careful not to let it smoke. This will create a nonstick effect.\n3. Add the noodle cakes and fry until browned and crisp on both sides, seasoning with salt and pepper as they cook, about 3 minutes per side. Remove to a paper-towel-lined baking sheet and put in the oven to keep warm.\n4. Make the chicken: Flatten the Gardein breasts with your hand to 1/2 inch thick, then cut each into 3 pieces. Season with salt and pepper, then dredge in the flour.\n5. Wipe out the pan you used for the noodle cakes and add 2 tablespoons of the oil. Heat over medium heat, then add the Gardein pieces and cook until browned, about 3 minutes on each side. Remove to a plate and set aside.\n6. Add the remaining 2 tablespoons oil, heat over medium heat, then add the mushrooms and cook for 3 to 4 minutes, stirring often, until softened. Deglaze the pan with the sake and cook until reduced by half, 2 to 3 minutes. Add the stock and cook for 2 more minutes.\n7. Remove from the heat and whisk in the Earth Balance 1 tablespoon at a time, whisking constantly so that the sauce doesn't separate. Stir in the chives. Return the Gardein to the pan and toss to coat it with the sauce. Cover to keep warm while you make the pea shoots.\n8. Make the pea shoots: Place a medium sauté pan over medium heat. Sprinkle the bottom with a pinch of salt and heat for 1 minute. Add the oil and heat for 30 seconds, being careful not to let it smoke.\n9. Add the garlic and sauté for 30 seconds. Add the stock and pea shoots and sauté for 3 to 5 minutes, until wilted. Drain the excess liquid.\n10. Assemble the dish: Place a noodle cake in the center of each plate. Top each cake with a spoonful of pea shoots, then top the pea shoots with 3 pieces of the Gardein. Spoon a little of the sake and mushroom sauce over the Gardein and drizzle it around the plate. Garnish with microgreens and serve immediately.","Image":"//20fix.com/xfood/img/gardein-chicken-scaloppini-with-shiitake-sake-sauce-pea-shoots-and-udon-noodle-cakes-356410.jpg"},{"id":"8496","Title":"Asian Pear and Grapefruit Salad with Sake Granita and Pear Sorbet","Ingredients":{"1":"3/4 cup water","2":"3/4 cup sugar","3":"2 tablespoons light corn syrup","4":"Pinch of salt","5":"3 1/2 cups diced peeled ripe Anjou or Bartlett pears (about 3 large)","6":"1 1/3 cups coarsely filtered sake","7":"2 tablespoons water","8":"3/4 teaspoon unflavored gelatin","9":"1 1/2 cups water","10":"1 1/2 cups sugar","11":"4 ruby red grapefruits or white grapefruits","12":"2 large unpeeled Asian pears","13":"Fresh fennel fronds (optional; for garnish)","14":"Ice cream maker"},"Instructions":"Combine 3/4 water, sugar, corn syrup, and pinch of salt in large saucepan. Bring to boil over medium heat, stirring until sugar dissolves. Add pear pieces and simmer until pears are very tender, stirring occasionally, 8 to 10 minutes. Cool slightly. Transfer mixture to processor and puree until smooth. Chill pear mixture until cold, about 2 hours.\nProcess pear mixture in ice cream maker according to manufacturer's instructions. Transfer pear sorbet to freezer container; cover and freeze until firm. DO AHEAD: Can be made 3 days ahead. Keep frozen.\nPour sake into 8x8x2-inch glass dish. Spoon 2 tablespoons water into heatproof custard cup or small bowl. Sprinkle gelatin over. Let stand until gelatin softens, about 10 minutes. Pour enough water into small skillet to come 1 inch up sides; bring to boil. Reduce heat to very low. Place cup with gelatin mixture in hot water in skillet. Stir until gelatin dissolves and mixture is fluid, about 1 minute. Remove cup with gelatin mixture from skillet. Pour gelatin mixture into sake and stir to blend well. Freeze sake mixture until firm, at least 8 hours or overnight.\nCombine 1 1/2 cups water and 1 1/2 cups sugar in medium saucepan. Bring to boil, stirring until sugar dissolves. Remove from heat. Cool simple syrup until just warm to touch, 20 to 30 minutes.\nMeanwhile, cut off peel and white pith from all grapefruit. Working over bowl to catch juices and using small sharp knife, cut between membranes to release segments into bowl. Quarter and core Asian pears, then cut lengthwise into very thin slices. Add to bowl with grapefruit.\nPour warm simple syrup over fruit. Cover and refrigerate until well chilled, about 2 hours. DO AHEAD: Compote can be made 6 hours ahead. Keep chilled.\nArrange 1 layer of pear slices in each of 6 cocktail glasses. Top each with 1 layer of grapefruit segments. Spoon 2 tablespoons syrup from fruit mixture over. Scrape fork all over sake granita to form crystals. Place large spoonful of granita atop fruit in each glass. Top each with 1 more layer of pear slices, then layer of grapefruit segments and scoop of pear sorbet. Garnish with fennel fronds, if desired, and serve.","Image":"//20fix.com/xfood/img/asian-pear-and-grapefruit-salad-with-em-sake-em-granita-and-pear-sorbet-354894.jpg"},{"id":"8863","Title":"Sake Sea Bass in Parchment","Ingredients":{"1":"1/2 cup sake","2":"1 1/2 tablespoons soy sauce","3":"1 teaspoon grated peeled ginger","4":"1 teaspoon sugar","5":"6 (6-ounces) pieces skinless sea bass fillet (about 1 inch thick), any bones removed","6":"1/2 cup sliced scallions","7":"Equipment: 6 (12-to 15-inch) squares of parchment paper or foil; kitchen string"},"Instructions":"Preheat oven to 400°F with a baking sheet on bottom rack.\nStir together sake, soy sauce, ginger, and sugar in a bowl.\nIf fish fillets are more than 4 inches long, fold ends under. Put a fish fillet in center of each parchment square and season with 1/4 teaspoon salt (total). Working with 1 portion at a time, sprinkle fish with some of scallions and spoon some of sake mixture over top (hold up 2 corners of parchment to prevent liquid from running off). Gather sides of parchment up over fish to form a pouch, leaving no openings, and tie tightly with string.\nBake on hot baking sheet until fish is just cooked through, 10 to 12 minutes.","Image":"//20fix.com/xfood/img/sake-sea-bass-in-parchment-352789.jpg"},{"id":"9878","Title":"Buttery Steamed Mussels with Sake and Chiles","Ingredients":{"1":"5 tablespoons butter, divided","2":"2 1/2 cups chopped green onions (about 10 large)","3":"1 cup chopped fresh cilantro","4":"1 cup sake","5":"6 Thai bird chiles with seeds or 3 small serrano chiles with seeds, sliced crosswise into thin rounds","6":"2 teaspoons soy sauce","7":"3 large garlic cloves, pressed","8":"2 1/2 pounds mussels, scrubbed, debearded"},"Instructions":"Melt 3 tablespoons butter in large pot over medium-high heat. Add green onions and sauté until beginning to soften, about 2 minutes. Add next 5 ingredients. Bring to boil. Add mussels. Cover pot and increase heat to high. Cook until mussels open, 5 to 6 minutes.\nDivide mussels among bowls (discard any mussels that do not open). Boil juices in pot to reduce slightly, about 1 minute. Whisk in remaining 2 tablespoons butter. Season sauce to taste with salt and pepper. Spoon sauce over mussels; serve.","Image":"//20fix.com/xfood/img/buttery-steamed-mussels-with-sake-and-chiles-242485.jpg"},{"id":"12465","Title":"Cucumber, Ginger, and Sake Sangria","Ingredients":{"1":"1 large (1-lb) seedless cucumber (usually plastic-wrapped)","2":"2 cups water","3":"2/3 cup sugar","4":"1 tablespoon finely grated peeled fresh ginger","5":"2 tablespoons fresh lemon juice, or to taste","6":"1 (720-ml) bottle chilled dry sake","7":"2 tablespoons finely chopped crystallized ginger (optional)"},"Instructions":"Cut cucumber crosswise into three equal pieces. Peel and chop 2 pieces, then put into a blender. Peel 4 lengthwise strips from remaining piece, leaving stripes of green, then halve piece lengthwise and core. Thinly slice crosswise.\nAdd water, sugar, fresh ginger, and lemon juice to blender and purée until smooth. Pour through a medium-mesh sieve into a pitcher, then stir in sake, crystallized ginger if using, and cucumber slices. Chill, covered, until ready to serve, up to 2 hours. Serve over ice.","Image":"//20fix.com/xfood/img/cucumber-ginger-and-sake-sangria-232339.jpg"}],"t":10,"p":{"limitstart":0,"limit":25,"total":10,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}