{
    "s": 1,
    "d": [
        {
            "id": "52",
            "Title": "Maple-Roasted Acorn Squash",
            "Ingredients": {
                "1": "3 acorn squash, unpeeled, halved through the stem, and seeded",
                "2": "3 tablespoons unsalted butter, diced",
                "3": "3 tablespoons pure maple syrup, plus extra for serving",
                "4": "Good olive oil",
                "5": "Kosher salt and freshly ground black pepper",
                "6": "Flaked sea salt, such as Maldon, for serving"
            },
            "Instructions": "Preheat the oven to 350°F.\nPlace the squash, cut sides up, on a sheet pan. Place ½ tablespoon butter and ½ tablespoon maple syrup in the cavity of each squash. Brush the cut sides with olive oil and sprinkle the squash with 3 teaspoons kosher salt and 1 teaspoon pepper. Roast for 40 to 60 minutes, depending on the size of the squash, until tender when pierced with a small knife.\nPlace the squash on a serving platter. If the halves are too large for one serving, cut each piece in half through the stem. Drizzle lightly with extra maple syrup, sprinkle with sea salt, and serve hot.\nAcorn squash is hard to cut. To halve a whole squash, plunge the blade of a large chef’s knife into the side of the squash as far as it will go. Holding the handle of the knife, bang the squash (with the knife in it) on the board until the blade cuts all the way through.",
            "Image": "//20fix.com/xfood/img/maple-roasted-acorn-squash-ina-garten.jpg"
        },
        {
            "id": "53",
            "Title": "Coconut-Creamed Corn and Grains",
            "Ingredients": {
                "1": "2 Tbsp. extra-virgin olive oil",
                "2": "1 serrano chile or jalapeño, thinly sliced",
                "3": "1 (3\") piece fresh ginger, peeled, cut into matchsticks",
                "4": "4 garlic cloves, thinly sliced",
                "5": "2 scallions, thinly sliced, plus more for serving",
                "6": "½ tsp. ground turmeric",
                "7": "4 ears of corn, shucked, kernels removed",
                "8": "1 cup cooked grains (such as freekeh, farro, or quinoa)",
                "9": "1 cup unsweetened coconut milk, plus more for serving",
                "10": "Kosher salt",
                "11": "4 Tbsp. store-bought crispy onions or shallots (such as Lars Own, French’s, or Maesri)",
                "12": "Lime wedges (for serving)"
            },
            "Instructions": "Heat oil in a large nonstick skillet over medium. Cook chile, ginger, garlic, and 2 sliced scallions, tossing, until softened and fragrant, about 3 minutes. Add turmeric and cook, stirring frequently, just until darkened and fragrant, about 30 seconds. Add corn and increase heat to medium-high. Cook, tossing occasionally, until corn is beginning to lightly brown, about 5 minutes.\nAdd grains to skillet and cook, tossing often, until heated through and beginning to crisp around the edges, about 2 minutes. Add ½ cup coconut milk; season with salt. Bring to a simmer and cook, adding 1–2 Tbsp. water if needed to loosen, until flavors have come together, about 3 minutes.\nDivide corn mixture between plates or shallow bowls and drizzle with more coconut milk. Top with crispy onions and more scallion. Serve with lime wedges for squeezing over.",
            "Image": "//20fix.com/xfood/img/coconut-creamed-corn-and-grains.jpg"
        },
        {
            "id": "71",
            "Title": "Sweet Corn Frittata With Cherry Tomato Compote",
            "Ingredients": {
                "1": "2 tablespoons olive oil",
                "2": "2 cloves of garlic, minced",
                "3": "2 cups cherry tomatoes (any variety will work)",
                "4": "¼ cup dry white wine",
                "5": "8 to 10 fresh basil leaves, thinly sliced",
                "6": "Healthy pinch of fine sea salt",
                "7": "Freshly ground black pepper",
                "8": "2 tablespoons cooking fat",
                "9": "1 bunch of scallions, white parts and green parts diced separately",
                "10": "2 cloves of garlic, minced",
                "11": "1 medium potato, scrubbed and cut into 1/4-inch chunks",
                "12": "2 cups fresh or thawed frozen corn kernels",
                "13": "4 large eggs",
                "14": "½ teaspoon crushed red pepper flakes",
                "15": "4 ounces feta cheese, crumbled"
            },
            "Instructions": "Heat the oil in a medium-sized skillet over medium heat. Add the garlic and cook, stirring often, for about 1 minute. Add the tomatoes and cook, stirring occasionally, for about 2 minutes longer. Pour in the wine and cook until the wine is reduced by about half. Add the basil, salt, and pepper and continue to cook, stirring occasionally, until the tomatoes burst and become fragrant, 5 to 8 minutes. Remove from the heat and set aside the tomatoes in a bowl.\nPosition an oven rack about 3 inches from the top and preheat the broiler.\nIn a 10-inch cast-iron skillet over medium, heat 1 tablespoon of the cooking fat. Add the diced white part of the scallions and the minced garlic and cook, stirring often, until fragrant, about 3 minutes. Add the potato and continue to cook, stirring occasionally, until the potato softens, about 10 minutes. Add the corn and continue to cook for about 2 minutes longer.\nIn a large bowl, whisk together the eggs, red pepper flakes, and half the feta cheese. Pour the egg mixture over the veggie mixture in the skillet and top with the remainder of the cheese. Stir in the potato mixture and the scallion greens.\nWipe out the skillet and, over medium-high, heat the remaining 1 tablespoon of cooking fat. Cook the frittata, lifting up the cooked egg around the edges with a rubber spatula to let the uncooked eggs flow underneath, 2 to 3 minutes. Reduce the heat to medium and cook, giving the pan a shake now and again, until the eggs are mostly set but the center is still slightly jiggly, 3 to 5 minutes more.\nTransfer the frittata to the oven and broil until the top is golden brown, 2 to 3 minutes (keep a close eye on the frittata, as it can easily burn). Serve topped with the tomato compote.",
            "Image": "//20fix.com/xfood/img/sweet-corn-frittata-with-cherry-tomato-compote.jpg"
        },
        {
            "id": "95",
            "Title": "Corn and Chickpea Bowls With Miso Tahini",
            "Ingredients": {
                "1": "2 small jalapeños, seeded, chopped",
                "2": "1 (¾-inch) piece ginger, peeled, finely grated",
                "3": "2 small garlic cloves, finely grated",
                "4": "1 cup (packed) cilantro leaves with tender stems",
                "5": "⅓ cup fresh lime juice",
                "6": "⅓ cup tahini",
                "7": "1 Tbsp. plus 1½ tsp. miso",
                "8": "Kosher salt",
                "9": "3 Tbsp. extra-virgin olive oil, divided, plus more for drizzling",
                "10": "2 garlic cloves, lightly crushed",
                "11": "1 (14-oz.) can chickpeas rinsed, drained",
                "12": "3 ears of corn, shucked, kernels removed",
                "13": "1 Tbsp. spice blend (such as za’atar, vadouvan, hawaij, or berbere)",
                "14": "Kosher salt",
                "15": "4 cups tender greens (such as Little Gem lettuce and/or watercress), torn if large",
                "16": "2 avocados, cut into wedges",
                "17": "4 small tomatoes, cut into wedges",
                "18": "Crumbled feta, cilantro sprigs, and lime wedges (for serving)"
            },
            "Instructions": "Purée jalapeños, ginger, garlic, cilantro, lime juice, tahini, miso, and 3 Tbsp. water in a blender until smooth. Season with salt.\nDo Ahead: Dressing can be made 1 day ahead. Transfer to an airtight container and chill.\nHeat 2 Tbsp. oil in a large skillet over medium. Add garlic and cook, turning occasionally, until golden brown, about 4 minutes. Mash garlic with a spoon and stir into oil. Add chickpeas and increase heat to medium-high. Cook, undisturbed, until golden brown and beginning to crisp underneath, about 3 minutes. Toss and continue to cook, tossing occasionally, until golden brown all over, about 2 minutes more. Add corn and 1 Tbsp. oil and cook, tossing, until corn kernels are golden around the edges and tender, 5–7 minutes. Sprinkle spice blend over and toss to coat. Season with salt.\nCombine lettuce, avocados, and tomatoes in a large bowl. Drizzle lightly with oil and toss to combine. Season with salt.\nDivide dressing among bowls and top with salad and chickpea mixture, then feta and some cilantro. Serve with lime wedges for squeezing over.",
            "Image": "//20fix.com/xfood/img/corn-and-chickpea-bowls-with-miso-tahini.jpg"
        },
        {
            "id": "98",
            "Title": "Tamale Pie with Fresh Tomato and Corn",
            "Ingredients": {
                "1": "1/2 pound fresh chorizo, casings removed (about 2 links), or vegetarian substitute such as Lightlife Plant-Based Italian Sausage",
                "2": "1/2 pound ground beef, or vegetarian substitute such as Lightlife Plant-Based Ground",
                "3": "1 tablespoon tomato paste",
                "4": "2 1/2 teaspoons cumin",
                "5": "1 large onion, grated on a box grater, divided",
                "6": "1–2 medium jalapeños, thinly sliced, seeded if desired, divided",
                "7": "1 3/4 teaspoons kosher salt, divided",
                "8": "2 large beefsteak tomatoes (about 2 pounds), cut into 1/2\" cubes",
                "9": "2 cups corn kernels (preferably fresh; from about 3 ears of corn), divided",
                "10": "8 ounces cheddar cheese, grated (about 2 cups)",
                "11": "2 large eggs",
                "12": "6 tablespoons unsalted butter, melted",
                "13": "1/3 cup sour cream, plus more for serving",
                "14": "1 1/4 cups cornmeal",
                "15": "1 teaspoon baking powder"
            },
            "Instructions": "Preheat oven to 450°F. Heat an 8\" cast-iron skillet over high. Pat chorizo and beef dry with paper towels, then press into an even layer in bottom of hot skillet with a spatula. Cook, undisturbed, until a brown crust begins to form on the bottom, about 6 minutes. Turn, break into pieces, and continue to cook until cooked through, about 4 minutes. Add tomato paste, cumin, half of grated onion, half of jalapeño, and 1 1/4 tsp. salt and cook, stirring constantly, until fragrant and well combined, about 1 minute. Remove from heat and stir in tomatoes, 1 1/2 cups corn, and 1 1/2 cups cheese.\nWhisk eggs, butter, 1/3 cup sour cream, and remaining onion in a medium bowl. Whisk cornmeal, baking powder, and remaining 1/2 tsp. salt in a small bowl. Add dry ingredients to butter mixture and stir to combine, then stir in 1/4 cup cheese and remaining 1/2 cup corn.\nDollop cornbread batter over meat mixture, then smooth into an even layer. Top with remaining jalapeños and 1/4 cup cheese.\nBake cornbread until golden brown, 15–18 minutes. Serve with sour cream alongside.",
            "Image": "//20fix.com/xfood/img/tamale-pie-with-fresh-tomato-and-corn.jpg"
        },
        {
            "id": "130",
            "Title": "Cooler-Steamed Corn",
            "Ingredients": {
                "1": "6 Tbsp. Diamond Crystal or 3 Tbsp. plus 1¼ tsp. Morton kosher salt",
                "2": "6 ears of corn, in husk"
            },
            "Instructions": "Combine salt and 3 quarts water in a large pot; stir until salt is dissolved. Add corn; let sit at room temperature at least 2 hours, or cover and chill up to 12 hours.\nPrepare a grill for high heat. Drain corn and grill until husks are lightly charred all over, about 15 minutes. Wrap in a clean towel and place in a cooler. Let steam at least 15 minutes and up to 3 hours.",
            "Image": "//20fix.com/xfood/img/grilled-cooler-steamed-corn.jpg"
        },
        {
            "id": "136",
            "Title": "Creole Caesar Salad With Corn Bread Croutons",
            "Ingredients": {
                "1": "2 cups Fried Okra",
                "2": "2 heads romaine lettuce, leaves separated",
                "3": "1 cup cooked fresh corn kernels, chilled",
                "4": "2½ cups cubed corn bread, toasted",
                "5": "½ cup sliced grape tomatoes",
                "6": "½ cup sliced seedless cucumber",
                "7": "¼ cup sliced red onion",
                "8": "Creole Caesar Dressing (recipe follows)",
                "9": "⅔ cup extra-virgin olive oil",
                "10": "3 garlic cloves, peeled",
                "11": "2 tablespoons chopped onion",
                "12": "2 tablespoons red wine vinegar",
                "13": "½ roasted red bell pepper",
                "14": "1 tablespoon finely chopped celery",
                "15": "1 teaspoon light brown sugar",
                "16": "¼ teaspoon cayenne pepper",
                "17": "2 tablespoons mayonnaise",
                "18": "¼ cup grated Parmesan cheese",
                "19": "Salt and pepper"
            },
            "Instructions": "Place half the fried okra in a large bowl and add the romaine, corn, corn bread, tomatoes, cucumber, and onion. Add the dressing and toss until well coated.\nDivide the salad among six serving plates and top evenly with the remaining okra. Serve immediately.\nIn a small saucepan, combine the oil, garlic, and onion. Cook over low heat until the garlic and onion are golden and tender, about 15 minutes. Using a slotted spoon, transfer the garlic and onion to a food processor; reserve the oil.\nAdd the vinegar, bell pepper, celery, sugar, cayenne, mayonnaise, Parmesan, and a pinch each of salt and black pepper to the food processor. Pulse until smooth. With the machine running, add the oil in a thin stream and process until emulsified. Taste and season with salt and pepper. Use immediately or store in an airtight container in the refrigerator for up to 1 week.",
            "Image": "//20fix.com/xfood/img/creole-caesar-salad-with-corn-bread-croutons.jpg"
        },
        {
            "id": "155",
            "Title": "Grilled Watermelon Salad With Lime Mango Dressing and Cornbread Croutons",
            "Ingredients": {
                "1": "½ cup coarsely chopped ripe mango",
                "2": "¼ cup fresh lime juice",
                "3": "¼ cup dry sake",
                "4": "2 tablespoons champagne vinegar",
                "5": "1 teaspoon minced seeded bird’s-eye chile",
                "6": "½ teaspoon kosher salt",
                "7": "¼ cup canola oil",
                "8": "3 pounds seedless watermelon, peel left on, cut into 1-inch-thick slabs",
                "9": "Olive oil",
                "10": "Kosher salt",
                "11": "½ cup hulled pumpkin seeds",
                "12": "¼ teaspoon ground cayenne",
                "13": "1 teaspoon sugar",
                "14": "4 cups 1-inch cubes homemade or store-bought cornbread",
                "15": "2 tablespoons unsalted butter, melted",
                "16": "8 fresh shiso leaves, shredded (or Thai basil or mint)",
                "17": "½ cup dates, pitted and chopped",
                "18": "1 serrano chile, sliced into rings",
                "19": "Freshly ground black pepper",
                "20": "½ cup ricotta or mascarpone"
            },
            "Instructions": "Put all of the ingredients except the oil in a blender. Blend on high. After the ingredients are blended, slowly add the oil and continue to blend until the mixture is thickened and emulsified. (Makes 1 cup.)\nHeat a grill pan to medium-high heat. Drizzle the watermelon slices with just enough oil to thinly coat and place them on the hot grill.\nGrill each side of the watermelon slices for about 2 minutes, until charred. Transfer to a plate and season with salt.\nRemove the rind and dice the grilled watermelon into large cubes.\nPreheat the oven to 350°F. Toss the pumpkin seeds with the cayenne, sugar, and 2 teaspoons oil and place on a small baking sheet. Roast for 6 to 10 minutes, until golden.\nBrush the cornbread cubes with the melted butter and place in a single layer on a baking sheet. Put in the oven along with the pumpkin seeds and bake for 10 minutes, turning halfway with a flexible spatula. Remove from the oven when the croutons are toasted and golden.\nToss the watermelon, shiso, dates, and chile in the bowl with ¼ cup Lime Mango Dressing (reserve remaining dressing for another use). Taste and adjust the seasoning with salt and pepper. Add the cornbread croutons and toss very gently to combine without breaking the croutons. Spoon the salad onto a large platter and garnish with the pumpkin seeds and cheese.",
            "Image": "//20fix.com/xfood/img/grilled-watermelon-salad-with-lime-mango-dressing-and-cornbread-croutons.jpg"
        },
        {
            "id": "157",
            "Title": "Mississippi Corn Pudding",
            "Ingredients": {
                "1": "5 tablespoons unsalted butter, melted and cooled slightly, plus more for greasing",
                "2": "2 large eggs, beaten",
                "3": "⅓ cup sugar",
                "4": "½ cup whole milk",
                "5": "¼ cup heavy cream",
                "6": "¾ cup sour cream",
                "7": "½ cup all-purpose flour",
                "8": "½ cup coarse yellow cornmeal",
                "9": "1 teaspoon kosher salt",
                "10": "⅛ teaspoon white pepper",
                "11": "⅛ teaspoon paprika",
                "12": "⅛ teaspoon baking soda",
                "13": "¼ cup chopped yellow onion",
                "14": "½ cup chopped celery",
                "15": "1 pound fresh corn kernels, cut from 4 cobs",
                "16": "1 cup shredded cheddar cheese",
                "17": "1 cup butter cracker crumbs, such as Ritz"
            },
            "Instructions": "Set a rack in the lower third of the oven. Preheat the oven to 350°F. Grease a 9 by 13-inch casserole dish with butter, making sure to get in all the corners and sides of the dish.\nIn a medium bowl, whisk together the eggs and sugar until well combined. Add the melted butter, milk, heavy cream, and sour cream and whisk to incorporate.\nIn a large bowl, whisk together the flour, cornmeal, salt, pepper, paprika, and baking soda.\nUsing a spatula, fold the wet ingredients, 1 cup at a time, into the dry ingredients until well combined.\nFold in the onion, celery, corn, and cheese.\nPour the batter into the prepared baking dish and sprinkle the cracker crumbs on top. Bake the pudding for 30 to 40 minutes, rotating halfway through, until lightly browned on top and the tip of a knife inserted in the center comes out clean.",
            "Image": "//20fix.com/xfood/img/mississippi-corn-pudding.jpg"
        },
        {
            "id": "178",
            "Title": "Cornbread Muffins With Whipped Sweet Corn",
            "Ingredients": {
                "1": "3 tablespoons coconut oil, plus more for greasing",
                "2": "6 pitted Medjool dates",
                "3": "Boiling water",
                "4": "¾ cup medium-grind yellow cornmeal",
                "5": "¾ cup flour",
                "6": "2 tablespoons coconut palm sugar",
                "7": "1 tablespoon baking powder",
                "8": "½ teaspoon fine sea salt",
                "9": "2 heaping tablespoons freshly ground golden flaxseeds",
                "10": "1 cup unsweetened oat milk",
                "11": "3 tablespoons vegan butter",
                "12": "¼ cup finely diced white onion",
                "13": "2 cups fresh corn kernels (from about 3 ears)",
                "14": "2 teaspoons coconut palm sugar",
                "15": "¼ teaspoon kosher salt, plus more as needed",
                "16": "½ cup Cashew Cream",
                "17": "Fresh lemon juice",
                "18": "Freshly ground white pepper",
                "19": "Jalapeño Pepper Jelly, for serving"
            },
            "Instructions": "Make the muffins: Preheat the oven to 400°F. Generously coat nine wells of a standard muffin tin with coconut oil.\nPut the dates in a small heatproof bowl and cover with boiling water. Let soak for about 5 minutes. Drain the dates, reserving the soaking liquid, and transfer them to a food processor. Add 1 tablespoon of the reserved soaking liquid and process, scraping down the sides and adding more of the reserved soaking liquid if necessary, until mostly creamy but with a few chunks remaining.\nPlace the prepared muffin tin in the oven to heat for 5 minutes. Meanwhile, in a large bowl, sift together the cornmeal, flour, sugar, baking powder, and salt. Whisk until blended.\nPut the flaxseeds and 6 tablespoons water in a medium bowl and whisk until well blended. Whisk in the pureed dates and the coconut oil until smooth. Whisk in the oat milk until well combined. Add the oat milk mixture to the cornmeal mixture and stir until just combined.\nWhen the muffin tin is hot, remove it from the oven and immediately scrape the batter into the prepared muffin cups, distributing it evenly among them (they should be a little over three-quarters full).\nBake until the muffins are golden brown, 16 to 18 minutes. Let cool in the tin for about 10 minutes, then transfer to a wire rack to cool a bit more.\nMake the whipped sweet corn: While the muffins are cooling, in a large skillet, melt the butter over medium heat. Add the onion and sauté, stirring often, until soft, 3 to 5 minutes. Add the corn, sugar, and salt and cook, stirring often, until the corn is just tender, about 5 minutes.\nScrape the contents of the skillet into a food processor. Add the cashew cream and process until silky smooth, adding water as necessary to reach the desired consistency. Taste and season with lemon juice, salt, and white pepper. Transfer to a serving bowl. Serve the warm muffins slathered with whipped sweet corn and topped with pepper jelly.",
            "Image": "//20fix.com/xfood/img/cornbread-muffins-with-whipped-sweet-corn.jpg"
        },
        {
            "id": "278",
            "Title": "Blueberry Lemon Corn Muffins",
            "Ingredients": {
                "1": "paper muffin cup liners",
                "2": "1/2 stick (1/4 cup) unsalted butter",
                "3": "3/4 cup all-purpose flour",
                "4": "1 1/2 teaspoons baking powder",
                "5": "1/2 cup yellow cornmeal",
                "6": "1/2 cup plus 1 tablespoon sugar",
                "7": "1 tablespoon freshly grated lemon zest",
                "8": "1/2 cup whole milk",
                "9": "2 large egg yolks",
                "10": "1/2 cup blueberries"
            },
            "Instructions": "Preheat oven to 375°F. and line six 1/3-cup muffin cups with paper liners.\nMelt butter and cool. Into a large bowl sift together flour and baking powder and whisk in cornmeal, 1/2 cup sugar, lemon zest, and a generous pinch salt. In a bowl whisk together melted butter, milk, and yolks and add to flour mixture with half of blueberries, gently stirring until just combined.\nDivide batter evenly among cups (batter will fill cups) and press remaining blueberries into tops of muffins. Sprinkle tops of muffins evenly with remaining tablespoon sugar. Bake muffins in middle of oven about 15 minutes, or until tops are golden and a tester comes out clean. Remove muffins from cups and cool on a rack. Muffins keep in an airtight container at room temperature 2 days.",
            "Image": "//20fix.com/xfood/img/blueberry-lemon-corn-muffins-15255.jpg"
        },
        {
            "id": "389",
            "Title": "One-Pot Pie with Callaloo, Plantain, Goat Cheese, and Cornmeal Crust",
            "Ingredients": {
                "1": "1 stick cold butter",
                "2": "1 1/2 cups all-purpose flour plus more for rolling",
                "3": "1/2 cup yellow cornmeal",
                "4": "1/2 teaspoon sea salt",
                "5": "3/4 cup Parmesan cheese",
                "6": "2 tablespoons olive oil, divided",
                "7": "2 cloves garlic, diced, divided",
                "8": "1 small yellow onion, chopped, divided",
                "9": "2 tablespoons chopped red bell pepper, divided",
                "10": "1 or 2 Scotch bonnet peppers, seeded and diced, divided",
                "11": "2 tablespoons fresh thyme leaves, divided",
                "12": "2 scallions, diced, divided",
                "13": "4 cups callaloo chiffonade",
                "14": "1/2 cup heavy cream, divided",
                "15": "2 cups cubed ripe plantain (1-inch cubes)",
                "16": "Salt and freshly cracked black pepper to taste",
                "17": "1/2 cup canned corn kernels",
                "18": "2 tablespoons chopped cilantro",
                "19": "1 tablespoon butter",
                "20": "1 tablespoon chopped scallion",
                "21": "1/4 cup dry white wine",
                "22": "1/2 cup heavy cream",
                "23": "1/2 cup whole milk",
                "24": "1 tablespoon fresh thyme leaves",
                "25": "2 tablespoons grated Parmesan cheese",
                "26": "8 ounces fresh mozzarella cheese, cut into 1/2-inch cubes",
                "27": "1/2 cup grated Parmesan cheese, divided",
                "28": "1/2 cup goat cheese",
                "29": "1 egg, beaten"
            },
            "Instructions": "Cut the chilled butter into very small pieces. Mix the flour, cornmeal, and sea salt in a food processor; add the butter, and pulse until the mixture is a sandy texture that resembles breadcrumbs. Transfer to a bowl, and add half the Parmesan cheese, mixing with a fork or knife until combined. (Reserve remaining cheese for topping the pie.) Measure out 4 tablespoons of ice-cold water, and add to the flour mixture a little at a time until the dough sticks together, mixing just long enough to create a mass. Do not overmix. Wrap the dough in plastic wrap or place in a plastic bag; hold it in the refrigerator for at least 20 minutes. Remove one hour before use to bring to room temperature.\nHeat 1 tablespoon olive oil in a large sauté pan over medium heat. Add half the garlic, onion, bell pepper, Scotch bonnet pepper, thyme, and scallion; cook for about 5 minutes until soft. Add the callaloo and cook down for about 8 minutes, until it turns bright green. Stir in 1/4 cup heavy cream. Remove from heat and allow to cool. Season with salt and pepper to taste.\nHeat 1 tablespoon olive oil in another sauté pan over medium heat, and add the remaining garlic, onion, bell pepper, Scotch bonnet pepper, thyme, and scallion; sauté for about 1 minute. Add the plantain and cook, stirring occasionally, for another 5 minutes. Add the corn and cilantro, and sauté for another minute. Add 1/4 cup heavy cream, and season to taste with salt and pepper.\nMelt 1 tablespoon butter in a saucepan over medium heat. Add 1 tablespoon chopped scallion. Add the white wine, and cook, stirring, until the wine is evaporated. Stir in the heavy cream and whole milk. Bring to a simmer. Allow to simmer for about 5 minutes, until the sauce is reduced. Stir in the thyme and Parmesan cheese.\nPreheat the oven to 375°F. On a lightly floured surface, roll out two-thirds of the pastry into a large circle, and use it to line the base and sides of an 8-inch pie dish or casserole. Layer half the plantain mixture in the bottom, then distribute half the mozzarella and a sprinkle of Parmesan on top of that. Cover with half the callaloo mixture, then half the goat cheese and more Parmesan. Repeat the layers in the same order with the remaining plantain filling, mozzarella, Parmesan, callaloo filling, goat cheese, and more Parmesan. Pour the sauce over the assembled pie.\nOn a lightly floured surface, roll out the rest of the pastry into an 8-inch round; lay it on top of the pie, trimming away any excess pastry and crimping the edges to seal well. Score an X in the middle of the top crust with a sharp knife. Brush the top of the pie with the beaten egg, scatter with the rest of the Parmesan, and chill for at least 20 minutes. Bake for 30 to 35 minutes until the pastry is golden-brown on top. Allow to cool in the pan for 10 minutes before serving.",
            "Image": "//20fix.com/xfood/img/one-pot-pie-with-callaloo-plantain-goat-cheese-and-cornmeal-crust.jpg"
        },
        {
            "id": "471",
            "Title": "Cornbread Stuffing With Sausage and Corn Nuts",
            "Ingredients": {
                "1": "3 lb. cornbread, cut into ¾\" pieces (14–16 cups)",
                "2": "1½ lb. breakfast sausage, casings removed if needed",
                "3": "1 cup unsalted butter (2 sticks), plus more for pan",
                "4": "2 medium onions, chopped",
                "5": "4 celery stalks, chopped",
                "6": "Kosher salt",
                "7": "3 garlic cloves, finely chopped",
                "8": "2 Thai chiles or 1 jalapeño (with seeds), chopped",
                "9": "¾ cup corn nuts, finely ground in a food processor, blender, or mortar and pestle (about ½ cup)",
                "10": "¾ cup dry white wine",
                "11": "1 Tbsp. finely chopped sage",
                "12": "2 tsp. finely chopped thyme",
                "13": "3 large eggs",
                "14": "Freshly ground black pepper",
                "15": "3½ cups turkey stock or low-sodium chicken broth"
            },
            "Instructions": "Preheat oven to 325°F. Divide cornbread evenly between 2 large rimmed baking sheets and bake, tossing occasionally, until dried out and lightly browned around the edges, 40–50 minutes. Let cool at least 10 minutes. Increase oven temperature to 350°F.\nMeanwhile, cook sausage in a large skillet over medium-high heat, stirring and breaking up with a spoon, until lightly browned and cooked through, 6–8 minutes. Transfer to a plate.\nReduce heat to medium and melt butter in same skillet. Add onions and celery; season with salt. Cook, stirring occasionally, until softened but not browned, 8–10 minutes. Add garlic and chiles. Cook, stirring once, until very fragrant, about 1 minute. Add corn nuts and cook, stirring often, until very fragrant and vegetables are starting to brown around the edges, about 3 minutes. Add wine and cook, stirring occasionally, until almost completely evaporated, about 3 minutes. Add sage and thyme and toss to combine. Remove from heat.\nCombine cornbread, sausage, and vegetable mixture in a large bowl. Whisk eggs and stock in a medium bowl until very well combined. Pour over cornbread mixture and let sit, gently stirring every minute or so, until cornbread has absorbed all or virtually all of the liquid. Season with salt and pepper (about 1 Tbsp. Diamond Crystal or 1½ tsp. Morton kosher salt).\nLightly butter a 3-qt. or 13x9x2\" baking dish. Transfer stuffing to dish and tap dish lightly against counter to distribute and compact stuffing. Cover tightly with foil and bake until stuffing is very hot throughout and bubbles appear around sides, 40–45 minutes. Increase oven temperature to 425°F and remove foil. Continue to bake stuffing until top is lightly browned, 15–20 minutes longer.\nDo Ahead: Stuffing can be baked at 350°f 3 days ahead. Let cool, then chill. Reheat in a 350°F oven before increasing temperature to 425°F and removing foil.",
            "Image": "//20fix.com/xfood/img/cornbread-stuffing-with-sausage-and-corn-nuts.jpg"
        },
        {
            "id": "587",
            "Title": "Chipotle-Grilled Pork Shoulder Steaks with Corn Salsa",
            "Ingredients": {
                "1": "2 tsp. chipotle chile powder",
                "2": "2 tsp. dried oregano",
                "3": "1 1/2 tsp. garlic powder",
                "4": "1 tsp. ground allspice",
                "5": "2 3/4 tsp. (or more) kosher salt, divided",
                "6": "4 (3/4\"-thick) boneless pork shoulder (Boston butt) steaks (about 2 lb.) or pork blade chops",
                "7": "Vegetable oil (for grill)",
                "8": "4 ears of corn, husked",
                "9": "1/2 small white onion, finely chopped",
                "10": "1 cup cilantro, finely chopped",
                "11": "1 cup crumbled Cotija or feta (about 5 oz.)",
                "12": "1/2 cup toasted pumpkin seeds (pepitas)",
                "13": "3 Tbsp. fresh lime juice",
                "14": "Flaky sea salt",
                "15": "Lime wedges (for serving)"
            },
            "Instructions": "Mix chile powder, oregano, garlic powder, allspice, and 2 tsp. kosher salt in a small bowl. Rub spice mixture all over pork steaks. Let sit at room temperature at least 15 minutes.\nPrepare a grill for medium heat; oil grate. Grill pork and corn, turning occasionally, until pork is deeply charred and an instant-read thermometer inserted into the thickest part registers 145°F for medium, and the corn is lightly charred all over, 7–9 minutes. Transfer pork to a cutting board and let rest 10 minutes.\nLet corn cool slightly. Slice kernels off cobs into a large bowl. Add onion, season with 3/4 tsp. kosher salt, and stir to combine. Stir in cilantro, cheese, pumpkin seeds, and lime juice; taste salsa and season with more kosher salt if needed.\nTransfer pork to a platter. Drizzle any accumulated juices left on cutting board over; sprinkle with sea salt. Top with corn salsa and serve with lime wedges alongside.\nDo Ahead: Pork can be seasoned 1 day ahead. Cover and chill. Let sit at room temperature 15 minutes before grilling.",
            "Image": "//20fix.com/xfood/img/chipotle-grilled-pork-shoulder-steaks-with-corn-salsa.jpg"
        },
        {
            "id": "608",
            "Title": "Brothy Steamed Clams with Corn",
            "Ingredients": {
                "1": "1/4 cup extra-virgin olive oil, plus more for drizzling",
                "2": "1/2 fennel bulb, very thinly sliced",
                "3": "1 small leek, halved lengthwise, thinly sliced",
                "4": "Kosher salt",
                "5": "1 garlic clove, thinly sliced",
                "6": "1 cup fresh corn kernels (from about 1 ear)",
                "7": "1/4 cup dry white wine",
                "8": "36 littleneck or Manila clams, scrubbed",
                "9": "1/2 cup finely chopped parsley",
                "10": "2 Tbsp. finely chopped chives",
                "11": "Crushed red pepper flakes and grilled or toasted bread (for serving)"
            },
            "Instructions": "Heat 1/4 cup oil in a medium Dutch oven or other heavy pot with a lid over medium-high. Add fennel and leek and season with salt. Cook, stirring often, until vegetables are starting to soften, about 3 minutes. Add garlic and corn and cook, stirring, until garlic is translucent, about 1 minute. Add 1/4 cup water and simmer until corn is bright yellow and starting to soften, about 2 minutes. Add wine and simmer until slightly reduced, about 30 seconds. Add clams, cover pot, and reduce heat to medium. Cook, stirring occasionally, until clams open, 8–12 minutes. Discard any clams that have not opened. Top with parsley, chives, and a few pinches of red pepper flakes and drizzle with oil. Serve with grilled bread for soaking up pan sauces.",
            "Image": "//20fix.com/xfood/img/brothy-steamed-clams-with-corn.jpg"
        },
        {
            "id": "622",
            "Title": "Grilled Sweet Corn with Basil Butter",
            "Ingredients": {
                "1": "1 1/2 Tbsp finely chopped basil",
                "2": "1/2 tsp chopped thyme",
                "3": "3/4 stick unsalted butter, softened",
                "4": "8 ears corn in husks",
                "5": "Flaky or coarse sea salt for sprinkling"
            },
            "Instructions": "Stir herbs into butter and let stand at room temperature while preparing corn.\nPrepare grill for direct-heat cooking over medium-hot charcoal (medium high for gas).\nPull husks back from corn, covered only if using a gas grill, turning frequently, until tender, 15 to 18 minutes.\nServe with basil butter and salt.",
            "Image": "//20fix.com/xfood/img/grilled-sweet-corn-with-basil-butter.jpg"
        },
        {
            "id": "632",
            "Title": "Pasta with Clams, Corn, and Basil Pesto",
            "Ingredients": {
                "1": "1/2 garlic clove, finely grated",
                "2": "1/4 cup grated Parmigiano",
                "3": "1 cup packed fresh basil leaves (stems reserved)",
                "4": "3 tablespoons extra-virgin olive oil",
                "5": "Finely grated zest of 1/2 lemon",
                "6": "Kosher salt, freshly ground pepper",
                "7": "Kosher salt",
                "8": "2 tablespoons unsalted butter",
                "9": "2 tablespoons extra-virgin olive oil",
                "10": "3 garlic cloves, thinly sliced",
                "11": "2 small shallots, thinly sliced",
                "12": "1/2 cup white wine",
                "13": "24 littleneck or Manila clams, scrubbed",
                "14": "12 ounces short tubular pasta, such as mezze rigatoni",
                "15": "2 cups corn kernels (from 3 to 4 ears)"
            },
            "Instructions": "In a blender or food processor, combine garlic, Parmigiano, basil, and oil and blend until very smooth, scraping down sides as needed and adding a tablespoon or two of water if needed to get things moving. Add lemon zest and season with salt and pepper. Set pesto aside (you should have about 1/2 cup).\nBring a large pot of water to a boil for the pasta and season it generously with salt. In a medium Dutch oven or large cast-iron skillet, heat butter and oil over medium-high heat. When butter is foaming, add garlic, shallots, and reserved basil stems and cook until mixture is fragrant, about 2 minutes. Add wine and bring to a simmer. Add clams, toss to coat, cover, and cook, checking and stirring every few minutes, until clams begin to open, 3 to 5 minutes. As clams open, transfer them with a slotted spoon to a medium bowl, but try to keep pot covered as much as possible. Fish out basil stems and keep pan sauce warm over very low heat. (If you want a shell-free dining experience, gently liberate clams from their shells and return them to bowl with a splash or two of pasta water over them so they don’t dry out.)\nCook pasta until 1 or 2 minutes shy of al dente. Scoop 1 cup of pasta water into pan with clam sauce. Drain pasta and add to sauce along with half of the pesto. Add corn and bring mixture to a simmer. Cook, stirring, until liquid starts to thicken and pasta is al dente, about 2 minutes. Add clams and any accumulated liquid from bowl. Cook, stirring and tossing, until clams are warmed through, 2 minutes. Serve pasta and clams topped with more pesto.",
            "Image": "//20fix.com/xfood/img/pasta-with-clams-corn-and-basil-pesto.jpg"
        },
        {
            "id": "641",
            "Title": "Pop It Like It's Hot Popcorn",
            "Ingredients": {
                "1": "1/2 cup popcorn kernels",
                "2": "1 tablespoon coconut oil",
                "3": "2 teaspoons sea salt",
                "4": "1 teaspoon ground cinnamon",
                "5": "1 tablespoon coconut sugar",
                "6": "2 tablespoons fresh lemon zest",
                "7": "1/2 cup chopped fresh chives",
                "8": "1 tablespoon nutritional yeast",
                "9": "1/4 teaspoon ground cayenne",
                "10": "2 tablespoons almond butter",
                "11": "2 tablespoons honey (soften it in a microwave first)",
                "12": "2 tablespoons dark chocolate chips",
                "13": "2 tablespoons crushed pistachios",
                "14": "2 tablespoons dried cranberries or raisins"
            },
            "Instructions": "In a saucepan set over medium-high heat, warm a couple of popcorn kernels with the coconut oil. Put a lid on the saucepan and wait for the initial kernels to pop. This lets you know the heat is just right. When the pan is hot enough, add the remaining kernels and replace the lid on the pan.\nCarefully shake the saucepan as the kernels pop. When they are all popped, transfer the popcorn to a bowl and toss it with the salt. Add any of the extra flavor options that you and your friends might like!",
            "Image": "//20fix.com/xfood/img/pop-it-like-its-hot-homemade-popcorn.jpg"
        },
        {
            "id": "645",
            "Title": "Corn Cacio e Pepe",
            "Ingredients": {
                "1": "16 oz. gemelli, orecchiette, or other medium pasta",
                "2": "Kosher salt",
                "3": "3 cups corn kernels (from 3 large ears)",
                "4": "8 oz. aged Pecorino Romano or Parmesan, finely grated (about 2 cups), plus more for serving",
                "5": "2 tsp. freshly ground black pepper, plus more for serving"
            },
            "Instructions": "Cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente; add corn about 30 seconds before pasta is done cooking. Drain, reserving 1 cup pasta cooking liquid. Return pasta and corn to the pot.\nWhile pasta is cooking, toss 8 oz. cheese and 2 tsp. pepper in a medium bowl to combine. Add 1/3 cup cold water and use a fork to mash mixture into a thick paste (try to get it as smooth as possible). Still mashing, add more water a tablespoonful at a time until paste is about the consistency of cream cheese.\nAdd cheese mixture to pot with pasta and corn. Using a rubber spatula, toss pasta until coated (the cheese mixture will be too thick to form a sauce at this point). Tossing constantly, add reserved pasta cooking liquid a splash at a time until a glossy sauce forms (it should still be fairly thick).\nTransfer pasta to a large bowl and top with more cheese and a few additional grinds of pepper.",
            "Image": "//20fix.com/xfood/img/corn-cacio-e-pepe.jpg"
        },
        {
            "id": "666",
            "Title": "Skillet Cornbread With Bacon Fat and Brown Sugar",
            "Ingredients": {
                "1": "2 ½ cups fine white stone-ground cornmeal",
                "2": "1 tablespoon baking powder",
                "3": "1 ½ teaspoons salt",
                "4": "3 large eggs",
                "5": "1 ¾ cups buttermilk",
                "6": "2 tablespoons packed brown sugar",
                "7": "3 tablespoons rendered bacon fat or lard"
            },
            "Instructions": "Preheat the oven to 425°F.\nWhisk the cornmeal, baking powder, and salt in a large bowl. Whisk the eggs, buttermilk, and brown sugar in another bowl until smooth.\nWhisk the wet ingredients into the dry ingredients.\nHeat the bacon fat in a 12-inch cast-iron skillet until liquid. Swirl it around to coat the bottom and sides of the skillet, then pour the rest into the batter.\nWhisk the batter until smooth, then pour into the hot skillet. Immediately transfer to the oven.\nBake until golden brown and a toothpick inserted in the center comes out clean, about 25 minutes. Serve warm.",
            "Image": "//20fix.com/xfood/img/skillet-cornbread-with-bacon-fat-and-brown-sugar.jpg"
        },
        {
            "id": "780",
            "Title": "Corned Beef with Crispy Roasted Potatoes and Cabbage",
            "Ingredients": {
                "1": "1 (3–4-lb.) corned beef brisket",
                "2": "2 lb. russet potatoes, scrubbed, quartered",
                "3": "1 1/4 cups extra-virgin olive oil, divided",
                "4": "Kosher salt, freshly ground pepper",
                "5": "1 large green cabbage, cut through the core into 8 wedges",
                "6": "4 whole cloves",
                "7": "1 tsp. coriander seeds",
                "8": "1 tsp. mustard seeds",
                "9": "1 tsp. peppercorns",
                "10": "1/2 tsp. crushed red pepper flakes",
                "11": "2 garlic cloves, finely grated",
                "12": "6 Tbsp. white wine vinegar",
                "13": "1 Tbsp. honey",
                "14": "1 cup finely chopped dill",
                "15": "A mortar and pestle"
            },
            "Instructions": "Place corned beef in a large pot. Add enough water to cover by 2\" and bring to a boil. Reduce heat to low, cover, and simmer until very tender, 3–3 1/2 hours.\nOnce beef has been simmering for 2 1/2 hours, arrange racks in top and bottom thirds of oven; preheat to 375°F. Toss potatoes, 1/4 cup oil, 1 tsp. salt, and 1 tsp. pepper on a rimmed baking sheet. Rub cabbage wedges with 1/4 cup oil; season on all sides with 1 tsp. salt and 1 tsp. pepper. Arrange on another rimmed baking sheet. Roast, turning cabbage, tossing potatoes, and rotating sheets top to bottom halfway through, until golden brown and tender, 45–40 minutes. (The cabbage might be done before the potatoes.)\nMeanwhile, coarsely crush cloves, coriander seeds, mustard seeds, peppercorns, and red pepper flakes with mortar and pestle. Transfer to a small saucepan and cook over medium heat, swirling often, until fragrant, about 2 minutes. Add garlic and remaining 3/4 cup oil and cook, stirring, until garlic sizzles, about 1 minute. Transfer to a medium heatproof bowl. Stir in vinegar, honey, and 2 tsp. salt. Let cool, then stir in dill.\nTransfer beef to a cutting board and let sit 10 minutes. Trim off excess fat, then thinly slice against the grain. Serve alongside roasted cabbage and potatoes with dill sauce drizzled over.",
            "Image": "//20fix.com/xfood/img/corned-beef-with-crispy-roasted-potatoes-and-cabbage.jpg"
        },
        {
            "id": "882",
            "Title": "Plain Popcorn",
            "Ingredients": {
                "1": "2 tablespoons vegetable oil",
                "2": "1/3 cup popcorn kernels"
            },
            "Instructions": "Heat oil with 3 popcorn kernels in a 3-quart heavy saucepan over moderate heat, covered, until 1 or 2 kernels pop. Quickly add remaining popcorn, then cook, covered, shaking pan frequently, until kernels stop popping, about 3 minutes.",
            "Image": "//20fix.com/xfood/img/plain-popcorn-108511.jpg"
        },
        {
            "id": "917",
            "Title": "Cornbread Stuffing with Sausage and Collard Greens",
            "Ingredients": {
                "1": "Buttermilk Cornbread",
                "2": "9 Tbsp. unsalted butter, divided, plus more for pan",
                "3": "2 Tbsp. extra-virgin olive oil",
                "4": "1 1/2 lb. hot or sweet Italian sausage, casings removed",
                "5": "1 large onion, finely chopped",
                "6": "2 celery stalks, finely chopped",
                "7": "6 garlic cloves, thinly sliced",
                "8": "2 Tbsp. finely chopped rosemary",
                "9": "1 Tbsp. kosher salt",
                "10": "1/2 tsp. crushed red pepper flakes",
                "11": "2 bunches collard greens, stems and ribs removed, leaves torn or cut into 2\" pieces",
                "12": "1 1/2 cups heavy cream",
                "13": "2 1/2 cups low-sodium chicken broth, divided",
                "14": "3 large eggs, beaten to blend"
            },
            "Instructions": "Place a rack in middle of oven; preheat oven to 300°F. Cut cornbread into 1\" cubes and divide between 2 large rimmed baking sheets. Toast, turning over halfway through, until outsides are dried out and some of the sides are golden brown, 45–55 minutes.\nIncrease oven temperature to 350°F. Lightly butter a 13x9\" baking dish. Heat oil in a large Dutch oven or other heavy pot over medium-high. Arrange sausage in a single layer in pot and cook, undisturbed, until browned underneath, about 4 minutes. Break up into bite-size pieces with a heatproof rubber spatula or wooden spoon and continue to cook, tossing occasionally, until just cooked through, about 3 minutes longer. Transfer sausage to a large bowl.\nReduce heat to medium-low and add 8 Tbsp. butter to same pot; swirl to melt and to coat bottom of pot. Add onion, celery, garlic, rosemary, salt, and red pepper flakes. Cook, stirring often, until vegetables are softened but not yet browned, about 5 minutes. Add collard greens and cook, tossing occasionally, until wilted, about 2 minutes. Add cream and 1 cup broth and bring mixture to a bare simmer. Cover pot and cook until greens are softened, 7–9 minutes.\nAdd vegetable mixture to bowl with sausage; mix in remaining 11/2 cups broth, then eggs. Add cornbread and carefully toss once (don’t break up pieces). Let sit 5 minutes, then gently toss again. Let sit until almost all the liquid has been absorbed, about 5 minutes more. Transfer stuffing, still being gentle with it, to prepared baking dish. Dot surface with pieces of remaining 1 Tbsp. butter and cover with foil.\nBake stuffing until hot in the center when pierced with a paring knife, 20–25 minutes. Remove foil and continue to bake until surface is deep golden brown and there are some crispy bits of sausage and greens on top, 25–30 minutes more.\nCornbread croutons can be made 2 days ahead; store in an airtight container at room temperature. Stuffing can be assembled but not baked one day ahead; cover and chill. Bring to room temperature before baking.",
            "Image": "//20fix.com/xfood/img/cornbread-stuffing-with-sausage-and-collard-greens.jpg"
        },
        {
            "id": "938",
            "Title": "Buttermilk Cornbread",
            "Ingredients": {
                "1": "Nonstick vegetable oil spray",
                "2": "2 cups all-purpose flour",
                "3": "2 cups medium-grind cornmeal",
                "4": "1/4 cup sugar",
                "5": "1 Tbsp. baking powder",
                "6": "2 1/2 tsp. kosher salt",
                "7": "3/4 tsp. freshly ground black pepper",
                "8": "4 large eggs",
                "9": "2 cups buttermilk",
                "10": "1/2 cup (1 stick) unsalted butter, melted, slightly cooled"
            },
            "Instructions": "Preheat oven to 400°F. Lightly coat a 13x9\" baking dish with nonstick spray. Whisk flour, cornmeal, sugar, baking powder, salt, and pepper in a large bowl. Whisk eggs, buttermilk, and butter in a medium bowl. Make a well in the dry ingredients and pour in egg mixture; stir into dry ingredients with a wooden spoon until combined. Scrape batter into prepared pan and smooth top.\nBake cornbread, rotating dish halfway through, until a tester inserted into the center comes out clean, 20–25 minutes. Let cornbread cool slightly in dish, then cut crosswise into 4 large pieces. Transfer to a wire rack with a large spatula and let cool completely.\nCornbread can be baked 2 days ahead. Store tightly wrapped at room temperature.",
            "Image": "//20fix.com/xfood/img/buttermilk-cornbread.jpg"
        },
        {
            "id": "945",
            "Title": "Skillet Dressing with Cornbread and Biscuits",
            "Ingredients": {
                "1": "1 1/2 cups fine-grind white cornmeal",
                "2": "1/2 cup all-purpose flour",
                "3": "1 Tbsp. sugar",
                "4": "1 tsp. baking powder",
                "5": "1 tsp. baking soda",
                "6": "1 tsp. kosher salt",
                "7": "1/2 tsp. freshly ground black pepper",
                "8": "1 large egg",
                "9": "2 cups buttermilk",
                "10": "1/4 cup grapeseed, vegetable, or other neutral oil",
                "11": "2 Tbsp. unsalted butter",
                "12": "2 Tbsp. unsalted butter, plus more for pan",
                "13": "1 large onion, finely chopped",
                "14": "3 large celery stalks, finely chopped",
                "15": "2 1/4 tsp. kosher salt, divided",
                "16": "4 biscuits (about 12 oz. total), such as Fluffy Cathead Biscuits",
                "17": "2 Tbsp. ground dried sage",
                "18": "1 tsp. freshly ground black pepper",
                "19": "3 large eggs",
                "20": "3 1/2 cups turkey stock or low-sodium chicken or vegetable broth",
                "21": "1/4 cup apple cider vinegar"
            },
            "Instructions": "Place a large cast-iron skillet in oven; preheat to 425°F. Whisk cornmeal, flour, sugar, baking powder, baking soda, salt, and pepper in a large bowl to combine. Whisk egg, buttermilk, and oil in a medium bowl to combine. Create a well in dry ingredients. Pour buttermilk mixture into well and whisk until no dry spots remain.\nRemove cast-iron skillet from oven (be careful; pan will be very hot). Add butter to pan and swirl to coat. Pour batter into pan and spread evenly. Bake cornbread until edges are golden brown and top is golden, 20–25 minutes.\nImmediately turn cornbread out onto a wire rack so bottom stays crisp. Let cool slightly, then invert onto another wire rack and let cool completely.\nDo Ahead: Cornbread can be baked 5 days ahead. Store tightly wrapped at room temperature, or freeze up to 3 months.\nPreheat oven to 375°F. Butter a large cast-iron skillet; set aside. Melt remaining 2 Tbsp. butter in a large skillet over medium heat. Add onion, celery, and a pinch of salt and cook, stirring occasionally, until vegetables are softened and just starting to take on some color, about 10 minutes.\nMeanwhile, tear cornbread into roughly 1\" pieces and transfer to a large bowl. Tear biscuits into slightly smaller pieces and add to same bowl.\nScrape vegetable mixture into bowl with bread and add sage, pepper, and remaining 2 tsp. salt. Gently toss to combine. Whisk eggs, stock, and vinegar in a medium bowl to combine. Drizzle over cornbread mixture and gently toss again to incorporate. Spoon dressing into prepared pan and bake until set and browned and crisp across the top, 45–55 minutes.\nDo Ahead: Dressing can be baked 1 day ahead. Let cool, then cover with foil and chill. Reheat in a 350°F oven, covered, until warmed through, 25–30 minutes, before serving.",
            "Image": "//20fix.com/xfood/img/skillet-dressing-with-cornbread-and-biscuits.jpg"
        }
    ],
    "t": 353,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 353,
        "pagesStart": 1,
        "pagesStop": 10,
        "pagesCurrent": 1,
        "pagesTotal": 15
    }
}