{"ingredient":"Pasta","recipes":{"s":1,"d":[{"id":"58","Title":"Spiced Lamb and Dill Yogurt Pasta","Ingredients":{"1":"3 large egg yolks","2":"2 cups kefir (cultured milk) or plain whole-milk yogurt","3":"3 cups (lightly packed) dill fronds with tender stems (about 1 large bunch), divided","4":"3 garlic cloves, divided","5":"3 Tbsp. unsalted butter","6":"½ cup pine nuts or slivered almonds","7":"½ cup dried currants or raisins","8":"1 tsp. kosher salt, plus more","9":"1 Tbsp. ground cumin","10":"1½ tsp. freshly ground black pepper","11":"1 lb. ground lamb","12":"1 lb. orecchiette or other short pasta","13":"½ lemon"},"Instructions":"Combine egg yolks, kefir, and 1½ cups dill in a blender; finely grate in 1 garlic clove and blend until smooth. Set purée aside. Finely chop remaining 1½ cups dill and set aside separately.\nMelt butter over medium heat in a large skillet. Add pine nuts and cook, stirring often, until golden brown, about 2 minutes. Add dried currants and cook, stirring often, until plump, about 1 minute. Scrape nut mixture into a small bowl; season with salt.\nWipe out skillet and heat over medium-high. Stir together cumin, pepper, and 1 tsp. salt in a small bowl. Place lamb in pan and use a sturdy spatula to aggressively flatten (like you’re making smash burgers); sprinkle spice mixture over. Cook, undisturbed, until lamb is well browned and crisp underneath, about 4 minutes. Hold back meat and drain off all of the fat. Break up meat into small pieces and mix in reserved nut mixture. Finely grate in remaining 2 garlic cloves and add reserved chopped dill. Cook, stirring, until herbs are wilted, about 1 minute. Set aside until pasta is ready.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until 1 minute shy of al dente (pasta will finish cooking in the sauce). Drain pasta and return to pot.\nPour reserved purée over pasta and set over medium heat. Cook, stirring constantly, until sauce thickens enough to cling to pasta and just comes to a simmer, about 3 minutes. Remove from heat; finely grate zest from lemon half over pasta, then squeeze in juice. Season with salt.\nDivide pasta among bowls and top with lamb mixture.","Image":"//20fix.com/xfood/img/spiced-lamb-and-dill-yogurt-pasta.jpg"},{"id":"70","Title":"Swiss Chard Pasta With Toasted Hazelnuts and Parmesan","Ingredients":{"1":"¼ cup hazelnuts","2":"1 pound bow tie pasta (farfalle)","3":"8 tablespoons unsalted butter, plus more if needed","4":"4 cloves of garlic, minced","5":"Hefty pinch each of salt and freshly ground black pepper","6":"Small pinch of crushed red pepper flakes","7":"1 bunch Swiss chard, stems finely chopped and greens thinly sliced","8":"4 ounces Parmesan cheese, shaved","9":"2 tablespoons balsamic vinegar (optional)"},"Instructions":"Add the hazelnuts to a small skillet over medium heat. Toast them slowly, shaking the pan often, until lightly browned, 8 to 10 minutes. Remove them from the skillet, and when they are cool enough to handle, roughly chop the nuts.\nBring a large pot of salted water to a boil and cook the pasta until al dente. Drain it, reserving 1/2 cup of the cooking liquid and add it to a large bowl.\nIn a large skillet, heat the butter over medium-low heat. Once the butter begins to foam, add the garlic and use a wooden spoon to stir the mixture constantly until the butter begins to brown and have a slight nutty aroma, about 5 minutes. Add the salt, black pepper, and red pepper flakes. Give the mixture a good stir, and then set it aside to infuse for about 5 minutes longer away from the heat.\nPour the butter mixture (scraping the garlic, salt, pepper, and red pepper flakes) all over the warm pasta. If the pasta feels a bit dry, add a touch of the reserved cooking liquid. Toss to combine and set aside.\nSet the same skillet (without cleaning it) over medium-high heat. Add the chard stems and cook for 5 minutes. Add the chard leaves and continue to cook, tossing the mixture every so often, until the greens begin to wilt and turn bright green, 3 to 5 minutes longer. Add a touch more butter or oil to the pan if it dries out too much.\nAdd the Swiss chard and hazelnuts to the pasta and toss it all together. Add the Parmesan shavings and the balsamic vinegar (if you’re using it); toss. Taste for seasonings and add more salt and pepper if needed.\nServe warm or at room temperature.\nLocalize it: You can use kale instead of chard, and any nut will work in place of the hazelnuts. Fresh out of balsamic vinegar? Red wine vinegar or freshly squeezed lemon juice will work.","Image":"//20fix.com/xfood/img/swiss-chard-pasta-with-toasted-hazelnuts-and-parmesan.jpg"},{"id":"82","Title":"Melted Broccoli Pasta With Capers and Anchovies","Ingredients":{"1":"Kosher salt","2":"2 heads (about 1 pound, or 454g, total) broccoli, cut into bitesize florets","3":"12 ounces (340 g) whole-wheat penne pasta, or other short tubular pasta","4":"3 tablespoons (45 ml) extra-virgin olive oil, divided","5":"1 cup (54 g) panko or Freezer Bread Crumbs (see Note)","6":"4 oil-packed anchovy fillets","7":"¼ cup (36 g) capers, chopped if large (rinsed well if salt-packed)","8":"2 garlic cloves, minced","9":"¼ teaspoon red pepper flakes"},"Instructions":"Bring a large pot of salted water to a boil over high heat. Add the broccoli florets and cook until bright green and crisp-tender, 2 to 3 minutes. Using a slotted spoon, transfer the broccoli to a large bowl.\nAdd the pasta to the boiling water and cook for 1 minute less than the package instructions for al dente, about 9 minutes.\nMeanwhile, toast the bread crumbs. Heat 1 tablespoon (15 ml) of olive oil in a large, high-sided sauté pan or skillet over medium heat. Add the breadcrumbs and sauté until the crumbs are golden brown and crisp, 4 to 5 minutes. Transfer to a small bowl and set aside.\nPour the remaining 2 tablespoons (30 ml) of olive oil into the pan. Add the anchovies and sauté until they disintegrate, about 1 minute. Add the capers, garlic, and red pepper flakes. Sauté until fragrant, about 1 minute, and remove from the heat.\nWhen the pasta is ready, reserve 1½ cups (360 ml) of pasta water with a measuring cup, then drain the pasta. Add the broccoli and reserved pasta water to the pan and bring to a simmer. Continue to simmer, using a wooden spoon to break the florets into small pieces as they become more tender, until the water is reduced by about half and you've been able to break apart enough florets that you're left with a very chunky mixture, 5 to 7 minutes.\nAdd the pasta to the pan. Cook, tossing and stirring, until the pasta is al dente and the sauce thickens and coats the pasta, 1 to 2 minutes. Remove from the heat, add half the toasted bread crumbs, and toss again to combine. Serve garnished with the remaining toasted bread crumbs.","Image":"//20fix.com/xfood/img/melted-broccoli-pasta-sheela-prakash.jpg"},{"id":"90","Title":"Burst Cherry Tomato Pasta","Ingredients":{"1":"½ cup extra-virgin olive oil, plus more for drizzling","2":"6 garlic cloves, smashed","3":"2½ lb. cherry tomatoes (about 4 pints)","4":"2 large sprigs basil, plus 1 cup basil leaves, torn if large","5":"¾ tsp. crushed red pepper flakes","6":"1½ tsp. kosher salt, plus more","7":"Pinch of sugar (optional)","8":"12 oz. casarecce or other medium-size pasta","9":"1 oz. Parmesan, finely grated (about ½ cup), plus more for serving"},"Instructions":"Heat ½ cup oil in a large heavy pot over low. Add garlic and cook, stirring often with a wooden spoon, until softened but not browned, about 2 minutes.\nIncrease heat to medium and add tomatoes, basil sprigs, red pepper flakes, and 1½ tsp. salt. Cook, stirring to coat, until some of the tomatoes begin to burst and release their juices, about 4 minutes. Smash some but not all of the tomatoes with the spoon to help release their liquid, then continue to cook, stirring occasionally, until a chunky, thickened sauce forms (about half the tomatoes should still be intact), 10–12 minutes. Taste and add sugar if sauce is too tart and add more salt if needed. Pluck out and discard basil sprigs.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente.\nDrain pasta, add to pot with sauce, and cook, stirring, until coated, about 1 minute. Remove from heat and stir in 1 oz. Parmesan.\nDivide pasta among bowls; drizzle with oil. Top with more Parmesan and 1 cup basil leaves.","Image":"//20fix.com/xfood/img/burst-cherry-tomato-pasta.jpg"},{"id":"256","Title":"Pasta With Broccoli and Lemon Cashew-Cream Sauce","Ingredients":{"1":"1 cup (150g or 5¼ oz) raw cashews","2":"2 cups (500ml or 17 fl oz) boiling water","3":"1 cup (250ml or 8½ fl oz) good-quality vegetable stock","4":"¼ cup (60ml or 2 fl oz) lemon juice","5":"Sea salt and cracked black pepper","6":"400g (14 oz) dried wholemeal (whole-wheat) spaghetti","7":"300g (10½ oz) broccoli florets (about 1 head)","8":"½ cup (10g or ¼ oz) small basil leaves","9":"1 tablespoon finely shredded lemon rind"},"Instructions":"To make the lemon cashew-cream sauce, place the cashews in a medium heatproof bowl and cover with the boiling water. Allow to stand for 30 minutes. Drain the cashews well and place them in a blender. Add the stock, lemon juice, salt and pepper and blend until very smooth.\nCook the pasta in a large saucepan of salted boiling water for 6 minutes. Add the broccoli and cook for a further 4 minutes or until the pasta is al dente and the broccoli is just tender. Drain the pasta and broccoli and immediately return to the warm saucepan. Add the cashew-cream sauce and toss to combine.\nDivide the pasta between serving bowls and top with the basil and lemon rind to serve.","Image":"//20fix.com/xfood/img/pasta-with-broccoli-and-lemon-cashew-cream-sauce.jpg"},{"id":"281","Title":"Spicy Baked Pasta With Cheddar and Broccoli Rabe","Ingredients":{"1":"Kosher salt","2":"1 lb. rigatoni, ziti, or fusilli","3":"8 Tbsp. extra-virgin olive oil, divided","4":"3 large leeks, white and pale green parts only, halved lengthwise, thinly sliced into half-moons","5":"Freshly ground black pepper","6":"1 tsp. (or more) crushed red pepper flakes","7":"2 bunches broccoli rabe or 3 bunches baby broccolini, trimmed, coarsely chopped","8":"1 cup heavy cream","9":"12 oz. sharp white cheddar, coarsely grated (about 3 cups), divided","10":"1 cup chopped chives, divided","11":"1 cup coarse fresh breadcrumbs or panko (Japanese breadcrumbs)"},"Instructions":"Preheat oven to 425°F. Bring a large pot of water to a boil, then add a generous amount of salt. Cook pasta, stirring occasionally to keep it from sticking together, until just barely al dente, about 2 minutes less than package directions. Drain pasta, reserving 1 cup pasta cooking liquid.\nWhile you are cooking the pasta, get the broccoli rabe going. Heat 5 Tbsp. oil in a large Dutch oven or other heavy pot over medium–high. Add leeks and season with salt and black pepper. Cook, stirring occasionally, until leeks are softened (but not so much that they don’t have any texture left) and starting to brown, 8–10 minutes.\nAdd red pepper flakes to leeks and stir to incorporate. Add broccoli rabe by the handful, stirring to combine and allowing each addition to wilt before adding more. Season with salt and black pepper. Once all of the broccoli rabe has been added, cook, stirring occasionally, until bright green and wilted, about 2 minutes. Remove pot from heat and set aside.\nAdd pasta to reserved broccoli rabe mixture along with cream, three-quarters of the cheese, ½ cup chives, and reserved pasta cooking liquid; mix well. Season with salt and black pepper and add more red pepper flakes if you prefer more heat (keep in mind that the saltiness and spiciness will increase as the pasta bakes).\nTransfer pasta to a 3-qt. baking dish (or, if your Dutch oven is ovenproof, just leave it in there). Toss breadcrumbs and remaining 3 Tbsp. oil in a medium bowl until coated; season with salt and black pepper. Scatter over pasta, then sprinkle evenly with remaining cheese. Bake until pasta is bubbling across the entire surface and breadcrumbs are deep golden brown, 30–35 minutes. Let cool slightly.\nScatter remaining chives over pasta just before serving.","Image":"//20fix.com/xfood/img/spicy-baked-pasta-with-cheddar-and-broccoli-rabe.jpg"},{"id":"286","Title":"Pasta With Brown Butter, Whole Lemon, and Parmesan","Ingredients":{"1":"1 lb. short tube pasta (such as paccheri or rigatoni)","2":"Kosher salt","3":"8 Tbsp. (1 stick) unsalted butter, cut into pieces, divided","4":"1 small regular lemon or Meyer lemon, very thinly sliced into rounds, seeds removed","5":"1 oz. Parmesan, finely grated, plus more for serving","6":"Freshly ground black pepper"},"Instructions":"Cook pasta in a large pot of boiling generously salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions (pasta will finish cooking in the sauce).\nMeanwhile, heat half of the butter in a large Dutch oven or other heavy pot over medium until melted. Add lemon slices and cook, stirring often, until softened and bottom of pot is browned in spots, 5–7 minutes. Using tongs, transfer one-third of lemon slices to a plate; set aside.\nJust before pasta is al dente, scoop out 2 cups pasta cooking liquid. Add 1½ cups pasta cooking liquid to butter sauce. (This may seem like a lot of liquid, but it will thicken once the remaining ingredients are added.) Add remaining butter a piece at a time, whisking until each piece is incorporated before adding more, until the sauce is emulsified and creamy.\nDrain pasta and add to sauce. Cook, stirring often and adding 1 oz. Parmesan a little at a time. Once all of the cheese is added, continue to cook, still stirring, until cheese is melted and sauce is creamy and clings to pasta, about 3 minutes. If sauce looks very thick, add more pasta cooking liquid 1–2 Tbsp. at a time to thin (saucier is ideal as it will thicken as it cools). Remove from heat and sprinkle with an almost ridiculous amount of pepper (about 2 tsp.); toss once more.\nServe pasta topped with reserved lemon rounds and more Parmesan.","Image":"//20fix.com/xfood/img/pasta-with-brown-butter-whole-lemon-and-parmesan.jpg"},{"id":"346","Title":"Kale Pesto With Whole Wheat Pasta","Ingredients":{"1":"1 large bunch Tuscan kale, ribs and stems removed","2":"Kosher salt","3":"12 oz. farro pasta or whole wheat pasta","4":"⅓ cup raw pistachios","5":"¼ cup extra-virgin olive oil","6":"1 garlic clove","7":"1 oz. Parmesan, finely grated, plus more for serving","8":"2 Tbsp. unsalted butter","9":"Freshly ground black pepper"},"Instructions":"Cook kale leaves in a large pot of boiling salted water until bright green and wilted, about 30 seconds. Transfer to a rimmed baking sheet with tongs; keep water boiling. Let kale cool slightly; wring out excess water with your hands.\nCook pasta in pot of boiling water, stirring occasionally, until al dente.\nBlend nuts, oil, garlic, and ⅓ cup water in a blender or food processor until very smooth. Add kale and 1 oz. Parmesan. Purée, adding water 1 Tbsp. at a time as needed, until smooth. Transfer pesto to a large bowl.\nUsing tongs, transfer pasta to bowl with pesto; add butter and ⅓ cup pasta cooking liquid. Toss, adding more pasta cooking liquid by the tablespoonful if needed, until sauce coats pasta. Divide among bowls; top with more Parmesan and a few grinds of pepper.","Image":"//20fix.com/xfood/img/kale-pesto-with-whole-wheat-pasta.jpg"},{"id":"414","Title":"Pesto Pasta Frittata","Ingredients":{"1":"8 large eggs","2":"¼ cup whole milk or cream","3":"½ cup grated Parmesan cheese","4":"Kosher salt","5":"Freshly ground black pepper","6":"1 cup (about 4 ounces) cooked pasta","7":"¼ cup pesto or Roasted Garlic–Herb Sauce, plus more for serving","8":"1 tablespoon unsalted butter"},"Instructions":"Set a rack in the upper third of the oven and preheat it to 400°F.\nIn a large bowl, whisk together the eggs, milk, Parmesan, ¾ teaspoon kosher salt, and a few grinds of black pepper.\nIn a separate bowl, toss the pasta with the pesto or herb sauce.\nMelt the butter in a 10-inch cast-iron skillet (or other nonstick oven-safe pan) over medium heat. Pour the egg mixture into the skillet, then nestle in the pasta.\nCook, undisturbed, until the frittata is set around the edges but still looks wet on the surface, about 5 minutes. Slide the frittata into the oven and bake until the top is set, about 10 minutes.\nServe the frittata warm or at room temperature, with more pesto or herb sauce on the side.","Image":"//20fix.com/xfood/img/pesto-pasta-frittata.jpg"},{"id":"429","Title":"Salad Pasta","Ingredients":{"1":"1 (2.2-oz.) can oil-packed anchovy fillets","2":"1 head of garlic, cloves separated, thinly sliced","3":"3/4 cup extra-virgin olive oil","4":"3/4 tsp. crushed red pepper flakes","5":"1 lb. penne pasta","6":"Kosher salt","7":"3 Tbsp. cold unsalted butter","8":"3 Tbsp. fresh lemon juice","9":"1 head of radicchio, trimmed, quartered, leaves separated","10":"1 (5-oz.) package baby arugula","11":"1 cup basil leaves, torn if large","12":"Freshly ground black pepper"},"Instructions":"Combine anchovies, garlic, oil, and red pepper flakes in a large skillet. Cook over medium heat, stirring often, until anchovies have disintegrated into oil and garlic is lightly browned, 6–8 minutes.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.\nRemove skillet with anchovy mixture from heat and stir in butter and lemon juice until butter is melted. Add pasta and 1/2 cup pasta cooking liquid and stir constantly until a thick glossy sauce forms, adding more pasta cooking liquid as needed.\nPlace radicchio in a large bowl. Add pasta and sauce and toss to coat, adding more pasta cooking liquid as needed. Add arugula and basil but don’t toss; season with salt and black pepper.\nDivide pasta among plates or bowls, very gently tossing so arugula gets coated in sauce but doesn’t wilt too much.","Image":"//20fix.com/xfood/img/salad-pasta.jpg"},{"id":"478","Title":"White Pesto Pasta","Ingredients":{"1":"½ cup walnuts","2":"Kosher salt","3":"½ cup fresh ricotta","4":"Zest of 1 lemon","5":"1 garlic clove, finely grated","6":"2 tsp. finely chopped oregano","7":"2 oz. Parmesan, finely grated, plus more for serving","8":"¼ cup extra-virgin olive oil","9":"Freshly ground black pepper","10":"1 lb. tube- or rod-shaped pasta (such as rigatoni or spaghetti)"},"Instructions":"Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool, then finely chop. Bring a large pot of generously salted water to a boil.\nVigorously mix walnuts, ricotta, lemon zest, garlic, oregano, and 2 oz. Parmesan in a large bowl until well combined. Add oil 1 Tbsp. or so at a time, stirring well after each addition, until all the oil is incorporated. Season pesto with salt and pepper.\nCook pasta in pot of boiling water, stirring occasionally, until al dente. Scoop 1 cup pasta cooking liquid into bowl with pesto and stir gently to combine (it’s okay if some of the pesto is still in small clumps). Using a spider, tongs, or slotted spoon, transfer pasta directly to bowl with pesto. Mix energetically until pesto thickens enough to lightly coat pasta, about 2 minutes; the pasta should have sauce clinging to it but there should also be some extra sauce that collects in bottom of bowl.\nDivide pasta among bowls and serve with more Parmesan alongside for sprinkling over.","Image":"//20fix.com/xfood/img/white-pesto-pasta.jpg"},{"id":"512","Title":"Baked Pasta Shells with Sausage and Greens","Ingredients":{"1":"¼ cup plus 1 Tbsp. extra-virgin olive oil","2":"1 lb. sweet or hot Italian sausage, casings removed","3":"6 garlic cloves, coarsely chopped","4":"1 Tbsp. finely chopped sage, plus 10 leaves for serving","5":"½ tsp. crushed red pepper flakes","6":"2 cups half-and-half","7":"12 oz. Fontina and/or aged cheddar, coarsely grated, divided","8":"1 lb. ridged medium pasta shells (such as lumaconi) or large tube pasta (such as rigatoni)","9":"1 bunch broccoli rabe, stems cut into 2\" pieces, leafy ends left long"},"Instructions":"Place racks in middle and upper third of oven; preheat to 325°F. Heat a large, deep ovenproof skillet over medium-high. Pour in ¼ cup oil; add sausage and break up into small pieces. Cook, undisturbed, until browned underneath, about 4 minutes. Stir a few times; cook, undisturbed, until cooked through, about 3 minutes.\nAdd garlic, chopped sage, and red pepper flakes to sausage and cook, stirring, until garlic is golden, about 2 minutes. Mix in half-and-half and simmer until thickened slightly, about 2 minutes. Reduce heat to low. Stirring constantly, gradually add two-thirds of the cheese a little at a time, letting it melt before adding more. Cook, stirring, until sauce is smooth and thick, about 3 minutes; season with salt. Remove from heat.\nMeanwhile, cook pasta in a pot of boiling salted water, stirring occasionally and adding broccoli rabe during the last 2 minutes, until very al dente, about 2 minutes less than package directions. Drain in a colander, shaking well. Return pasta and broccoli rabe to pot.\nAdd sausage mixture to pasta and toss to coat; transfer to skillet. Cover with foil and bake on middle rack until pasta is al dente and sauce is bubbling, 30–40 minutes. Remove from oven. Heat broiler.\nTop pasta with remaining cheese. Toss sage leaves and remaining 1 Tbsp. oil in a small bowl; arrange over pasta. Broil on upper rack until cheese is browned in spots, about 5 minutes. Let cool slightly before serving.","Image":"//20fix.com/xfood/img/baked-pasta-shells-with-sausage-and-greens.jpg"},{"id":"530","Title":"Brothy Pasta with Chickpeas","Ingredients":{"1":"3 Tbsp. extra-virgin olive oil, plus more for drizzling","2":"1 small onion, finely chopped","3":"Kosher salt","4":"3 garlic cloves, thinly sliced","5":"1 sprig rosemary","6":"¼ tsp. crushed red pepper flakes","7":"1 (15-oz.) can chickpeas, drained, rinsed","8":"1 cup whole peeled tomatoes, crushed by hand","9":"6 oz. orecchiette or other short pasta","10":"2 Tbsp. finely chopped parsley","11":"3 Tbsp. finely grated Parmesan, plus more for serving","12":"Freshly ground black pepper"},"Instructions":"Heat 3 Tbsp. oil in a large saucepan over medium. Add onion and season with salt. Cook, stirring occasionally, until onion is beginning to soften, about 5 minutes. Add garlic and cook, stirring occasionally, until onion and garlic are very tender and just beginning to brown around the edges, about 5 minutes. Add rosemary and red pepper flakes and cook, stirring, until fragrant, about 30 seconds. Add chickpeas and tomatoes and cook, stirring occasionally, until tomatoes are slightly thickened, 6–8 minutes.\nAdd pasta and 4 cups water to saucepan. Increase heat to medium-high, bring to a simmer, and cook, stirring occasionally to prevent pasta from sticking, until pasta is al dente, 13–16 minutes, depending on shape. Stir in parsley and 3 Tbsp. Parmesan; season with salt. Pluck out and discard rosemary sprig.\nLadle pasta and broth into bowls. Drizzle with more oil, season with lots of black pepper, and top with more Parmesan.","Image":"//20fix.com/xfood/img/brothy-pasta-with-chickpeas.jpg"},{"id":"562","Title":"Creamy Pasta with Crispy Mushrooms","Ingredients":{"1":"4 Tbsp. extra-virgin olive oil","2":"1 lb. mixed mushrooms (such as maitake, oyster, crimini, and/or shiitake), torn into bite-size pieces","3":"Kosher salt","4":"2 medium shallots, finely chopped","5":"1 lb. spaghetti or bucatini","6":"1/2 cup heavy cream","7":"Zest and juice of 1/2 lemon","8":"1/3 cup finely chopped parsley","9":"2 Tbsp. unsalted butter, cut into pieces","10":"1/2 oz. Parmesan, finely grated (about 1/2 cup), plus more for serving","11":"Freshly ground black pepper"},"Instructions":"Heat 2 Tbsp. oil in a large pot over medium-high. Cook half of mushrooms in a single layer, undisturbed, until edges are brown and starting to crisp, about 3 minutes. Give mushrooms a toss and continue to cook, tossing occasionally, until all sides are brown and crisp, about 5 minutes more. Using a slotted spoon, transfer mushrooms to a plate; season with salt. Repeat with remaining 2 Tbsp. oil and mushrooms and more salt.\nReduce heat to medium-low and return all of the mushrooms to the pot. Add shallots and cook, stirring often, until shallots are translucent and softened, about 2 minutes.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.\nUsing tongs, transfer pasta to pot with mushrooms and add cream and 1 cup pasta cooking liquid. Increase heat to medium, bring to a simmer, and cook, tossing constantly, until pasta is al dente and liquid is slightly thickened, about 3 minutes.\nRemove pot from heat. Add lemon zest and juice, parsley, butter, 1/2 oz. Parmesan, and lots of pepper and toss to combine. Taste and season with more salt if needed.\nDivide pasta among bowls and top with more Parmesan.","Image":"//20fix.com/xfood/img/creamy-pasta-with-crispy-mushrooms.jpg"},{"id":"604","Title":"Perfect Pesto Pasta","Ingredients":{"1":"1/2 cup pine nuts","2":"2 garlic cloves, finely grated","3":"3 oz. Parmesan, grated, plus more shaved for serving","4":"6 cups basil leaves (from about 3 bunches)","5":"3/4 cup extra-virgin olive oil","6":"1 tsp. kosher salt, plus more","7":"12 oz. dried long pasta","8":"2 Tbsp. unsalted butter, cut into pieces"},"Instructions":"Preheat oven to 350°F. Toast pine nuts on a rimmed baking sheet, tossing once, until golden brown, 5–7 minutes. Transfer to a food processor and let cool, 5–7 minutes.\nAdd garlic and grated Parmesan to food processor and pulse until finely ground, about 1 minute. Add basil and, with the motor running, add oil in a slow and steady stream; continue to process until pesto is mostly smooth with just a few flecks of green remaining, about 1 minute. Pulse in 1 tsp. salt.\nCook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1/2 cup pasta cooking liquid.\nPlace pesto and butter in a large bowl. Add pasta and 1/4 cup pasta cooking liquid. Toss vigorously with tongs, adding more pasta cooking liquid as needed, until pasta is glossy and well coated with sauce. Taste pasta and season with more salt if needed.\nDivide pasta among bowls. Top with shaved Parmesan.\nDo Ahead: Pesto can be made 1 day ahead. Pour oil over to cover by 1/4\" to prevent browning. Press plastic wrap directly against surface and chill.","Image":"//20fix.com/xfood/img/perfect-pesto-pasta.jpg"},{"id":"632","Title":"Pasta with Clams, Corn, and Basil Pesto","Ingredients":{"1":"1/2 garlic clove, finely grated","2":"1/4 cup grated Parmigiano","3":"1 cup packed fresh basil leaves (stems reserved)","4":"3 tablespoons extra-virgin olive oil","5":"Finely grated zest of 1/2 lemon","6":"Kosher salt, freshly ground pepper","7":"Kosher salt","8":"2 tablespoons unsalted butter","9":"2 tablespoons extra-virgin olive oil","10":"3 garlic cloves, thinly sliced","11":"2 small shallots, thinly sliced","12":"1/2 cup white wine","13":"24 littleneck or Manila clams, scrubbed","14":"12 ounces short tubular pasta, such as mezze rigatoni","15":"2 cups corn kernels (from 3 to 4 ears)"},"Instructions":"In a blender or food processor, combine garlic, Parmigiano, basil, and oil and blend until very smooth, scraping down sides as needed and adding a tablespoon or two of water if needed to get things moving. Add lemon zest and season with salt and pepper. Set pesto aside (you should have about 1/2 cup).\nBring a large pot of water to a boil for the pasta and season it generously with salt. In a medium Dutch oven or large cast-iron skillet, heat butter and oil over medium-high heat. When butter is foaming, add garlic, shallots, and reserved basil stems and cook until mixture is fragrant, about 2 minutes. Add wine and bring to a simmer. Add clams, toss to coat, cover, and cook, checking and stirring every few minutes, until clams begin to open, 3 to 5 minutes. As clams open, transfer them with a slotted spoon to a medium bowl, but try to keep pot covered as much as possible. Fish out basil stems and keep pan sauce warm over very low heat. (If you want a shell-free dining experience, gently liberate clams from their shells and return them to bowl with a splash or two of pasta water over them so they don’t dry out.)\nCook pasta until 1 or 2 minutes shy of al dente. Scoop 1 cup of pasta water into pan with clam sauce. Drain pasta and add to sauce along with half of the pesto. Add corn and bring mixture to a simmer. Cook, stirring, until liquid starts to thicken and pasta is al dente, about 2 minutes. Add clams and any accumulated liquid from bowl. Cook, stirring and tossing, until clams are warmed through, 2 minutes. Serve pasta and clams topped with more pesto.","Image":"//20fix.com/xfood/img/pasta-with-clams-corn-and-basil-pesto.jpg"},{"id":"741","Title":"Caramelized Onion Pasta","Ingredients":{"1":"2 Tbsp. extra-virgin olive oil","2":"2 Tbsp. unsalted butter","3":"2 lb. onions (about 3 large), thinly sliced","4":"2 garlic cloves, thinly sliced","5":"1/4 tsp. crushed red pepper flakes (optional)","6":"1 1/2 tsp. kosher salt, plus more","7":"12 oz. linguine or other long pasta","8":"4 oz. Parmesan, finely grated (about 1 cup), divided, plus more for serving","9":"½ cup parsley, finely chopped (optional), plus more for serving","10":"Freshly ground black pepper"},"Instructions":"Heat oil and butter in a large heavy pot or Dutch oven over medium until butter is melted. Add onions and garlic and cook, stirring occasionally, until very tender and deeply golden brown, about 30 minutes. (Stop before the onions become dry and shriveled.) Add red pepper flakes (if using) and 1 1/2 tsp. salt. Remove pot from heat.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Reserve 1 1/2 cups pasta cooking liquid.\nAdd pasta and 1 cup pasta cooking liquid to onion mixture and stir to combine. Add a small handful of cheese and stir until melted. Repeat with remaining cheese, adding more pasta cooking liquid as needed to create a glossy sauce that coats the pasta. Stir in parsley (if using).\nDivide pasta among bowls. Top with Parmesan, parsley, and a few cranks of pepper.","Image":"//20fix.com/xfood/img/caramelized-onion-pasta.jpg"},{"id":"837","Title":"Creamy One-Pot Pasta with Sausage and Squash","Ingredients":{"1":"3 Tbsp. extra-virgin olive oil","2":"12 oz. Italian sausage (about 3 links), casings removed","3":"1 Tbsp. all-purpose flour","4":"2 cups milk","5":"1 cup heavy cream","6":"1 1/2 cups finely grated Parmesan, divided","7":"1/2 large butternut squash (about 1 lb.), peeled, seeded, chopped into 1/2\" pieces","8":"1/2 lb. fusilli","9":"1 garlic clove, finely grated","10":"1 sprig sage","11":"2 1/2 tsp. kosher salt","12":"1/4 tsp. freshly grated nutmeg","13":"Freshly ground black pepper"},"Instructions":"Heat oil in a medium heavy pot over medium-high. Cook sausage, breaking up into about 1\" pieces with a wooden spoon, until well browned, 5–7 minutes. Add flour and cook, stirring constantly, until evenly distributed, about 1 minute.\nCombine milk, cream, and 2 cups water in a large bowl or glass measuring cup. Stirring sausage mixture constantly, slowly stream in milk mixture; bring to a simmer. Add 1 1/4 cups Parmesan and cook, stirring constantly, until cheese is melted. Add squash, pasta, garlic, sage, salt, and nutmeg and toss to combine, making sure pasta is covered with liquid. Bring to a boil, then reduce heat to low and bring to a bare simmer. Cook, stirring occasionally, until pasta is cooked through, squash is beginning to break down, and sauce is reduced and glossy, about 20 minutes.\nPluck out and discard sage. Transfer pasta to a platter. Top with remaining 1/4 cup Parmesan and a few cranks of pepper.","Image":"//20fix.com/xfood/img/creamy-one-pot-pasta-with-sausage-and-squash.jpg"},{"id":"930","Title":"Pasta with Sausage and Arugula","Ingredients":{"1":"2 small red onions, sliced into 1/2\"-thick wedges","2":"1 fennel bulb, sliced into 1/2\"-thick wedges","3":"6 Tbsp. extra-virgin olive oil, divided","4":"Kosher salt, freshly ground pepper","5":"8 oz. hot or sweet Italian sausage (about 2 links), casings removed","6":"10 oz. gemelli, casarecce, or other medium pasta","7":"1 tsp. finely grated lemon zest","8":"2 Tbsp. fresh lemon juice","9":"6 cups baby arugula","10":"Finely grated Parmesan (for serving)"},"Instructions":"Preheat oven to 425°F. Toss onions, fennel, and 2 Tbsp. oil on a rimmed baking sheet; season with salt and pepper. Spread out into a single layer. Pinch sausage into small pieces and scatter around onions and fennel. Roast until vegetables and sausage are cooked through and well browned, 25–30 minutes.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain, reserving 1 cup pasta cooking liquid.\nCombine vegetables, sausage, and pasta in a large bowl. Add lemon zest, lemon juice, remaining 4 Tbsp. oil, and 1/4 cup reserved pasta cooking liquid and toss to coat, adding more pasta cooking liquid if needed, until sauce comes together and coats pasta. Toss in arugula.\nDivide pasta among plates and top with Parmesan. Season with more salt and pepper.","Image":"//20fix.com/xfood/img/pasta-with-sausage-and-arugula.jpg"},{"id":"981","Title":"Herby Pasta with Garlic and Green Olives","Ingredients":{"1":"12 oz. pappardelle or other wide noodle","2":"Kosher salt","3":"1/4 cup extra-virgin olive oil, plus more for drizzling","4":"8 garlic cloves, smashed","5":"1 cup finely chopped parsley","6":"1 cup pitted Castelvetrano olives","7":"1/4 tsp. crushed red pepper flakes","8":"3 Tbsp. unsalted butter, cut into pieces","9":"1 cup basil leaves","10":"2 tsp. fresh lemon juice"},"Instructions":"Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 2 minutes less than package directions.\nMeanwhile, heat 1/4 cup oil in a large Dutch oven or other heavy pot over medium. Add garlic and cook, stirring often and pressing down on cloves so they make good contact with the bottom of the pot, until golden and soft, about 5 minutes. Add parsley and cook, stirring occasionally, until parsley releases some of its liquid and slightly darkens in color, about 5 minutes. Toss in olives and red pepper flakes and cook another minute to let the flavors meld.\nUsing tongs, transfer pasta to pot with sauce and add butter and 1/2 cup pasta cooking liquid. Cook, tossing and adding more pasta liquid as needed, until each strand of pasta is coated and pasta is al dente, about 4 minutes. Remove pasta from heat and toss in basil, lemon zest, and lemon juice. Taste and season with salt as needed.\nDivide pasta among bowls and drizzle with more oil.","Image":"//20fix.com/xfood/img/herby-pasta-with-garlic-and-green-olives.jpg"},{"id":"984","Title":"Baked Pasta alla Norma","Ingredients":{"1":"1 medium globe eggplant, peeled, cut into 1/2\" pieces","2":"2 pints cherry tomatoes","3":"8 garlic cloves, smashed","4":"1/4 cup extra-virgin olive oil, plus more for skillet","5":"1/2 tsp. crushed red pepper flakes, plus more for sprinkling","6":"Kosher salt","7":"2 large eggs","8":"2 Tbsp. tomato paste","9":"4 oz. finely grated Parmesan, divided","10":"1 lb. spaghetti","11":"2 Tbsp. drained capers","12":"1/2 cup torn basil, plus a few whole leaves"},"Instructions":"Preheat oven to 425°F. Combine eggplant, tomatoes, garlic, 1/4 cup oil, and 1/2 tsp. red pepper flakes in a large ovenproof skillet, preferably cast iron. Season generously with salt and toss to combine. Roast, shaking skillet once or twice, until eggplant is tender and tomatoes burst, 25–35 minutes. Let vegetables cool while you prepare the pasta (watch out for the hot handle when you take the skillet out of the oven). Reduce oven temperature to 400°F.\nWhisk eggs and tomato paste in a medium bowl until smooth, then whisk in about three-quarters of Parmesan.\nCook spaghetti in a pot of boiling salted water, stirring occasionally, until al dente. Immediately drain pasta in a colander and shake to remove excess water; transfer pasta back to pot.\nAdd cooled vegetable mixture to pot with pasta. Wipe out skillet and drizzle in a little oil; roll around in skillet to coat. Add egg mixture to pasta and toss vigorously with tongs until pasta is evenly coated. Add capers and 1/2 cup basil and toss again to combine.\nTransfer pasta mixture to skillet and press gently into an even layer. Top with remaining Parmesan, a few whole basil leaves, and an extra sprinkle of red pepper flakes.\nBake pasta until surface is nicely browned, 30–35 minutes. Let cool 10 minutes before cutting into wedges for serving.","Image":"//20fix.com/xfood/img/baked-pasta-alla-norma.jpg"},{"id":"1124","Title":"Grilled Ratatouille Pasta Salad","Ingredients":{"1":"2 medium zucchini (about 1 1/2 lb.), halved lengthwise","2":"1 medium or 2 small eggplants (about 1 lb.), cut into 1\" wedges","3":"3/4 cup extra-virgin olive oil, divided","4":"2 1/2 tsp. kosher salt, divided","5":"1 tsp. freshly ground black pepper, divided","6":"10 oz. penne or casarecce pasta","7":"1 large or 2 medium heirloom or beefsteak tomato (about 1 lb.), cut into 1\" pieces","8":"8 oz. Ciliegini (mini fresh mozzarella balls), drained, halved","9":"2 Tbsp. white balsamic or white wine vinegar","10":"1 Tbsp. thyme leaves","11":"1 cup basil leaves"},"Instructions":"Prepare a grill for medium heat. Toss zucchini, eggplant, and 1/4 cup oil on a rimmed baking sheet; season with 1 tsp. salt and 1/2 tsp. pepper. Grill, turning often, until steamy, tender, and charred all over, 8–12 minutes. Return to baking sheet and let cool.\nCook pasta according to package directions.\nSlice grilled vegetables into bite-size pieces and transfer to a large bowl. Add tomato, cheese, vinegar, thyme, and 1 1/2 tsp. salt, 1/2 tsp. pepper, and 1/2 cup oil and mix to combine. Drain pasta and immediately add to bowl with vegetables. Mix well to combine, then top with basil.\nDo Ahead: Vegetables can be grilled 3 days ahead. Transfer (whole) to an airtight container and chill.","Image":"//20fix.com/xfood/img/grilled-ratatouille-pasta-salad.jpg"},{"id":"1165","Title":"Romesco Pasta Salad with Basil and Parmesan","Ingredients":{"1":"1 cup raw walnuts","2":"3 oz. country-style bread, crust removed, cut into 1\" pieces (about 1 1/2 cups)","3":"4 whole roasted red peppers from a jar","4":"Zest and juice of 1 lemon","5":"2 garlic cloves","6":"1 tsp. crushed red pepper flakes, divided","7":"1/2 cup plus 2 Tbsp. extra-virgin olive oil","8":"Kosher salt","9":"1 lb. fusilli giganti (large spiral-shaped pasta) or medium shell pasta","10":"1 lb. mixed ripe tomatoes, cut into bite-size pieces (about 3 cups)","11":"4 oz. Parmesan, finely chopped","12":"1 cup basil leaves, torn if large"},"Instructions":"Preheat oven to 350°F. Toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 10–12 minutes. Let cool.\nMeanwhile, process bread in long pulses in a food processor until coarse crumbs form (you should have about 1 cup). Transfer to a small bowl.\nPurée roasted red peppers, lemon juice, garlic, 1/2 tsp. red pepper flakes, and about one-quarter of the cooled walnuts in food processor (no need to clean) until smooth. With the motor running, very gradually stream in 1/2 cup oil. Process until thick; season romesco dressing generously with salt.\nCook pasta in a large pot of boiling salted water, stirring occasionally, until al dente. Drain and rinse under cold water (this stops cooking and removes surface starch so the pasta will be less gummy). Shake off excess water and transfer to a large bowl. Toss pasta with half of the romesco to coat; set aside. Finely chop remaining walnuts; set aside.\nHeat remaining 2 Tbsp. oil in a medium saucepan over medium and cook breadcrumbs, lemon zest, and remaining ½ tsp. red pepper flakes, stirring often, until breadcrumbs are golden, 5–7 minutes. Remove from heat.\nToss reserved pasta with remaining dressing, then fold in tomatoes, Parmesan, and reserved walnuts just to distribute. Sprinkle breadcrumb mixture over pasta and top with basil.","Image":"//20fix.com/xfood/img/romesco-pasta-salad-with-basil-and-parmesan.jpg"},{"id":"1270","Title":"One-Pot Spring Pasta with Smoked Salmon","Ingredients":{"1":"12 oz. linguine or other long pasta","2":"3/4 tsp. kosher salt, plus more","3":"1 bunch asparagus (about 1 lb.), trimmed, cut into 1\"–1½\" pieces","4":"1 (10-oz.) bag frozen peas","5":"4 Tbsp. cold unsalted butter, cubed","6":"1 Tbsp. finely grated lemon zest","7":"3 Tbsp. fresh lemon juice","8":"1 cup sour cream, divided","9":"1 1/2 tsp. freshly ground pepper, plus more","10":"6 oz. smoked salmon, sliced into ½\" strips","11":"1 cup basil leaves"},"Instructions":"Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, 7 minutes (or 2 minutes less than package instructions). Add asparagus and continue to cook, stirring, 1 minute. Add peas and continue to cook until cooked through, about 1 minute more. Drain pasta, asparagus, and peas together, reserving 1/2 cup pasta cooking liquid.\nTransfer pasta and vegetables to a large bowl. Add butter, lemon zest, lemon juice, 1/2 cup sour cream, 1 1/2 tsp. pepper, and remaining 3/4 tsp. salt. Toss, adding reserved pasta cooking liquid bit by bit as needed, until a smooth sauce coats pasta (you might not need all the liquid).\nDivide pasta among bowls. Top with salmon, basil, and remaining 1/2 cup sour cream. Season with lots of pepper.","Image":"//20fix.com/xfood/img/one-pot-spring-pasta-with-smoked-salmon.jpg"},{"id":"1297","Title":"Pantry Pasta with Garlic, Anchovies, and Parmesan","Ingredients":{"1":"12 oz. spaghetti or other long pasta","2":"Kosher salt","3":"4 garlic cloves, thinly sliced","4":"1/4 cup extra-virgin olive oil, plus more for drizzling","5":"3 oil-packed anchovy fillets (optional)","6":"1/4 tsp. crushed red pepper flakes","7":"1 cup finely grated Parmesan, plus more for serving","8":"4 Tbsp. unsalted butter, cut into pieces","9":"Freshly ground black pepper","10":"1/3 cup finely chopped parsley","11":"1 tsp. finely grated lemon zest","12":"1 Tbsp. fresh lemon juice"},"Instructions":"Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente, about 3 minutes less than package directions.\nMeanwhile, cook garlic and 1/4 cup oil in a large heavy pot over medium heat, stirring occasionally, until garlic is golden, about 4 minutes. Add anchovies (if using) and red pepper flakes and cook, smashing anchovies with a wooden spoon to break them up, until anchovies begin to dissolve, about 1 minute.\nAdd 1 1/4 cups pasta cooking liquid along with 1 cup Parmesan to pot with anchovies and garlic and cook, stirring, until cheese is melted, about 1 minute. Using tongs, add pasta to pot, then add butter and lots of black pepper. Cook, tossing energetically and adding more cooking liquid if needed, until pasta is al dente and sauce is thickened and coats pasta, about 4 minutes. Remove from heat; add parsley, lemon zest, and lemon juice.\nDivide pasta among bowls; drizzle with oil and top with more Parmesan.","Image":"//20fix.com/xfood/img/pantry-pasta-with-garlic-anchovies-and-parmesan.jpg"}],"t":157,"p":{"limitstart":0,"limit":25,"total":157,"pagesStart":1,"pagesStop":7,"pagesCurrent":1,"pagesTotal":7}}}