{"ingredient":"Savoy cabbage","recipes":{"s":1,"d":[{"id":"2562","Title":"Seared Savoy Cabbage with Mixed Sausages","Ingredients":{"1":"Kosher salt","2":"1 (1 1/2-pound) head savoy cabbage, cut into 8 wedges with some core attached","3":"1 cup (1\") crustless bread cubes', \"1 teaspoon mustard powder (such as Colman's)\", '8 tablespoons olive oil, divided","4":"1 tablespoon Dijon mustard","5":"1 tablespoon white wine vinegar","6":"Freshly ground black pepper","7":"2 pounds mixed sausages (such as sweet Italian, kielbasa, and smoked garlic)","8":"1 tablespoon chopped fresh tarragon"},"Instructions":"Bring a large pot of water to a boil over high heat. Season heavily with salt. Cook cabbage wedges until crisp-tender but not falling apart, about 5 minutes. Transfer to a paper towel-lined baking sheet. Pulse bread cubes in a food processor until coarse crumbs form; transfer to a medium bowl. Add mustard powder and stir to coat.\nHeat 3 tablespoons oil in a small skillet over medium heat. Add breadcrumbs; stir frequently until golden, 4-5 minutes. Season with salt and transfer to a paper towel-lined plate to cool.\nWhisk 3 tablespoons oil, Dijon mustard, vinegar, and 1 tablespoon water in a small bowl. Season mustard vinaigrette with salt and pepper.\nHeat 1 tablespoon oil in a large cast-iron or nonstick skillet over high heat until smoking. Working in 2 batches and adding remaining 1 tablespoon oil between batches, sear cabbage wedges until dark and crispy edges form on both cut sides, 3-4 minutes per side.\nCook sausages in a large skillet over medium heat until browned and cooked through (time will vary depending on variety and whether fresh or fully cooked).\nTransfer cabbage to a platter; arrange sausages around. Scatter breadcrumbs and tarragon over. Serve mustard vinaigrette on the side.","Image":"//20fix.com/xfood/img/seared-savoy-cabbage-with-mixed-sausages-51122440.jpg"},{"id":"2785","Title":"Savoy Cabbage Wedges with Buttermilk Dressing","Ingredients":{"1":"1 small head of savoy or Napa cabbage, cut through root end into 6 wedges","2":"2 tablespoons olive oil","3":"Kosher salt","4":"2 jalapeños","5":"1/2 cup buttermilk","6":"1/3 cup plain whole-fat Greek yogurt","7":"1/4 cup mayonnaise","8":"1 teaspoon finely grated lemon zest","9":"2 tablespoons fresh lemon juice","10":"1 tablespoon thinly sliced chives, plus more for serving","11":"Freshly ground black pepper","12":"1/3 cup crumbled blue cheese"},"Instructions":"Place cabbage wedges on a rimmed baking sheet and drizzle with oil, getting between layers as much as possible. Season generously with salt. Let sit at least 1 hour and up to 12 hours.\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Grill jalapeños over direct heat, turning occasionally, until blistered and beginning to soften, about 5 minutes. Let cool slightly, then chop. Transfer to a medium bowl and add buttermilk, yogurt, mayonnaise, lemon zest and juice, and 1 Tbsp. chives. Mix well; season dressing with salt and pepper.\nGrill cabbage, starting over direct heat, then moving to indirect and covering grill if needed to prevent scorching, until crisp-tender, 15–20 minutes.\nServe topped with dressing, blue cheese, and more chives.\nDressing can be made 1 day ahead. Cover and chill.","Image":"//20fix.com/xfood/img/savoy-cabbage-wedges-with-buttermilk-dressing.jpg"},{"id":"3609","Title":"Chicken Cutlet Sandwiches with Savoy Cabbage Slaw","Ingredients":{"1":"1/4 red onion, thinly sliced","2":"Kosher salt","3":"1/4 head of savoy cabbage, cored, thinly sliced","4":"3 tablespoons white wine vinegar","5":"4 tablespoons (or more) olive oil, divided","6":"Freshly ground black pepper","7":"4 skinless, boneless chicken thighs","8":"1/4 cup cornstarch","9":"2 large eggs","10":"2 tablespoons Dijon mustard","11":"1 teaspoon cayenne pepper","12":"2 cups panko (Japanese breadcrumbs)","13":"1/3 cup mayonnaise","14":"8 slices white Pullman bread, toasted"},"Instructions":"Toss red onion and a pinch of salt in a small bowl to coat; let sit 5 minutes to allow onion to soften slightly. Rinse under running water, then shake off excess water. Place onion in a medium bowl and add cabbage, vinegar, and 2 tablespoons oil. Toss to combine and season slaw with salt and pepper.\nPound chicken thighs with a meat mallet or a rolling pin between 2 pieces of plastic wrap to 1/4\" thick. Place cornstarch in a shallow bowl. Whisk eggs, mustard, and cayenne in another shallow bowl.\nPlace panko in a third shallow bowl. Working with 2 thighs at a time, season chicken with salt and pepper. Dredge in cornstarch, shaking off excess. Dip in egg mixture, letting excess drip back into bowl, then coat in panko, shaking off excess.\nHeat remaining 2 tablespoons oil in a large skillet over medium-high. Working in batches and adding more oil to skillet between batches if needed, cook chicken thighs until golden brown and cooked through, about 2 minutes per side. Transfer to paper towels to drain.\nSpread mayo over one side of bread slices and build sandwiches with cutlets and slaw.\nSlaw can be made 1 day ahead. Cover and chill.","Image":"//20fix.com/xfood/img/chicken-cutlet-sandwiches-with-savoy-cabbage-slaw-56389858.jpg"},{"id":"3996","Title":"Reginetti with Savoy Cabbage and Pancetta","Ingredients":{"1":"12 ounces reginetti or other short pasta","2":"Kosher salt","3":"2 tablespoons olive oil","4":"6 ounces thinly sliced pancetta (Italian bacon)","5":"1 small head of savoy cabbage, tough ribs removed, leaves torn","6":"1/4 cup (1/2 stick) unsalted butter, cut into pieces","7":"2 teaspoons fresh thyme leaves","8":"1/2 ounce Parmesan, finely grated (about 1/2 cup)","9":"Freshly ground black pepper","10":"Poppy seeds (for serving)"},"Instructions":"Cook pasta in a large pot of boiling salted water, stirring occasionally, until very al dente (pasta will still be opaque and very firm in the center). Drain pasta, reserving 1 1/2 cups pasta cooking liquid.\nMeanwhile, heat oil in a large skillet over medium and cook pancetta, turning halfway through, until brown and crisp, about 4 minutes. Drain on paper towels.\nAdd cabbage to skillet and cook undisturbed until deeply browned in some spots, about 3 minutes. Toss, then cook undisturbed until deeply browned in other spots, about 2 minutes. Continue to cook and toss until cabbage is charred in some spots and bright green in others and beginning to wilt. Add butter and thyme and cook, tossing, until butter begins to brown, about 2 minutes. Add Parmesan, pasta, and 1 cup pasta cooking liquid and cook, tossing often and adding more cooking liquid to help finish cooking pasta, until pasta is al dente and sauce is thickened and emulsified and coats pasta, about 5 minutes. Add pancetta and toss to combine; taste and season with salt and pepper. Serve topped with poppy seeds.","Image":"//20fix.com/xfood/img/reginetti-with-savoy-cabbage-and-pancetta-51264250.jpg"},{"id":"5753","Title":"Savoy Cabbage Chips","Ingredients":{"1":"1 savoy cabbage, cored, leaves separated, small leaves reserved for another use","2":"Kosher salt"},"Instructions":"Place oven racks in upper and lower thirds of oven; preheat to 200°F. Working in several batches, cook cabbage leaves in a large pot of boiling salted water just until translucent and bright green, about 2 minutes per batch. Using a large slotted spoon, immediately transfer leaves to a large bowl of ice water; let cool. Drain cabbage leaves well and dry thoroughly.\nSet a wire rack inside each of 2 large rimmed baking sheets. Arrange cabbage leaves on racks in a single layer. Bake until completely dry and crisp, about 3 hours. Season with salt. DO AHEAD: Cabbage chips can be made 8 hours ahead. Store chips at room temperature loosely layered between parchment paper or paper towels.","Image":"//20fix.com/xfood/img/savoy-cabbage-chips-51143900.jpg"},{"id":"7980","Title":"Sautéed Savoy Cabbage with Scallions and Garlic","Ingredients":{"1":"1 bunch scallions","2":"2 garlic cloves, chopped","3":"3 tablespoons olive oil","4":"1 pound Savoy cabbage, cored and thinly sliced (8 cups)","5":"1/4 cup water"},"Instructions":"Chop scallions, reserving white and dark green parts separately.\nCook scallion whites and garlic in oil in a 12-inch heavy skillet over medium-high heat, stirring occasionally, until garlic is pale golden, about 3 minutes. Stir in cabbage, 3/4 teaspoon salt, and 1/4 teaspoon pepper and sauté 1 minute. Add water and cook, tightly covered, until cabbage is wilted, about 3 minutes. Add scallion greens and cook, uncovered, stirring, until most of water has evaporated and cabbage is tender, about 2 minutes. Season with salt and pepper.","Image":"//20fix.com/xfood/img/sauteed-savoy-cabbage-with-scallions-and-garlic-357729.jpg"},{"id":"11363","Title":"Savoy Cabbage and Radicchio Slaw with Blood Orange Dressing","Ingredients":{"1":"6 tablespoons fresh blood orange juice","2":"1 1/2 teaspoons rice vinegar","3":"1 teaspoon honey","4":"1/4 cup olive oil","5":"1/4 cup mayonnaise","6":"1 1/2 tablespoons chopped shallot","7":"1 1 1/4-pound savoy cabbage, halved, sliced 1/4 inch thick","8":"1 1/2-pound head of radicchio, halved, sliced 1/4 inch thick","9":"1 large red bell pepper, sliced","10":"1/2 cup dried cranberries"},"Instructions":"Whisk juice, vinegar, and honey in bowl. Whisk in oil, then mayonnaise and shallot. Season with salt and pepper. Pour into jar with lid; chill 2 hours. DO AHEAD Can be made 1 day ahead. Keep chilled.\nPlace cabbage, radicchio, and bell pepper in large bowl. Just before serving, shake dressing well and pour over vegetables; toss. Season with salt and pepper. Sprinkle dried cranberries over.","Image":"//20fix.com/xfood/img/savoy-cabbage-and-radicchio-slaw-with-blood-orange-dressing-236484.jpg"},{"id":"11579","Title":"Pasta with Confit Duck and Savoy Cabbage","Ingredients":{"1":"1/2 teaspoon vegetable oil","2":"3 (6- to 8-oz) confit duck legs","3":"2 large onions, halved lengthwise, then sliced (1/4 inch thick; 4 cups)","4":"1 teaspoon salt","5":"1 (1 1/2-lb) piece Savoy cabbage, cored and cut into 2-inch pieces (8 cups)","6":"1/4 cup dry white wine","7":"1 1/2 cups reduced-sodium chicken broth (12 fl oz)","8":"1 lb dried campanelle (bell-shaped pasta) or garganelli","9":"1 tablespoon unsalted butter","10":"2 tablespoons chopped fresh flat-leaf parsley","11":"1/2 teaspoon black pepper"},"Instructions":"Heat oil in a 12-inch heavy skillet over moderate heat until hot but not smoking, then sear duck legs, starting skin sides down and turning over once, until skin is golden and some of fat is rendered, 6 to 8 minutes total. Transfer to a cutting board, reserving skillet. When duck legs are cool enough to handle, remove skin and scrape off and reserve any visible fat, then cut skin into roughly 1/4-inch pieces. Return skin and fat to skillet and cook over moderate heat, stirring occasionally and pressing down on larger pieces, until fat is rendered and cracklings are golden and crisp, about 5 minutes. Transfer cracklings with a slotted spoon to paper towels to drain.\nWhile cracklings cook, pull duck meat from legs into roughly 1/4-inch-thick strips, discarding bones and any gristle.\nReserve 2 tablespoons fat in skillet, discarding remainder, then cook onions with 1/2 teaspoon salt over moderate heat, stirring occasionally, until golden brown, 15 to 20 minutes. Add cabbage and 1/2 teaspoon salt and cook, stirring and turning occasionally with tongs, until cabbage is slightly wilted, about 5 minutes. Add wine and cook, stirring, until evaporated, about 2 minutes. Add chicken broth and simmer, covered, stirring occasionally, until cabbage is very tender, 25 to 30 minutes.\nWhile cabbage simmers, cook pasta in a 6- to 8-quart pot of boiling salted water until al dente. Reserve 1 cup pasta-cooking water, then drain pasta in a colander.\nTransfer cabbage mixture to pasta pot along with butter and shredded duck and cook over moderate heat, stirring, until butter is melted and duck is heated through. Stir in pasta, parsley, and pepper until combined. (If pasta looks dry, stir in some of cooking water.) Season with salt and serve cracklings on the side (for sprinkling over pasta).","Image":"//20fix.com/xfood/img/pasta-with-confit-duck-and-savoy-cabbage-235749.jpg"}],"t":8,"p":{"limitstart":0,"limit":25,"total":8,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}