{"ingredient":"Nougat","recipes":{"s":1,"d":[{"id":"2539","Title":"Giant Chocolate Candy Bar with Peanuts and Nougat","Ingredients":{"1":"Nonstick vegetable oil spray","2":"1 1/4 cups sugar","3":"2/3 cup heavy cream","4":"2 tablespoons unsalted butter', \"1 3/4 cups unsalted, dry-roasted peanuts (see Cooks' Note)\", '3/4 teaspoon fine sea salt","5":"2 large egg whites","6":"1 3/4 cups sugar","7":"1/2 cup creamy peanut butter, room temperature","8":"1/2 teaspoon fine sea salt","9":"12 ounces milk, semisweet, and/or bittersweet chocolate (preferably 40–60% cacao), chopped","10":"1 tablespoon coconut or other neutral vegetable oil","11":"A 9x5\" loaf pan; a candy thermometer; a stand mixer"},"Instructions":"Line bottom and sides of loaf pan with foil, leaving an overhang on all sides. Lightly coat foil with nonstick spray.\nGently stir sugar and 1/4 cup water in a large saucepan. Heat over medium and cook, brushing down sides of pan with a wet pastry brush if needed and swirling pan gently (do not stir), until sugar is amber-brown, 15–20 minutes. Remove from heat.\nCarefully add cream in a steady stream, stirring with a silicone spatula (it will bubble up violently); if it looks like it may boil over, stop adding cream and stir to break up bubbles. Stir in butter until melted and smooth.\nFit saucepan with candy thermometer and heat over medium. Cook, undisturbed, until mixture reaches 245°F (almost firm-ball stage). Immediately add peanuts and salt and carefully stir to combine. Quickly transfer peanut mixture to prepared pan and press into an even layer with a spatula. Let sit at room temperature until set, at least 1 hour and up to overnight.\nBeat egg whites in a stand mixer fitted with the whisk attachment on medium speed until soft peaks form. Meanwhile, fit a small saucepan with candy thermometer. Pour 1/2 cup water into saucepan, add sugar, and gently stir to combine. Heat over medium and cook, stirring, until sugar dissolves. Bring to a boil and continue to cook, brushing down sides of pan with a wet pastry brush if needed and swirling pan gently (do not stir), until mixture reaches 255°F. Return mixer speed to medium, then add sugar mixture in a slow, steady stream to egg whites down side of bowl.\nIncrease mixer speed to medium-high and continue to beat until bowl feels warm to the touch and mixture is thick, tacky, and opaque white, about 8 minutes. Add peanut butter and salt and fold gently with a spatula until incorporated.\nScoop peanut butter mixture onto peanut caramel; gently press into an even layer. Let sit at room temperature until set, at least 1 hour and up to overnight.\nHeat chocolate in a heatproof bowl set over a saucepan of barely simmering water (bowl should not touch water), stirring, until melted. Remove from heat and, stirring constantly, add oil. Let cool, stirring occasionally, until chocolate firms slightly, about 10 minutes.\nPour one-third of chocolate mixture over nougat; reserve remaining chocolate mixture at room temperature. Chill until set, at least 20 minutes.\nCut a piece of parchment roughly the same size as top of loaf pan; press over set chocolate. Place a wire rack over pan. Holding pan and rack together, invert quickly. Remove pan, then peel off parchment. Set rack inside a rimmed baking sheet lined with waxed paper.\nSlowly pour reserved chocolate mixture over loaf; coat tops completely and let run down sides (use an offset spatula to coat sides completely if needed), pouring a little extra down center of bar. If you run out of chocolate mixture, carefully lift rack off pan, then remove waxed paper with chocolate drippings. Return rack to pan and pour chocolate drippings over. Chill until firm, about 45 minutes.\nLet sit at room temperature 10 minutes, then cut crosswise into 16–20 slices.\nBar can be made 3 days ahead; loosely cover and chill.","Image":"//20fix.com/xfood/img/giant-chocolate-candy-bar-with-peanuts-and-nougat.jpg"},{"id":"4771","Title":"Almond-Pistachio Nougatine","Ingredients":{"1":"3/4 cup sugar","2":"1/3 cup light corn syrup","3":"3/4 cup plus 2 tbsp sliced almonds","4":"1/3 cup chopped pistachios","5":"2 tbsp unsalted butter"},"Instructions":"Put the sugar and corn syrup in a medium saucepan and make a light caramel: Place saucepan over medium heat. The sugar will melt and start to caramelize. When the mixture is pale brown, add the almonds, pistachios, and butter. Mix well to coat the nuts in the caramel and toast them lightly.\nWorking quickly, turn the mixture out onto a sheet of parchment paper or onto a silicone mat. Place a second sheet or mat on top, then roll out the nougatine very thinly with a rolling pin. To finish, cut out the desired shapes using a knife or a pair of scissors. If the nougatine hardens too much to cut, reheat it in a 275°F oven for 4 to 5 minutes to soften it a little. (Store in an airtight container, away from moisture, for up to 1 month.)","Image":"//20fix.com/xfood/img/almond-pistachio-nougatine-51228610.jpg"},{"id":"5540","Title":"Soft Vanilla Nougat","Ingredients":{"1":"3 cups/355 g ice","2":"3 egg whites","3":"1 cup/200 g sugar","4":"1/2 cup/120 ml corn syrup","5":"1/4 cup/60 ml water","6":"2 vanilla beans, scraped and seeded or 1 tablespoon vanilla extract","7":"1/2 teaspoon salt"},"Instructions":"1 Put the ice in a medium bowl and set aside.\n2 Put the egg whites in the bowl of an electric mixer fitted with the whisk attachment and set aside.\n3 Stir together the sugar, corn syrup, and water in a medium saucepan. Bring to a boil over medium heat and continue to boil without stirring until the mixture reaches 235°F/114°C on a candy thermometer, about 6 minutes.\n4 Begin whipping the egg whites on low speed for about 1 minute, just until they are a little frothy. Continue cooking the sugar syrup until it reaches 245°F/118°C. (If your temperature goes higher, shock the syrup by setting the pan in the bowl of ice.) Pour a splash of the syrup into the egg whites, aiming for the space between the rim of the bowl and the whisk attachment. Continue whisking as you slowly add the rest of the hot sugar syrup. Increase the mixer speed to medium and whip until the nougat reaches a full, frothy foam, about 2 minutes.\n5 Add the vanilla seeds and salt to the nougat. Keep whipping until it forms stiff peaks, about 3 minutes more. Allow to cool in the bowl. Once it is at room temperature, it's ready to use in candy-bar production.","Image":"//20fix.com/xfood/img/soft-vanilla-nougat-51161620.jpg"},{"id":"6647","Title":"Cherry-Pistachio Nougat","Ingredients":{"1":"Nonstick vegetable oil spray","2":"1 cup natural unsalted pistachios","3":"1 1/3 cups sugar","4":"1/2 cup honey","5":"1 large egg white, room temperature","6":"Pinch of kosher salt","7":"3/4 cup dried cherries","8":"2 8x11\" sheets of edible rice paper, trimmed to 8x8\" (wafer paper)","9":"Ingredient info: Edible rice paper, a.k.a. wafer paper, can be found at baking supply stores and beryls.com.","10":"An 8x8\" baking pan; a candy thermometer"},"Instructions":"Preheat oven to 325°F. Lightly coat baking pan with nonstick spray. Line with plastic wrap, leaving a 1\" overhang on all sides. Set aside.\nSpread out pistachios on a rimmed baking sheet and bake, stirring once, until just beginning to turn light golden brown in spots, about 10 minutes. Let cool. Coarsely chop and set aside.\nCombine sugar, honey, and 2 tablespoons water in a small deep heavy saucepan. Stir over medium heat until sugar dissolves. Attach a candy thermometer to the side of pan. Increase heat and boil until thermometer registers 252°F, about 3 minutes.\nMeanwhile, beat egg white and salt in a stand mixer fitted with a whisk attachment until soft peaks form.\nWith mixer running, gradually stream hot syrup into egg whites. Beat until meringue is thick, has tripled in volume, and has cooled slightly, 10-12 minutes. Remove the bowl from the mixer and add cherries and pistachios to meringue; mix nougat with a rubber spatula to distribute evenly.\nPlace one 8x8\" sheet of rice paper (or 8x8\" sheet of parchment paper sprayed with nonstick spray) in the prepared pan. Transfer nougat to pan, spreading in an even layer. Top with second sheet of rice paper (or 8x8\" sheet of parchment paper sprayed with nonstick spray). Using an offset spatula, press the nougat into an even layer. Let stand at room temperature until set, about 2 hours.\nUsing overhang from plastic wrap, lift nougat out of pan and transfer to a work surface; discard plastic. Run a large sharp knife under hot tap water; wipe dry. Cut nougat crosswise into 4 strips, then cut each strip crosswise into 10 pieces, occasionally reheating knife under hot water and wiping dry. DO AHEAD: Can be made 1 week ahead. Store airtight at room temperature.","Image":"//20fix.com/xfood/img/cherry-pistachio-nougat-368953.jpg"},{"id":"8034","Title":"Milk Chocolate Soufflés with Nougat Whip","Ingredients":{"1":"12 ounces high-quality milk chocolate (such as Lindt, Perugina, or Valrhona), chopped","2":"1/2 cup heavy whipping cream","3":"2 large egg yolks","4":"Pinch of salt","5":"6 large egg whites, room temperature","6":"2 tablespoons sugar","7":"1 large egg white, room temperature","8":"1 1/2 tablespoons honey","9":"1/3 cup chilled heavy whipping cream","10":"1 tablespoon amaretto or other almond liqueur","11":"1/4 cup whole almonds, toasted , chopped","12":"8 3/4-cup soufflé dishes"},"Instructions":"Butter eight 3/4-cup soufflé dishes; sprinkle with sugar, tilting cups to coat completely and tapping out any excess. Arrange prepared soufflé dishes on large baking sheet.\nCombine chocolate and cream in large metal bowl. Set bowl over saucepan of barely simmering water and stir until chocolate is melted and mixture is smooth. Remove bowl from over water. Stir egg yolks and salt into chocolate mixture. Using electric mixer, beat egg whites in another large bowl until soft peaks form. Gradually add 2 tablespoons sugar, beating until semi-firm peaks form. Using rubber spatula, fold 1/4 of beaten egg whites into chocolate mixture to lighten. Fold remaining egg whites into chocolate mixture in 2 additions. Divide chocolate mixture among prepared soufflé dishes, filling dishes completely. DO AHEAD: Can be made 2 days ahead. Refrigerate uncovered until cold, then cover and keep chilled.\nUsing electric mixer, beat egg white in medium bowl until soft peaks form. Gradually add honey, beating until soft peaks form, about 3 minutes.\nCombine cream and amaretto in another medium bowl and beat until thick and soft peaks form. Fold whipped cream mixture and almonds into meringue. DO AHEAD: Can be made 2 hours ahead. Cover and chill.\nPosition rack in center of oven and preheat to 400°F. Bake soufflés on baking sheet until puffed and tops feel firm, about 16 minutes if at room temperature and about 18 minutes if chilled.\nServe soufflés immediately, passing nougat whip alongside.","Image":"//20fix.com/xfood/img/milk-chocolate-souffles-with-nougat-whip-357238.jpg"}],"t":5,"p":{"limitstart":0,"limit":25,"total":5,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}