{"ingredient":"Hot chocolate","recipes":{"s":1,"d":[{"id":"883","Title":"Luscious Hot Chocolate","Ingredients":{"1":"12 ounces semisweet chocolate (chips or chopped bars are both fine)","2":"2 quarts milk (8 cups)"},"Instructions":"1. Combine the chocolate and milk in a heavy saucepan. Place over medium heat until bubbles form, reduce the heat slightly, and simmer until the chocolate melts, whisking constantly.\n2. Before serving, raise the heat until the chocolate just boils, still whisking. Enjoy.","Image":"//20fix.com/xfood/img/luscious-hot-chocolate-351089.jpg"},{"id":"1490","Title":"Buttered Rum Hot Chocolate","Ingredients":{"1":"1/2 cup (1 stick) unsalted butter","2":"2 ounces bittersweet chocolate, chopped","3":"1/2 cup (packed) light brown sugar","4":"1 teaspoon ground cinnamon","5":"1/8 teaspoon kosher salt","6":"3/4 cup dark rum","7":"1/2 cup heavy cream","8":"Freshly grated nutmeg (for serving)"},"Instructions":"Melt butter and chocolate in a medium heatproof bowl in short bursts in the microwave, stirring after each burst, or set over a saucepan of barely simmering water (do not let water touch bowl), stirring, until smooth. Remove from heat and whisk in brown sugar, cinnamon, and salt.\nBring 2 1/2 cups water to a boil in a medium saucepan. Remove from heat and whisk in rum and chocolate mixture until combined.\nUsing an electric mixer on medium-high speed, beat cream in a medium bowl until soft peaks form.\nReheat hot chocolate, if needed, then divide among mugs. Top generously with whipped cream and nutmeg.","Image":"//20fix.com/xfood/img/buttered-rum-hot-chocolate.jpg"},{"id":"1503","Title":"Hot Chocolate Baked French Toast","Ingredients":{"1":"Unsalted butter (for pan)","2":"1 (1-pound) loaf country-style or \"peasant\" white bread, sliced 1/4\"-thick","3":"3 cups heavy cream","4":"6 ounces milk chocolate, coarsely chopped","5":"6 ounces semisweet chocolate, coarsely chopped","6":"1 tablespoon vanilla extract","7":"9 large eggs","8":"2 cups whole milk","9":"1 cup sugar","10":"1 1/4 teaspoons kosher salt","11":"1/2 cup hazelnuts, coarsely chopped"},"Instructions":"Butter a 13x9\" baking dish. Arrange bread slices in overlapping rows in dish.\nCook cream, milk chocolate, semisweet chocolate, and vanilla in a medium saucepan over medium heat, whisking constantly, until chocolate is melted, about 5 minutes; remove from heat. Transfer 1 cup chocolate mixture to an airtight container; let cool to room temperature, then cover and chill until ready to serve. Reserve remaining chocolate mixture.\nWhisk eggs, milk, sugar, and salt in a large bowl. Whisking constantly, pour in hot chocolate mixture in a slow, steady stream. Pour evenly over and between each layer of bread. Push down with your hands to soak top of bread. Cover dish tightly with foil and chill at least 2 hours.\nPreheat oven to 350°F. Bake foil-covered bread until warmed through and a knife inserted into the center feels warm to the touch, about 35 minutes. Remove foil and continue baking until bread is browned, 35–40 minutes longer. Let cool 10 minutes.\nMeanwhile, toast hazelnuts in a small skillet over medium heat, tossing occasionally, until golden-brown and fragrant, 3–5 minutes. Microwave 1 cup reserved chocolate mixture in a microwave-safe bowl in 10-second intervals (or heat in a heatproof bowl set over a saucepan of simmering water), stirring occasionally, until warmed through.\nServe French toast with hot chocolate sauce and toasted hazelnuts.\nFrench toast can be assembled 1 day ahead before baking; cover tightly with foil and chill.","Image":"//20fix.com/xfood/img/hot-chocolate-baked-french-toast.jpg"},{"id":"2196","Title":"Cinnamon White Hot Chocolate","Ingredients":{"1":"4 (3\") cinnamon sticks","2":"1/8 teaspoon kosher salt","3":"2 1/2 cups whole milk, divided","4":"2 teaspoons cornstarch","5":"2 ounces high-quality white chocolate, chopped or white chocolate chips (about 1/3 cup)","6":"1/2 teaspoon vanilla extract","7":"Unsweetened whipped cream and ground cinnamon (for serving)"},"Instructions":"Toast cinnamon sticks in a medium dry saucepan over medium heat until fragrant, about 1 minute. Add salt and 2 cups milk and bring to a simmer. Remove from heat and let steep 10 minutes.\nWhisk cornstarch and remaining 1/2 cup milk in a small bowl. Add to warm milk mixture and heat over medium. Bring to a simmer and cook, stirring constantly, until warmed through, about 1 minute. Remove from heat and add chocolate and vanilla. Let sit until chocolate is melted, about 30 seconds, then stir to combine. Discard cinnamon sticks.\nDivide hot chocolate between mugs. Top with whipped cream and dust with ground cinnamon.","Image":"//20fix.com/xfood/img/cinnamon-white-hot-chocolate.jpg"},{"id":"2200","Title":"Matcha White Hot Chocolate","Ingredients":{"1":"3 ounces white chocolate chips (about 1/2 cup) or white chocolate, chopped","2":"1 (13-ounce) can unsweetened coconut milk","3":"2 1/2 teaspoons matcha (green tea powder), plus more for serving","4":"Marshmallows (for serving)"},"Instructions":"Heat chocolate and coconut milk in a small saucepan over medium, stirring, until smooth and chocolate is melted. Bring to a simmer.\nMeanwhile, pour 1 cup hot water into a medium bowl or large measuring cup. Sift 2 1/2 tsp. matcha through a fine-mesh sieve into hot water, then whisk mixture until frothy. Whisk chocolate mixture into matcha. Divide between 2 mugs. Top with marshmallows and sprinkle with more matcha.\nHot chocolate can be made can be made 3 days ahead; cover and chill.","Image":"//20fix.com/xfood/img/matcha-white-hot-chocolate.jpg"},{"id":"3150","Title":"Homemade Hot Chocolate Mix","Ingredients":{"1":"3/4 cup powdered sugar","2":"1/2 cup high-quality cocoa powder","3":"3 ounces bittersweet chocolate, coarsely chopped","4":"2 teaspoons cornstarch","5":"1/8 teaspoon fine sea salt","6":"1 vanilla bean, split lengthwise","7":"1 cup whole milk","8":"Whipped cream, marshmallows, and cocoa powder (for serving)"},"Instructions":"Combine powdered sugar, cocoa powder, chocolate, cornstarch, and sea salt in a food processor. Scrape in vanilla seeds; discard pod. Blend until mixture is smooth and powdery, about 1 minute.\nBring milk to a simmer in a small saucepan over medium heat. Whisk in 3 Tbsp. hot chocolate mix and cook, whisking occasionally, until mixture returns to a simmer and hot chocolate mix is dissolved and thickens slightly, 1-2 minutes.\nTransfer hot chocolate to a mug. Top with whipped cream and marshmallows and dust with cocoa powder.\nHot chocolate mix can be made 2 months ahead. Store in an airtight container at room temperature, or freeze up to 3 months.","Image":"//20fix.com/xfood/img/homemade-hot-chocolate-mix.jpg"},{"id":"4870","Title":"Spicy Spiked Hot Chocolate","Ingredients":{"1":"2 cups whole milk","2":"1 cup heavy cream","3":"1/3 cup sugar","4":"1/2 ancho chile, lightly crushed","5":"1 cinnamon stick","6":"1/2 vanilla bean, split lengthwise","7":"3 ounces bittersweet chocolate (at least 70% cacao), chopped","8":"2 ounces Xtabentún, Pernod, or other anise-flavored liqueur"},"Instructions":"Combine milk, cream, sugar, chile, and cinnamon stick in a medium saucepan; scrape in seeds from vanilla bean and add pod. Bring to a simmer; remove from heat, cover, and let steep 15 minutes.\nRemove chile, cinnamon stick, and vanilla pod; discard. Add chocolate and heat over medium-high heat, whisking constantly, until chocolate is melted and mixture is smooth, about 5 minutes. Remove hot chocolate from heat and add liqueur. Serve hot.\nDO AHEAD: Hot chocolate (without liqueur) can be made 1 day ahead. Let cool; cover and chill. Reheat and add liqueur just before serving.","Image":"//20fix.com/xfood/img/spicy-spiked-hot-chocolate-51214750.jpg"},{"id":"5991","Title":"Ganache For Hot Chocolate and Mochas","Ingredients":{"1":"3 ounces (85 g) coarsely chopped dark chocolate","2":"1/4 cup (2 fl oz / 60 ml) boiling water"},"Instructions":"Put the chocolate in a small bowl or 2-cup glass measuring cup. Pour the boiling water over the chocolate and stir until smooth and the chocolate is melted. If you have an immersion blender, use it to fully emulsify the mixture.\nThe ganache can be stored in an airtight container in the refrigerator for up to 1 week. Reheat gently in a microwave before using.","Image":"//20fix.com/xfood/img/ganache-for-hot-chocolate-and-mochas-51119220.jpg"},{"id":"6327","Title":"XOCO Churros with Mexican Hot Chocolate","Ingredients":{"1":"1 cup sugar","2":"1 teaspoon ground cinnamon","3":"5 cups milk or water","4":"10 ounces Mexican chocolate, such as Ibarra, coarsely chopped","5":"2 tablespoons unsalted butter","6":"2 tablespoons sugar","7":"1 1/2 teaspoons kosher salt","8":"1 cup plus 2 tablespoons all-purpose flour, sifted","9":"2 large eggs","10":"1 to 2 quarts vegetable oil, for frying","11":"Blender or handheld immersion blender, pastry bag fitted with 1/2-inch star tip, deep-fat thermometer"},"Instructions":"In a small bowl, whisk together the sugar and cinnamon. DO AHEAD: The cinnamon sugar can be made ahead and stored, in an airtight container at room temperature, up to 1 month.\nIn a heavy 2-quart saucepan over moderate heat, combine the milk or water and the chocolate. Heat, stirring occasionally, until the chocolate is almost completely dissolved (there will still be small pieces of chocolate) and the mixture is steaming. Transfer to a blender or use a handheld immersion blender and process until the mixture is foamy and fully emulsified, about 30 seconds (use caution when blending hot liquids). Return the hot chocolate to the saucepan. When ready to serve, place over low heat, stirring occasionally, until warm.\nIn a medium pot over moderate heat, whisk together the butter, sugar, salt, and 1 1/4 cups water. Bring to a simmer, stirring to melt the butter. Remove the pot from the heat and add the flour, stirring vigorously to fully incorporate it into the liquid. Return the pot to moderate heat and cook the mixture, stirring constantly, until the dough is smooth and sticky, about 1 minute. Turn off the heat and remove the pot from the burner; cover with a lid or plastic wrap, and let rest for 15 minutes.\nFollowing the 15-minute resting period, add the eggs, 1 at a time, stirring with a wooden spoon until completely incorporated after each addition. Spoon the dough into a pastry bag fitted with a 1/2-inch star tip.\nLine a large baking sheet with several layers of paper towels and place the cinnamon sugar in a small shallow bowl.\nIn a heavy large pot, heat 3 inches of oil until a deep-fat thermometer registers 375°F. Working in batches (about 6 churros per batch), hold the pastry bag just above the surface of the hot oil and carefully and gently pipe 4-inch ribbons of dough directly into the oil, using a paring knife to cut the batter at the end of the star tip if necessary. Fry the churros, turning occasionally, until golden brown and cooked in the center, about 2 minutes per batch. Transfer as done to the paper-towel-lined baking sheet and return the oil to 375°F between batches. Toss the churros in cinnamon sugar and serve warm with the Mexican hot chocolate.","Image":"//20fix.com/xfood/img/xoco-churros-with-mexican-hot-chocolate-395109.jpg"},{"id":"6580","Title":"Simple Hot Chocolate for One","Ingredients":{"1":"1 cup milk or any combination of milk, half-and-half, or cream","2":"Pinch of salt","3":"2 ounces bittersweet (60% cacao) or semisweet chocolate, broken into small pieces or chopped","4":"1/4 teaspoon vanilla extract","5":"1 tablespoon unsweetened cocoa powder (optional)"},"Instructions":"Bring the liquid almost to a simmer with the salt over medium heat, then remove it from the heat and add the chocolate. Let it rest for 1 minute, then whisk the mixture until chocolate is melted and liquid is smooth. Stir in vanilla and taste it. If you want a stronger, deeper chocolate flavor, whisk in the cocoa. If necessary, reheat the liquid over medium-low heat, stirring.\nIf you like it frothy, or the cocoa powder didn't blend in smoothly, blend it in the blender.\nThis recipe multiplies easily. When you get up to a quart of milk, use 1/4 teaspoon salt.","Image":"//20fix.com/xfood/img/simple-hot-chocolate-for-one-369409.jpg"},{"id":"6610","Title":"Cold \"Hot Chocolate\" Trifle","Ingredients":{"1":"3 egg whites, at room temperature","2":"1/4 cup plus 1 tablespoon sugar, divided","3":"2 1/2 ounces unsweetened chocolate","4":"1/4 cup heavy cream","5":"6 store-bought chocolate mini meringue cookies, crushed","6":"4 tablespoons mini marshmallows"},"Instructions":"In a bowl, beat egg whites and a pinch of salt until soft peaks form. Add 1/4 cup sugar; beat until stiff peaks of meringue form. In a microwave-safe bowl, nuke chocolate in 30-second intervals, stirring after each interval, until melted; let cool slightly. Gently fold chocolate into meringue until just combined. Divide mousse evenly among four 5-ounces glasses. Rinse bowl; add cream and remaining 1 tablespoon sugar; beat until soft peaks form. Top mousse with whipped cream, crushed cookies and marshmallows. Refrigerate at least 2 hours or up to 24.","Image":"//20fix.com/xfood/img/cold-hot-chocolate-trifle-369111.jpg"},{"id":"10410","Title":"Caramelized Banana Splits with Hot Chocolate Sauce","Ingredients":{"1":"3 tablespoons unsalted butter","2":"3 firm-ripe bananas, sliced diagonally 1/2 inch thick","3":"1/2 cup packed light brown sugar","4":"1 cup heavy cream","5":"4 ounces fine-quality bittersweet chocolate (no more than 60% cacao if marked), finely chopped","6":"1 pint cinnamon or vanilla ice cream","7":"1/2 cup chopped walnuts, toasted and cooled"},"Instructions":"Melt butter in a 12-inch heavy skillet over medium heat, then add bananas in 1 layer and sprinkle with brown sugar. Increase heat to medium-high and cook bananas, gently turning once and shaking skillet occasionally, until sugar is caramelized, 3 to 4 minutes. Divide bananas among 4 bowls, leaving any remaining caramel in skillet.\nAdd cream to skillet and boil over medium heat, stirring, until caramel is dissolved. Add chocolate with a pinch of salt and whisk until melted.\nTop bananas with scoops of ice cream, then drizzle with some of chocolate sauce and sprinkle with nuts. (There will be extra sauce.)","Image":"//20fix.com/xfood/img/caramelized-banana-splits-with-hot-chocolate-sauce-240583.jpg"},{"id":"11805","Title":"Vanilla Hot Chocolate Mix","Ingredients":{"1":"4 cups granulated sugar","2":"1/2 vanilla bean, split crosswise (see tips, below)","3":"1 1/2 pounds high-quality semisweet chocolate, coarsely chopped","4":"8 ounces milk chocolate, coarsely chopped","5":"2 cups unsweetened cocoa powder, preferably Dutch process (see tips, below)"},"Instructions":"Place sugar in large bowl. Split half vanilla bean lengthwise, scrape seeds into sugar, and add pod. Work seeds in with your fingers. Cover snugly with plastic wrap and let stand overnight at room temperature.\nIn food processor fitted with metal blade, process semisweet chocolate and milk chocolate until finely ground, using 4-second pulses. (Process in two batches if necessary.)\nRemove pod from sugar. Add ground chocolate and cocoa powder to sugar and whisk to blend.\nStore mix airtight at room temperature for up to six months.\nFor each serving, heat 8 ounces milk in small saucepan over medium heat until scalded (or microwave 2 1/2 minutes at full power). Whisk in 1/4 to 1/3 cup mix. Serve with unsweetened softly whipped cream or marshmallows.","Image":"//20fix.com/xfood/img/vanilla-hot-chocolate-mix-233203.jpg"},{"id":"11871","Title":"Spiced Hot Chocolate","Ingredients":{"1":"2 cups whole milk","2":"1/2 cup golden brown sugar, packed","3":"1/2 cup whipping cream","4":"1/4 cup unsweetened cocoa powder","5":"4 oz chopped bittersweet or semisweet chocolate","6":"1/2 teaspoon ground cinnamon","7":"Garnish: whipped cream, cinnamon sticks"},"Instructions":"Whisk milk, brown sugar, and whipping cream in heavy large saucepan over medium heat until mixture begins to simmer. Reduce heat to medium-low; add cocoa powder, chocolate, and cinnamon; whisk until chocolate is melted and smooth. Pour hot chocolate into 6 demitasse cups. Garnish each with whipped cream and a cinnamon stick.","Image":"//20fix.com/xfood/img/spiced-hot-chocolate-233382.jpg"},{"id":"12850","Title":"Caramel-Swirl Hot Chocolate","Ingredients":{"1":"5 cups water","2":"5 3-ounce bars milk chocolate, chopped","3":"1/4 cup plus 1 cup chilled whipping cream","4":"1 tablespoon powdered sugar","5":"3 tablespoons prepared caramel sauce"},"Instructions":"Bring 5 cups water and chocolate to simmer in medium saucepan, stirring to dissolve chocolate. Mix in 1/4 cup cream. (Can be prepared 1 day ahead. Cover and refrigerate. Bring to simmer, stirring frequently, before continuing.)\nWhip 1 cup cream and powdered sugar in medium bowl until peaks form. Drizzle caramel over and swirl together, forming streaks (do not overmix).\nDivide hot chocolate among 6 mugs. Top with generous amount of caramel whipped cream and serve.","Image":"//20fix.com/xfood/img/caramel-swirl-hot-chocolate-231268.jpg"},{"id":"12860","Title":"Brandied Hot Chocolate","Ingredients":{"1":"2 teaspoons cornstarch","2":"1 1/2 cups whole milk","3":"1/2 cup water","4":"10 oz fine-quality bittersweet chocolate (not unsweetened), finely chopped","5":"1/2 cup heavy cream","6":"1 tablespoon unsweetened cocoa powder (optional)","7":"2 tablespoons brandy (optional), or to taste"},"Instructions":"Whisk together cornstarch and 2 tablespoons milk.\nBring water to a boil in a 2-quart heavy saucepan, then reduce heat to moderately low and add chopped chocolate and a pinch of salt, whisking until smooth.\nAdd cream and remaining milk (1 1/4 cups plus 2 tablespoons) and increase heat to moderate, then cook, whisking occasionally, until mixture is smooth and heated through. Taste; for a deeper chocolate flavor, whisk in cocoa.\nWhisk cornstarch mixture, then add half to chocolate mixture and simmer, whisking, until slightly thickened, about 2 minutes. Add brandy (if using) and remaining cornstarch mixture to thicken if desired, then simmer, whisking, 1 minute.","Image":"//20fix.com/xfood/img/brandied-hot-chocolate-231222.jpg"}],"t":16,"p":{"limitstart":0,"limit":25,"total":16,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}