{"ingredient":"Shallot","recipes":{"s":1,"d":[{"id":"310","Title":"Yogurt and Persian Shallot Dip (Mast-o Musir)","Ingredients":{"1":"1 ½ cups dried musir (Persian shallots, see note)","2":"4 cups (960g) plain yogurt","3":"1 teaspoon sea salt","4":"½ teaspoon freshly ground black pepper","5":"1 cup (85g) shredded fresh mint, or 1 tablespoon dried mint","6":"1 teaspoon crushed dried rose petals (see note)","7":"1 tablespoon fresh mint leaves"},"Instructions":"Soak the musir in water for 3 to 24 hours in the fridge. Drain, rinse in cold water, and pat dry. Inspect the soaked musir, cutting out any stems that remain hard after soaking, and chop finely.\nIn a mixing bowl, combine the chopped musir with the yogurt, salt, pepper, and mint. Mix well.\nAdd the garnish if you like and serve as an appetizer or an accompaniment.","Image":"//20fix.com/xfood/img/yogurt-and-persian-shallot-dip-mast-o-musir.jpg"},{"id":"507","Title":"Smashed Green Bean Salad With Crispy Shallots","Ingredients":{"1":"1/4 cup fresh lime juice","2":"1/4 cup fresh orange juice","3":"1/4 cup unseasoned rice wine vinegar","4":"1 Tbsp. kosher salt","5":"2 tsp. fish sauce","6":"1 1/2 tsp. sugar","7":"1/2 tsp. crushed red pepper flakes","8":"2 lb. green beans, trimmed","9":"1/2 red onion, thinly sliced","10":"2 Tbsp. neutral oil (such as sunflower or grapeseed)","11":"1/2 cup coarsely crushed roasted salted peanuts","12":"1/2 cup store-bought crispy fried shallots"},"Instructions":"Whisk lime juice, orange juice, vinegar, salt, fish sauce, sugar, and red pepper flakes in a large bowl to combine. Transfer 2 Tbsp. dressing to a small bowl; set aside for serving.\nWorking in 2 batches, place green beans in a large resealable plastic or silicone bag. Seal bag and whack beans with a rolling pin to split the skins, break beans into smaller pieces, and soften the insides without completely pulverizing them. Transfer beans to large bowl with dressing. Add onion and toss, massaging with your hands to break beans down further and coat. Let sit at room temperature at least 1 hour or chill overnight.\nUsing your hands, lift beans out of bowl and transfer to a platter, leaving excess liquid behind. Whisk oil and reserved 2 Tbsp. dressing to combine, then drizzle over beans. Gently mix in peanuts. Top with shallots.","Image":"//20fix.com/xfood/img/smashed-green-bean-salad-with-crispy-shallots.jpg"},{"id":"610","Title":"Steak Salad with Shallot Vinaigrette","Ingredients":{"1":"1 (1 1/2 inch-thick) boneless New York strip steak (about 1 lb.)","2":"Kosher salt","3":"Freshly ground black pepper","4":"1 small shallot, finely chopped","5":"1 Tbsp. Dijon mustard","6":"1 Tbsp. (or more) red wine vinegar","7":"6 Tbsp. extra-virgin olive oil, divided","8":"2 cups corn kernels (from about 2 ears corn)","9":"2 sprigs thyme","10":"1 Tbsp. unsalted butter","11":"1 head of butter lettuce, leaves separated","12":"2 Persian cucumbers, thinly sliced","13":"1 pint cherry tomatoes, halved"},"Instructions":"Pat steak dry with paper towels; season generously with salt and pepper. Let sit at room temperature while you make the dressing or up to 1 hour.\nMeanwhile, whisk shallot, mustard, and vinegar in a medium bowl. Whisking constantly, gradually stream in 5 Tbsp. oil. Whisk until dressing is thick and emulsified, then whisk in 1 Tbsp. water; season with salt. Taste and add a splash of vinegar if needed.\nHeat a dry cast-iron skillet over medium-high. Pat steak dry again. Rub with remaining 1 Tbsp. oil. Cook until golden brown, about 3 minutes per side. Using tongs, turn steak onto fat cap and cook until browned, about 3 minutes. Turn steak back onto a flat side and cook, turning every minute or so, until medium-rare (an instant-read thermometer inserted into the thickest part should register 125°), about 4 minutes longer. Transfer to a cutting board; let rest 10 minutes.\nWipe out skillet and let cool 2 minutes. Set skillet over medium-high; cook corn, thyme, and butter, stirring occasionally, until corn is browned in spots, 5–7 minutes.\nArrange lettuce on a platter; season with salt and pepper. Whisk dressing to reincorporate and drizzle half over lettuce. Toss cucumbers and tomatoes in a medium bowl; season with salt and pepper. Drizzle in 2 Tbsp. dressing; toss again. Spoon over lettuce. Thinly slice steak crosswise; arrange on top. Drizzle remaining dressing over and top with corn.","Image":"//20fix.com/xfood/img/steak-salad-with-shallot-vinaigrette.jpg"},{"id":"721","Title":"Crispy Fried Shallots","Ingredients":{"1":"8 small shallots, peeled","2":"Vegetable oil (for frying; about 1 1/4 cups)","3":"Kosher salt"},"Instructions":"Set a fine-mesh strainer over a medium heatproof bowl. Thinly slice shallots crosswise into rings on a mandoline (they should be about the thickness of a dime).\nPlace shallots in a medium saucepan and pour in oil to submerge. Set over medium-low heat and cook, stirring often with a fork to encourage rings to separate, until shallots are golden brown, 20–25 minutes. (Keep an eye on them; once they start to brown they’ll darken fast).\nPour shallots into strainer to drain, then transfer to paper towels. Season with salt and let cool. Reserve shallot oil for another use.\nDo Ahead: Shallots can be fried 5 days ahead. Store airtight at room temperature.","Image":"//20fix.com/xfood/img/crispy-fried-shallots.jpg"},{"id":"929","Title":"Glazed Shallots with Chile and Thyme","Ingredients":{"1":"4 Tbsp. unsalted butter","2":"1 1/2 lb. medium shallots, peeled, halved if large","3":"Kosher salt","4":"3 Tbsp. sherry vinegar or red wine vinegar","5":"3 large sprigs thyme, plus 1 tsp. thyme leaves for serving","6":"2 red Fresno chiles, halved lengthwise, seeds removed","7":"1 Tbsp. sugar"},"Instructions":"Preheat oven to 400°F. Heat butter in a large skillet over medium, swirling until foaming subsides. Arrange shallots in a single layer in skillet, flat or cut side down where possible. Season well with salt and cook, undisturbed, until deep golden brown underneath, about 5 minutes. Turn and cook until deep golden brown on the other side, about 5 minutes. Add vinegar and 1 cup water, then add thyme sprigs, chiles, and sugar and swirl skillet to combine. Bring liquid to a boil; reduce heat so liquid is at a simmer. Transfer skillet to oven and roast shallots, turning halfway through, until sauce is reduced to a glaze and a paring knife easily slides through centers, 35–40 minutes. Taste and season with more salt if needed.\nSpoon shallots and glaze into a serving dish and top with thyme leaves.\nShallots can be cooked 2 days ahead. Gently reheat in a large saucepan (or in the microwave in 30-second intervals) with a little water to loosen up glaze.","Image":"//20fix.com/xfood/img/glazed-shallots-with-chile-and-thyme.jpg"},{"id":"1341","Title":"Beet Salad with Pickled Mushrooms and Caramelized Shallots","Ingredients":{"1":"4 lb. beets (from about 3 large bunches)","2":"1 1/2 tsp. kosher salt, plus more","3":"1/2 cup extra-virgin olive oil, divided","4":"8 oz. wild mushrooms, sliced","5":"6 Tbsp. sherry vinegar or raspberry vinegar","6":"1 Tbsp. honey","7":"2 garlic cloves, finely grated","8":"6 shallots, halved, thinly sliced lengthwise","9":"2 Tbsp. coarsely chopped tarragon","10":"Freshly ground black pepper"},"Instructions":"Place beets in a large pot. Pour in cold water to cover; season with salt. Bring to a boil, then reduce heat to medium-low and simmer until tender, 40–60 minutes. Drain and let beets cool. Slip skins off with your hands (wear gloves to avoid staining if you have them) and slice into wedges. Place in a large bowl.\nMeanwhile, heat 2 Tbsp. oil in a large skillet over high. Add mushrooms and cook, stirring occasionally, until golden brown and crisp, about 6 minutes.\nWhisk vinegar, honey, garlic, 1/4 cup oil, and remaining 1 1/2 tsp. salt in a small bowl. Add mushrooms to dressing and let sit to pickle at least 30 minutes.\nWipe out skillet. Heat remaining 2 Tbsp. oil in skillet over medium-high. Add shallots and cook, stirring occasionally, until lightly browned and tender, about 4 minutes. Let cool.\nPour dressing off mushrooms over beets in bowl. Add tarragon and toss to coat. Top with shallots and pickled mushrooms; season with pepper.\nDo Ahead: Beets can be boiled 2 days ahead. Do not peel; cover and chill. Dressing can be made and mushrooms pickled 1 day ahead; cover and chill separately.","Image":"//20fix.com/xfood/img/beet-salad-with-pickled-mushrooms-and-caramelized-shallots.jpg"},{"id":"1494","Title":"Pan-Roasted Chicken with Shallots and Dates","Ingredients":{"1":"4 bone-in, skin-on chicken breast halves","2":"Salt and freshly cracked pepper","3":"2 tablespoons grapeseed oil","4":"4 tablespoons (2 ounces/55 g) unsalted butter, divided","5":"10 shallots, peeled, larger ones halved lengthwise","6":"4 cloves garlic, smashed and roughly chopped","7":"8 to 10 sprigs fresh thyme, divided","8":"1/2 cup (120 ml) dry white wine","9":"1 1/2 cups (360 ml) low-sodium chicken stock","10":"8 Medjool dates, pitted and halved lengthwise","11":"2/3 cup (105 g) green olives, smashed and pitted","12":"1 1/2 tablespoons apple cider vinegar","13":"1 lemon, zested and juiced"},"Instructions":"Set the chicken out at room temperature for 30 minutes before cooking.\nPreheat the oven to 450°F (230°C). Position a rack in the top third of your oven.\nPlace your largest cast-iron skillet in the oven for 15 minutes. Pat the chicken breasts dry and generously season them on all sides with salt and pepper. Carefully remove the hot skillet from the oven and place it on the stovetop. Add the grapeseed oil to the skillet and heat it over medium-high heat until the oil has a subtle ripple effect. You want the oil to be very hot. Working in two batches, cook the chicken, skin-side down, until the skin is crispy and golden brown, 4 to 5 minutes. Drain off all but 1 tablespoon of oil from the pan.\nRemove the chicken from the skillet and set it onto a plate as you build your sauce. Over medium heat, melt 2 tablespoons of the butter in the skillet and add the shallots. Cook the shallots undisturbed for 5 to 6 minutes, until they are caramelized and golden. Add the garlic, a few thyme sprigs, 1 tablespoon of the butter, and season with salt and pepper. Toss the shallots and continue to cook until they begin to soften, 5 to 7 minutes. Deglaze the pan with the wine and reduce it by half. Add a few more thyme sprigs and the stock. Simmer the sauce over medium to low heat for 15 minutes, until reduced slightly. Check for seasoning and add the dates and olives to the sauce.\nReturn the chicken breasts to the skillet, skin-side up, and place it in the oven. Roast the chicken until it’s just cooked through, about 20 minutes. An instant-read thermometer inserted in the thickest part of the breast should register 160°F (70°C).\nTransfer the chicken breasts to a plate; set them aside and keep warm. Return the skillet to the stovetop over medium to low heat and add the vinegar to the sauce. Simmer until the sauce is thick enough to coat the back of a wooden spoon, 3 to 5 minutes. Remove it from the heat and stir in the remaining 1 tablespoon butter and the lemon juice. Check and adjust the seasoning. Return the chicken to the skillet and serve it immediately, garnished with the remaining thyme and the lemon zest.","Image":"//20fix.com/xfood/img/pan-roasted-chicken-with-shallots-and-dates.jpg"},{"id":"1930","Title":"Chopped Salad with Shallot Vinaigrette, Feta, and Dill","Ingredients":{"1":"1 medium shallot, finely chopped","2":"1 teaspoon finely grated lemon zest","3":"1/4 cup fresh lemon juice","4":"1 tablespoon white wine vinegar","5":"1/4 cup olive oil","6":"Kosher salt","7":"8 ounces sugar snap peas (about 2 cups), trimmed, thinly sliced on a diagonal into 1/2-inch pieces","8":"1 bunch radishes (about 12), trimmed, thinly sliced","9":"4 medium Persian cucumbers, quartered lengthwise, cut crosswise into 1/2-inch pieces","10":"1 romaine heart, quartered lengthwise, cut crosswise into 1/2-inch pieces","11":"1/2 medium head of radicchio, cut crosswise into 1/2-inch pieces","12":"6 ounces feta, crumbled (about 1 1/2 cups)","13":"1 1/2 cups torn dill fronds","14":"Freshly ground black pepper"},"Instructions":"Mix shallot, lemon zest, lemon juice, and vinegar in a large bowl. Let sit 10 minutes, then mix in oil. Set vinaigrette aside.\nMeanwhile, mix a palmful of salt into a medium bowl of ice water; add peas. Let sit 10 minutes, then drain and pat dry (this makes them super crisp).\nAdd peas, radishes, cucumbers, romaine, and radicchio to bowl with reserved vinaigrette; toss well to coat. Add feta and dill, season with salt and pepper, and toss again to combine. Transfer to a platter to serve.\nVinaigrette can be made 6 hours ahead. Cover and chill. Bring to room temperature before using.","Image":"//20fix.com/xfood/img/chopped-salad-with-shallot-vinaigrette-feta-and-dill.jpg"},{"id":"2072","Title":"Spring Pea Butter with Shallot and Lemon","Ingredients":{"1":"1 1/3 cups fresh shelled peas (from about 1 pounds pods) or frozen peas, thawed","2":"1 teaspoon kosher salt, plus more","3":"1/2 cup (1 stick) plus 1 tablespoon unsalted butter, room temperature, divided","4":"1 medium shallot, finely chopped (about 1/4 cup)","5":"1/4 teaspoon freshly ground black pepper","6":"1/4 teaspoon finely grated lemon zest"},"Instructions":"If using fresh peas, cook in a medium saucepan of boiling salted water until tender, about 3 minutes (if using frozen peas, do not cook). Drain, transfer to a bowl of ice water, and let sit until cold, about 3 minutes. Drain and pat dry.\nMelt 1 Tbsp. butter in a medium skillet over medium high heat. Add shallot and cook, stirring occasionally, until softened, about 2 minutes. Transfer to a food processor. Add peas, pepper, lemon zest, 1 tsp. salt, and remaining 1/2 cup butter; pulse until just combined.\nPea butter can be made 3 days ahead; cover and chill, or freeze up to 3 months.","Image":"//20fix.com/xfood/img/spring-pea-butter-with-shallot-and-lemon.jpg"},{"id":"2145","Title":"Herb Rice with Green Garlic, Saffron, and Crispy Shallots","Ingredients":{"1":"3 cups basmati rice","2":"Kosher salt","3":"Vegetable oil (for frying; about 3 cups)","4":"4 large shallots, thinly sliced into rings","5":"3/4 cup finely chopped cilantro","6":"3/4 cup finely chopped dill","7":"3/4 cup finely chopped parsley","8":"1/2 cup finely chopped mint","9":"1/3 cup finely chopped tarragon","10":"1 teaspoon finely ground saffron threads","11":"4 (4-inch) squares lavash or 7 romaine lettuce leaves, dark green parts only","12":"4 green garlic or 4 scallions, white and pale-green parts only, finely chopped","13":"6 tablespoons unsalted butter, melted","14":"1 tablespoon finely ground dried rose petals (optional)"},"Instructions":"Place rice in a large bowl and pour in lukewarm water to cover. Using your hands, agitate rice until water becomes cloudy; drain. Repeat process until water stays clear (4–5 times). Cover rice with 6 cups cold water and add a generous handful of salt (water should taste salty). Let soak uncovered at room temperature at least 1 hour and up to 4 hours.\nMeanwhile, pour oil into a medium saucepan to come about 2\" up sides. Add shallots and set over medium heat. Cook, stirring occasionally, until shallots are golden and crisp, 10–12 minutes. Using a slotted spoon, transfer shallots to paper towels and season with salt. Strain oil into a small bowl; let cool.\nToss cilantro, dill, parsley, mint, and tarragon in a medium bowl; set aside 1 cup for serving. Dissolve saffron in 2 Tbsp. hot water in a small bowl.\nBring a large pot of salted water to a boil (use a nonstick pot if you have one; it will help the rice release at the end). Drain rice and add to pot, stirring gently to prevent any grains from sticking to the bottom. Bring to a boil and cook until grains begin to float on the surface and dance (rice should be almost tender but with a firm, opaque center), about 4 minutes. Drain rice and rinse under cold water. Spread out on a rimmed baking sheet. Wash out pot.\nPour 3 Tbsp. shallot oil into clean pot. Swirl in 2 tsp. saffron water; reserve remaining saffron water for serving. Oil mixture should barely coat bottom of pot; add more oil if needed. Season lightly with salt. Lay lavash across pot (it can go up the sides a little, but don’t overlap). Spoon a third of rice over lavash; top with a third of herbs and a third of green garlic. Repeat, alternating layers of rice, herbs, and green garlic to form a mound. Use the handle of a wooden spoon to poke several holes in rice (without hitting bottom of pot) to let steam escape. Wrap lid with a kitchen towel and cover pot. Cook over medium heat until herbs are slightly darkened, 10–15 minutes.\nReduce heat to medium-low, uncover and pour melted butter evenly over rice. Cover and cook until rice is fragrant and fluffy, 20–30 minutes. Remove from heat; let sit 10 minutes. Taste rice and season with more salt if needed.\nScoop 1 1/2 cups rice into reserved saffron water and toss to color rice. Layer saffron rice with rice in pot, reserved herbs, and crispy shallots. Top with rose petals if using. Break up lavash crust into pieces and serve alongside rice.","Image":"//20fix.com/xfood/img/herb-rice-with-green-garlic-saffron-and-crispy-shallots.jpg"},{"id":"2323","Title":"Shallot Tarte Tatin","Ingredients":{"1":"1 tablespoon pine nuts or chopped almonds","2":"6 large shallots, peeled, halved lengthwise","3":"2 teaspoons vegetable oil","4":"Kosher salt, freshly ground pepper","5":"1/4 cup balsamic vinegar","6":"1 teaspoon sugar","7":"3 tablespoons unsalted butter, divided","8":"1 package frozen puff pastry, thawed","9":"All-purpose flour (for surface)","10":"8 ounces mixed mushrooms (such as maitake, oyster, and/or shiitake), torn into bite-size pieces","11":"1 garlic clove, smashed","12":"3 ounces burrata, torn, or ricotta","13":"1 cup baby arugula","14":"1/2 ounce Parmesan, shaved","15":"Olive oil and lemon wedge (for serving)"},"Instructions":"Preheat oven to 400°F. Toast nuts on a rimmed baking sheet until golden brown, about 4 minutes. Transfer to a small bowl. Toss shallots and vegetable oil on same baking sheet; season with salt and pepper. Roast until tender and browned in spots, 20–25 minutes. Let cool. Remove any leathery outer layers.\nMeanwhile, bring vinegar and sugar to a simmer in a small skillet over medium-low, swirling occasionally, until syrupy, about 5 minutes. Stir in 1 Tbsp. butter; remove from heat. Arrange shallots, cut side up, in skillet, overlapping slightly if needed and filling in any gaps.\nRoll out puff pastry on a lightly floured surface just to smooth any creases (if box has 2 sheets of pastry, stack and gently roll out to adhere). Cut out a circle that’s about 1\" larger than the bottom of the skillet; prick in several places with a fork. Drape pastry over shallots, tucking edges inside skillet. Bake until pastry is golden brown and puffed, 25–30 minutes.\nMeanwhile, heat remaining 2 Tbsp. butter in a medium skillet over medium-high. Cook mushrooms and garlic, tossing often, until mushrooms are tender and browned, 5–8 minutes. Season with salt and pepper; set aside.\nLet tart sit until pastry is cooled slightly, 5–10 minutes. Carefully invert onto a plate. Top with burrata, mushrooms, arugula, Parmesan, and nuts. Drizzle with olive oil and lemon juice and season with salt.","Image":"//20fix.com/xfood/img/shallot-tarte-tatin.jpg"},{"id":"3002","Title":"Stir-Fried Asparagus With Bacon and Crispy Shallots","Ingredients":{"1":"1/4 cup black vinegar","2":"1/4 cup sherry vinegar","3":"2 small shallots, thinly sliced into rings","4":"4 ounces slab bacon, cut into 1x1/4-inch pieces","5":"1 tablespoon vegetable oil, plus more for frying (about 3 cups)","6":"1/4 cup all-purpose flour","7":"1/4 cup fine-grind cornmeal","8":"Kosher salt","9":"1 pound asparagus, trimmed, thinly sliced on a diagonal","10":"1 tablespoon white soy sauce","11":"A deep-fry thermometer"},"Instructions":"Combine both vinegars in a medium bowl. Add shallots and let sit, tossing occasionally, 1 hour. Drain and pat dry.\nMeanwhile, cook bacon in a large skillet over medium heat, stirring occasionally, until most of fat is rendered and bacon begins to brown, 5–7 minutes. Transfer to paper towels. Pour off fat; reserve for another use (scrambled eggs!). Wipe out skillet; reserve.\nFit a medium pot with thermometer and pour in oil to come 2\" up sides of pot. Heat over medium-high until thermometer registers 300°F. Whisk flour and cornmeal in a shallow bowl. Dredge shallots in flour mixture, shaking off excess. Fry, tossing occasionally, until golden and crisp, about 3 minutes. Transfer to paper towels; season with salt.\nHeat reserved skillet over medium-high. Swirl remaining 1 Tbsp. oil in pan to coat (this keeps food from sticking); pour out excess. The oil should be shimmering—if it’s not hot enough, the asparagus will steam not caramelize. Add asparagus, season with salt, and cook, tossing, until almost cooked through, about 1 minute. Add bacon and 1 Tbsp. water; cook, tossing, until asparagus is cooked through, about 30 seconds. Add soy sauce; toss to coat. Serve topped with shallots.","Image":"//20fix.com/xfood/img/stir-fried-asparagus-with-bacon-and-crispy-shallots.jpg"},{"id":"3187","Title":"Caramelized Shallot Yogurt","Ingredients":{"1":"2 tablespoons olive oil","2":"4 large shallots, finely chopped (about 2 cups)","3":"Kosher salt, freshly ground pepper","4":"1 tablespoon apple cider vinegar","5":"1 1/2 cups low-fat plain Greek yogurt","6":"1 tablespoon sliced chives, plus more for serving","7":"Chips or crackers (for serving)"},"Instructions":"Heat oil in a medium skillet over medium. Add shallots and season generously with salt and pepper. Cook, stirring occasionally and reducing heat if needed, until shallots are golden brown and tender, 15–18 minutes. Let cool slightly.\nMix shallots and vinegar into yogurt in a medium bowl; season with salt and pepper.\nStir 1 Tbsp. chives into yogurt; divide among bowls and top with more chives. Serve with chips for dipping.\nYogurt (without chives) can be made 3 days ahead; cover and chill.","Image":"//20fix.com/xfood/img/caramelized-shallot-yogurt.jpg"},{"id":"3199","Title":"Wilted Chard With Shallots and Vinegar","Ingredients":{"1":"1 bunch Swiss chard, ribs and stems separated from leaves","2":"2 tablespoons olive oil","3":"2 large shallots, thinly sliced into rings","4":"2 garlic cloves, grated","5":"Kosher salt","6":"2 teaspoons Sherry vinegar or red wine vinegar"},"Instructions":"Cut Swiss chard stems into very small pieces. Tear leaves into 2\" pieces and rinse well (you'll want some water still clinging to the leaves).\nHeat oil in a large skillet over medium-high. Add chard stems, shallots, and garlic and season with salt. Cook, stirring occasionally, until vegetables are starting to soften but haven't taken on any color, about 2 minutes. Add chard leaves, season with salt, and cook, tossing occasionally, until leaves are tender and have released some liquid, about 3 minutes (stems will have a bit of crunch). Mix in vinegar; taste and season with more salt if needed.","Image":"//20fix.com/xfood/img/wilted-chard-with-shallots-and-vinegar.jpg"},{"id":"3281","Title":"Eggs with Pickled Shallot and Parsley","Ingredients":{"1":"8 large eggs","2":"1 small shallot, finely chopped","3":"2 tablespoons fresh lemon juice","4":"1 cup finely chopped fresh parsley","5":"Flaky sea salt"},"Instructions":"Gently lower eggs into a medium pot of boiling water and cook 8 minutes. Transfer eggs to a bowl of ice water and let cool.\nMeanwhile, combine shallot and lemon juice in a small bowl; let sit 10 minutes.\nDrain shallots and toss in a small bowl with parsley; season with salt.\nCarefully peel eggs (they'll be a little wobbly in the center) and slice crosswise 1/2\" thick. Arrange on a platter and top with parsley and shallot mixture.","Image":"//20fix.com/xfood/img/eggs-with-pickled-shallot-and-parsley.jpg"},{"id":"3293","Title":"Crown Roast of Pork with Lady Apples and Shallots","Ingredients":{"1":"2 (8-bone racks) of pork (about 4 lb. each), chine bone removed, fat trimmed to 1/4\" thick, rib bones frenched","2":"1 1/2 cups (packed) light brown sugar","3":"10 ounces kosher salt (2 cups Diamond Crystal or 1 1/4 cups Morton)","4":"1 cup apple cider vinegar","5":"12 garlic cloves, finely grated","6":"2 tablespoons chopped fresh thyme, plus 8 sprigs","7":"1 tablespoon brown mustard seeds","8":"1 teaspoon coarsely ground black pepper","9":"1/4 cup plus 2 tablespoons whole grain Dijon mustard","10":"4 tablespoons olive oil, divided","11":"4 ounces bacon, chopped","12":"12 pounds lady apples, halved","13":"1 1/2 pounds shallots, peeled, halved lengthwise if large","14":"3 cups dry hard cider"},"Instructions":"Lay racks of pork flat on work surface, meaty side down (the inside of the ribs should be facing up). Use a knife to make 3 vertical 3\"-long slits (about 1\" deep) into the loins of each rack, 1 slit between every 2 ribs. Place each rack of pork into a 1-gal. resealable plastic bag and chill.\nHeat brown sugar, salt, and 4 cups water in a large saucepan over medium, stirring until sugar and salt are dissolved, about 5 minutes. Remove from heat and add vinegar and 4 cups ice water. Chill brine until cold, about 1 hour.\nDivide brine between bags with pork and seal, squeezing out excess air; chill pork 8–24 hours.\nRemove pork from bags and pat dry. Place on a large rimmed baking sheet; let sit 2 hours to bring to room temperature.\nPreheat oven to 300°F. Mix garlic, chopped thyme, mustard seeds, pepper, 1/4 cup mustard, and 2 Tbsp. oil in a small bowl. Smear all over pork, working into slits; tuck thyme sprigs into slits. Upend both racks so they're parallel to one another with bones facing up and slits facing out. Curve racks toward each other so they meet at both ends to form a crown (call a friend to help with this part). Holding pork in place, encircle racks with string and tie securely in 2 places: around rib bones and around thickest part of loin. If desired, wrap tops of bones individually with foil to keep them from burning.\nHeat remaining 2 Tbsp. oil in a large skillet over medium. Cook bacon, stirring often, until fat is rendered and edges are crisp, about 5 minutes. Transfer bacon to a roasting pan with a slotted spoon.\nWorking in 2–3 batches, add apples, cut side down, and shallots to same skillet and cook over medium-high heat (undisturbed) until golden brown, about 5 minutes. Transfer apples to roasting pan; turn shallots and cook until golden brown on the other side, about 3 minutes. Transfer to roasting pan.\nRemove skillet from heat and carefully add cider, stirring and scraping up any browned bits. Pour liquid into roasting pan and place pork in the center, pushing apples and shallots to the edges; reserve skillet. Roast pork until an instant-read thermometer inserted into the center of loin registers 135°F, 1 3/4–2 1/4 hours.\nRemove roast from oven and transfer apples and shallots to a platter; tent with foil. Increase oven temperature to 500°F. Transfer pork to a cutting board and pour pan juices into reserved skillet. Return pork to roasting pan; roast until browned and crisp all over, 5–10 minutes. Transfer roast back to cutting board and let rest 30–45 minutes before cutting into chops.\nJust before serving, whisk remaining 2 Tbsp. mustard into pan juices in skillet and bring to a simmer over medium heat. Cook, whisking often, until sauce is reduced to about 1 cup, 7–10 minutes.\nTransfer pork chops to platter with apples and shallots; spoon sauce over.","Image":"//20fix.com/xfood/img/crown-roast-of-pork-with-lady-apples-and-shallots.jpg"},{"id":"3611","Title":"Bitter Greens with Sautéed Corn & Shallots","Ingredients":{"1":"1 tablespoon olive oil","2":"2 ounces chopped guanciale (salt-cured pork jowl), pancetta (Italian bacon), or bacon","3":"2 chopped shallots","4":"Salt and pepper","5":"4 cups fresh corn kernels","6":"3 tablespoons Sherry vinegar or red wine vinegar","7":"1 tablespoon olive oil","8":"1 bunch dandelion greens or arugula (about 8 cups)","9":"2 chopped Medjool dates","10":"Shaved Parmesan","11":"Pinch of chopped fresh chives"},"Instructions":"Heat 1 tablespoon olive oil in a large skillet over medium. Cook 2 ounces chopped guanciale (salt-cured pork jowl), pancetta (Italian bacon), or bacon, stirring occasionally, until browned and crisp, about 4 minutes. Add 2 chopped shallots, season with salt and pepper, and cook, stirring often, until softened, about 3 minutes. Add 4 cups fresh corn kernels and cook 2 minutes. Let cool slightly, then stir in 3 tablespoons Sherry vinegar or red wine vinegar and 1 tablespoon olive oil.\nToss 1 bunch dandelion greens or arugula (about 8 cups) and warm dressing in a large bowl. Season with salt and pepper. Serve topped with 2 chopped Medjool dates, shaved Parmesan, and a pinch of chopped fresh chives.","Image":"//20fix.com/xfood/img/bitter-greens-with-sauteed-corn-shallots-56389844.jpg"},{"id":"3833","Title":"Slow-Roasted Shallots in Skins","Ingredients":{"1":"1 pound whole large shallots in their skins"},"Instructions":"Preheat oven to 425°F. Rinse 1 pound whole large shallots in their skins and place on a rimmed baking sheet. Roast until skins are deep golden brown and blistered and flesh is very tender throughout, easily yielding when pierced with a knife, 50–60 minutes.\nLet sit until cool enough to handle. Split open to eat, or slip shallots out of skins to use in vinaigrettes, sauces, or condiments.","Image":"//20fix.com/xfood/img/slow-roasted-shallots-in-skins-56389532.jpg"},{"id":"4192","Title":"Skillet Stuffing with Apples, Shallots, and Cranberries","Ingredients":{"1":"2 large shallots, roughly chopped","2":"1 medium onion, roughly chopped","3":"2 celery stalks, roughly chopped","4":"2 medium green apples, roughly chopped (do not peel)","5":"2 garlic cloves, roughly chopped","6":"4 tablespoons (1/2 stick) unsalted butter","7":"Kosher salt","8":"freshly ground black pepper","9":"1 medium loaf rustic country bread, cut into 1-inch cubes (about 10 cups)","10":"1 1/2 cups low-sodium chicken broth, plus more if necessary","11":"1/2 cup apple cider","12":"1 teaspoon chopped fresh rosemary leaves","13":"1 1/2 teaspoons chopped fresh thyme leaves","14":"1/2 cup dried cranberries","15":"2 eggs, lightly beaten"},"Instructions":"Preheat the oven to 375°F. In the bowl of a food processor, pulse the shallot, onion, celery, apple, and garlic, scraping down sides of the bowl, until finely chopped.\nIn a 12-inch cast iron or other oven-safe skillet over medium-high heat, heat butter. Add the chopped vegetable mixture, season with a generous pinch of salt and pepper, and cook, stirring occasionally, until tender, 7 to 8 minutes. Reduce heat to medium, add the bread cubes and cook, stirring occasionally, until softened, 5 to 7 minutes.\nRemove pan from heat and stir in the broth, cider, rosemary, thyme, and cranberries. Once the liquid is completely absorbed, stir in the eggs, transfer the pan to the oven and bake until browned on top and cooked through, 20 to 25 minutes.","Image":"//20fix.com/xfood/img/skillet-stuffing-with-apples-shallots-and-cranberries-51258440.jpg"},{"id":"4334","Title":"Green Beans with Shallots, Hazelnuts, and Tarragon","Ingredients":{"1":"6 tablespoons raw hazelnuts","2":"3 tablespoons unsalted butter, divided","3":"3 large shallots, sliced (about 1 cup)","4":"3/4 teaspoon kosher salt","5":"1/2 teaspoon freshly ground pepper","6":"1 1/2 pounds haricots verts (thin green beans), trimmed","7":"3 tablespoons fresh tarragon leaves, coarsely chopped","8":"1 1/2 teaspoons grated lemon zest"},"Instructions":"Preheat oven to 350°F. Spread hazelnuts on a baking sheet and toast in the oven, tossing halfway through, until skins are splitting and nuts are fragrant, about 15 minutes. Transfer to a bowl to steam and cool, then rub the nuts with a kitchen towel to remove their skins. Roughly chop the hazelnuts and set aside.\nIn a large sauté pan over medium-high heat, melt 1 tablespoon butter. Add shallots and cook, tossing, until lightly golden and softened, 3 to 4 minutes. Remove and set aside.\nReduce heat to medium, and add 1/2 cup water, remaining 2 tablespoons butter, salt, and pepper to the same pan. Add the haricots verts and toss to coat. Cover pan and cook, tossing occasionally, until bright green and crisp-tender, about 3 minutes. Remove cover, raise heat to high and cook until the water evaporates and the beans are glazed, about 3 minutes more. Toss green beans with tarragon, lemon zest, hazelnuts, and sautéed shallots. Serve immediately.","Image":"//20fix.com/xfood/img/green-beans-with-shallots-hazelnuts-and-tarragon-51252890.jpg"},{"id":"4342","Title":"Aleppo Pepper-Roasted Pork with Shallot Vinaigrette","Ingredients":{"1":"4 large garlic cloves, finely grated","2":"1/4 cup Aleppo pepper or 2 tablespoons crushed red pepper flakes","3":"1/4 cup kosher salt","4":"1/4 cup (packed) light brown sugar","5":"1 8-10-pound bone-in pork shoulder (Boston butt)","6":"2 large shallots, finely chopped","7":"1/3 cup red wine vinegar","8":"1/4 cup coarsely chopped fresh flat-leaf parsley","9":"2 tablespoons chopped fresh marjoram or oregano","10":"2 tablespoons Aleppo pepper or 2 teaspoons crushed red pepper flakes","11":"2 tablespoons olive oil","12":"3/4 teaspoon sugar","13":"Kosher salt, freshly ground pepper"},"Instructions":"Mix garlic, Aleppo, salt, and sugar in a small bowl; rub over pork. Place in a large roasting pan. Cover and chill 12-24 hours.\nPreheat oven to 300°F. Uncover pork and roast, basting with drippings every hour or so and covering with foil if browning too quickly, until an instant-read thermometer inserted into the thickest part of pork registers 145°F (meat will be very tender but not quite falling off the bone), 6-7 hours. Transfer to a cutting board and let rest at least 30 minutes before slicing.\nDo ahead: Pork can be roasted 1 day ahead. Let cool; cover and chill. Reheat in a 225°F oven (about 1 hour).\nWhisk shallots, vinegar, parsley, marjoram, Aleppo pepper, oil, sugar, and 2 tablespoons water in a medium bowl. Season with salt and black pepper; serve with pork. Do ahead: Vinaigrette can be made 6 hours ahead. Cover and chill.","Image":"//20fix.com/xfood/img/aleppo-pepper-roasted-pork-with-shallot-vinaigrette-51252700.jpg"},{"id":"4407","Title":"Hanger Steak with Shallots and Jerusalem Artichokes","Ingredients":{"1":"2 tablespoons unsalted butter","2":"1 pound shallots, peeled, roots left intact","3":"1/4 teaspoon coarsely ground black pepper","4":"1 teaspoon kosher salt, plus more","5":"2 tablespoons plus 1/4 cup red wine vinegar","6":"1/4 cup olive oil","7":"1 teaspoon finely chopped Fresno chile","8":"1 pound Jerusalem artichokes (sunchokes), cut into 1/2\" pieces","9":"Kosher salt","10":"3 tablespoons heavy cream","11":"1 tablespoons unsalted butter","12":"3 tablespoons olive oil","13":"1 1/2 pound hanger steak, center membrane removed, cut into 4 pieces","14":"Kosher salt","15":"2 lemons, halved","16":"Olive oil","17":"Freshly ground black pepper","18":"1/4 cup fresh flat-leaf parsley leaves with tender stems","19":"2 tablespoons fresh mint leaves","20":"2 tablespoons torn fennel fronds"},"Instructions":"Preheat oven to 350°. Heat butter in a large ovenproof skillet over medium heat. Cook shallots, tossing occasionally, until golden brown, 8–10 minutes. Add pepper, 1 teaspoon salt, and 2 tablespoons vinegar and toss. Roast shallots in oven, checking after 10 minutes and shaking pan to turn and adding a splash or so of water if butter is burning, until tender, 10–20 minutes.\nMeanwhile, whisk oil, chile, and remaining 1/4 cup vinegar in a large bowl; season with salt (vinaigrette will separate as it sits).\nWhen shallots are done cooking, whisk vinaigrette, add shallots, and toss gently.\nCook Jerusalem artichokes in a large saucepan of boiling, generously salted water until tender, 10–12 minutes. Drain; return to saucepan. Cook over medium heat, tossing, until dry, about 2 minutes. Remove from heat, add cream and butter, and stir to combine.\nPurée in a blender. With motor running, gradually add oil and blend until emulsified; season with salt. Strain through a fine-mesh sieve into a large bowl; discard solids.\nPrepare grill for medium-high heat. Season steaks with salt and grill, turning occasionally, until lightly charred and an instant-read thermometer registers 130° for medium-rare, 8–10 minutes. Transfer to a cutting board. Squeeze lemons over and drizzle with oil; season with pepper. Let rest 5–10 minutes before slicing.\nSpoon purée onto plates and place steak around. Top with shallots, leaving vinaigrette in pan. Toss herbs and fennel fronds in vinaigrette; season with salt. Top steak with salad and drizzle with oil.","Image":"//20fix.com/xfood/img/hanger-steak-with-shallots-and-jerusalem-artichokes-51248460.jpg"},{"id":"4435","Title":"Heirloom Tomato Salad with Watercress and Pickled Shallots","Ingredients":{"1":"1 shallot, peeled and thinly sliced","2":"1/2 cup white wine vinegar","3":"Salt","4":"Freshly ground black pepper","5":"1/2 cup extra-virgin olive oil","6":"Salt","7":"Freshly ground black pepper","8":"4 small heirloom tomatoes (about 1 pound)","9":"2 cups watercress"},"Instructions":"Combine the shallot with ½ cup white wine vinegar, season with salt and pepper. Refrigerate 30 minutes, or until shallots turn pink. Strain before using.\nTo make dressing, take 2 tablespoons of vinegar from the shallot mixture and place in a bowl. Whisk in 1/2 cup of extra-virgin olive oil and season with salt and pepper.\nTo make the salad, cut the heirloom tomatoes into wedges. Place 2 cups watercress in a large bowl and top with tomato wedges, pickled shallots and dressing.","Image":"//20fix.com/xfood/img/heirloom-tomato-salad-with-watercress-and-pickled-shallots-51244060.jpg"},{"id":"4767","Title":"Crispy Salt and Pepper Chicken with Caramelized Fennel and Shallots","Ingredients":{"1":"Cooking spray","2":"One 3 1/2-pound chicken, cut into 8 pieces","3":"1/4 cup potato starch","4":"2 large fennel bulbs, trimmed and cut into 1 1/2-inch slices","5":"4 shallots, halved if large","6":"4 garlic cloves, smashed","7":"3 tablespoons olive oil","8":"2 teaspoons kosher salt","9":"3/4 teaspoon freshly ground black pepper","10":"3/4 teaspoon ground white pepper","11":"2 tablespoons chopped fresh parsley"},"Instructions":"1. Preheat the oven to 400°F. Spray a baking sheet with cooking spray.\n2. Place the chicken pieces and flour in a large resealable plastic bag and toss to coat evenly. Shake off any excess flour. Place the chicken, fennel, shallots, and garlic in a single layer on the prepared baking sheet. Drizzle with the olive oil and sprinkle with the salt and black and white peppers. Bake until the chicken is cooked through and the skin is crispy, 40 to 45 minutes. Sprinkle with the parsley before serving.","Image":"//20fix.com/xfood/img/crispy-salt-and-pepper-chicken-with-caramelized-fennel-and-shallots-51230420.jpg"},{"id":"4895","Title":"Fennel-Crusted Pork Chops with Potatoes and Shallots","Ingredients":{"1":"1 1/2 tablespoons fennel seeds","2":"2 garlic cloves, finely grated","3":"1 teaspoon hot smoked Spanish paprika","4":"3 tablespoons vegetable oil, divided","5":"2 1\"-thick bone-in pork loin chops (about 1 1/4 pounds total)","6":"Kosher salt, freshly ground pepper","7":"1 pound small Yukon Gold potatoes, quartered","8":"2 large shallots, cut into quarters with some root attached","9":"1/2 cup fresh flat-leaf parsley leaves","10":"2 teaspoons red wine vinegar"},"Instructions":"Preheat oven to 450°F. Toast fennel seeds in a small dry skillet over medium heat, tossing often, until fragrant, about 4 minutes. Let cool.\nCombine fennel seeds, garlic, paprika, and 2 tablespoons oil in a small bowl. Season pork with salt and pepper and place in a resealable plastic bag. Add spice mixture; seal bag and turn to coat. Let sit at least 30 minutes.\nHeat remaining 1 tablespoon oil in a large ovenproof skillet, preferably cast iron, over medium-high heat. Cook pork chops until golden brown on 1 side, about 4 minutes; turn. Add potatoes and shallots to skillet; season with salt and pepper and toss to coat in pan drippings. Cook, tossing potatoes and shallots occasionally, until pork is golden brown on second side, about 4 minutes.\nTransfer to oven and roast until potatoes are tender and an instant-read thermometer inserted into thickest part of chops registers 135°F, 10–15 minutes. (If potatoes need more time, transfer chops to a plate and continue to roast potatoes until tender; transfer chops back to skillet when potatoes are done.) Remove skillet from oven and mix in parsley and vinegar. Let pork chops rest 5 minutes in skillet.\nTransfer chops to a cutting board; cut meat from bones and slice against the grain. Serve with potatoes, shallots, and any pan juices.\nDO AHEAD: Pork chops can be marinated 1 day ahead. Keep chilled.","Image":"//20fix.com/xfood/img/fennel-crusted-pork-chops-with-potatoes-and-shallots-51214810.jpg"}],"t":69,"p":{"limitstart":0,"limit":25,"total":69,"pagesStart":1,"pagesStop":3,"pagesCurrent":1,"pagesTotal":3}}}