{"ingredient":"Peach","recipes":{"s":1,"d":[{"id":"80","Title":"Peach and Sesame Crumble","Ingredients":{"1":"⅓ cup raw sesame seeds","2":"1 lemon","3":"2½ lb. peaches (6–7), thinly sliced","4":"⅓ cup plus 1¼ cups sugar","5":"1¾ tsp. kosher salt, divided","6":"1 cup all-purpose flour","7":"½ cup (1 stick) unsalted butter","8":"½ tsp. ground cinnamon","9":"⅓ cup tahini","10":"2 tsp. toasted sesame oil","11":"1—2 tsp. cornstarch","12":"Vanilla ice cream (for serving; optional)"},"Instructions":"Place a rack in top third of oven; preheat to 375°F. Toast sesame seeds on a rimmed baking sheet, tossing halfway through, until golden brown, 12–15 minutes. Immediately transfer to a large bowl.\nMeanwhile, finely grate zest from lemon into a medium bowl; set aside. Place peaches in a 13x9\" baking dish. Halve lemon and squeeze 1 Tbsp. juice over peaches, then sprinkle ⅓ cup sugar and ¾ tsp. salt over. Toss to gently combine, then let sit while you prep the topping, at least 20 minutes.\nAdd flour and remaining 1¼ cups sugar and 1 tsp. salt to bowl with sesame seeds. Whisk to combine.\nAdd butter and cinnamon to bowl with lemon zest. Microwave until butter is melted, about 1 minute. (Or, if you don't have a microwave, melt butter with cinnamon and lemon zest in a small saucepan over medium.) Whisk in tahini and oil.\nScrape tahini mixture into dry ingredients and mix until incorporated (mixture should hold together when squeezed in your hand).\nThe peaches should look juicy at this point. Add 1 tsp. cornstarch. If they’re really juicy, add another 1 tsp. Gently toss to combine. (If your peaches happen to be not-so-ripe and aren't juicy, don't add any cornstarch.)\nSqueeze topping into big clumps, then break off uneven pieces and scatter over peaches.\nBake crumble until topping is well browned and firm, peaches are tender, and juices are bubbling, about 1 hour. Let cool slightly.\nDivide crumble among shallow bowls and add a scoop of ice cream if desired.","Image":"//20fix.com/xfood/img/peach-and-sesame-crumble.jpg"},{"id":"99","Title":"Charred-Peach Panzanella With Pickled Pepper Vinaigrette","Ingredients":{"1":"2 garlic cloves, finely grated","2":"½ cup sliced hot pickled peppers (such as banana peppers), plus 1 Tbsp. pickle brine","3":"1 Tbsp. stone-ground or whole grain mustard","4":"1½ tsp. kosher salt","5":"1½ lb. plum tomatoes (6–7 medium), sliced ½\" thick","6":"8 oz. thick-cut bacon (about 6 slices), cut into 1½\" pieces","7":"1 (10–12-oz.) loaf crusty multigrain bread, sliced ¾\" thick","8":"3 large slightly firm peaches (about 1¼ lb.), preferably freestone, halved, pitted"},"Instructions":"Whisk garlic, pickle brine, mustard, and salt in a large bowl to combine. Add tomatoes and pickled peppers and gently toss to combine. Let sit, tossing occasionally, while you cook the bacon, bread, and peaches.\nArrange bacon in a cold large cast-iron skillet and set over medium heat. Cook, stirring occasionally, until mostly crisp (there can still be a few soft, chewy spots if you’re into that sort of thing), about 10 minutes. Transfer bacon to paper towels to drain. Pour bacon fat into a small bowl; set aside. Wipe out skillet.\nHeat 2 Tbsp. reserved bacon fat in same skillet. Working in batches and adding more bacon fat as needed, toast bread until golden (a few char marks are fine), about 2 minutes per side. Transfer to paper towels to drain. Wipe out skillet.\nHeat another 1 Tbsp. bacon fat (if you’ve run out, use vegetable or olive oil) in same skillet and cook peach halves, cut side down, until lightly charred, about 3 minutes. Transfer to a cutting board; let sit until cool enough to handle. Slice each half in half again or into thirds and add to bowl with tomatoes. Tear toasted bread into 1\"–1½\" pieces and add to bowl. Add bacon and toss gently to combine and saturate bread with juices collected in bowl.\nTransfer panzanella to a platter or individual bowls to serve.","Image":"//20fix.com/xfood/img/charred-peach-panzanella-pickled-pepper-vinaigrette.jpg"},{"id":"117","Title":"Peach Cobbler","Ingredients":{"1":"10 large peaches (about 4½ pounds), unpeeled, cut into 1-inch chunks","2":"Zest and juice of 1 large lemon","3":"½ cup (1 stick) unsalted butter, softened","4":"2 cups sugar, divided","5":"1½ cups (about 192 grams) all-purpose flour","6":"2 teaspoons baking powder","7":"1 teaspoon kosher salt","8":"¾ cup whole milk","9":"½ cup hot tap water","10":"Heavy cream, for serving"},"Instructions":"Preheat the oven to 350 degrees F.\nPut the peaches in a 9-by-13-inch (or similar) baking pan or gratin dish. Pat the peaches into a roughly even layer, then, using a zester or a Microplane, zest the lemon evenly over the fruit and squeeze the lemon juice evenly over the top.\nIn the work bowl of a stand mixer fitted with the paddle attachment, cream the butter and 1½ cups of the sugar on medium speed until sandy, about 1 minute. Add the flour, baking powder, and salt, and beat again for another 30 seconds, until all the flour is incorporated and the mixture is evenly crumbly. With the mixer on low speed, slowly add in the milk. Increase the speed to medium and beat until light and fluffy, about 2 minutes.\nPlop the batter in 6 large blobs over the top of the peaches. With an offset spatula or small knife, carefully spread the batter evenly over the fruit, so it’s no more than about ½ inch thick in any one place.\nSprinkle the remaining ½ cup sugar directly over the batter. Drizzle the hot water evenly over the sugar, using it to melt the sugar into the topping. (Use it all. It’s a strange method, but it works.)\nBake the cobbler for 70 to 80 minutes, or until the top is browned and cracked. (A toothpick inserted into the topping should come out dry—be sure to check in a few places.)\nLet the cobbler sit for about a half an hour to firm up before serving warm in big bowls, with heavy cream poured on top.","Image":"//20fix.com/xfood/img/peach-cobbler-hot-water.jpg"},{"id":"138","Title":"Grilled Peach Toast With Pimiento Cheese","Ingredients":{"1":"2 firm-ripe peaches, halved and pitted","2":"2 tablespoons plus 1 teaspoon blended oil","3":"1 medium-size ripe avocado","4":"4 (1⁄2-inch-thick) slices multigrain boule-style bread","5":"Smoky Pimiento Cheese With Bacon","6":"2 tablespoons extra-virgin olive oil","7":"1⁄4 cup thinly sliced red radishes (about 3 ounces)","8":"1 bunch watercress","9":"1 teaspoon gray sea salt","10":"1⁄2 teaspoon coarsely ground black pepper"},"Instructions":"Preheat a grill to medium-high (450°F).\nBrush the peach halves with 1 tablespoon of the blended oil, and place on the grill grates, cut sides down. Grill, uncovered, until grill marks appear and the juices begin to release, about 3 minutes. Remove from the grill, and slice. Set aside.\nCut the avocado in half lengthwise, pit, and brush cut sides with 1 teaspoon of the blended oil. Place halves, cut sides down, on the grill grates. Grill, uncovered, just until the avocado is charred and begins to soften, about 5 minutes. Remove from the grill.\nBrush the bread slices with the remaining 1 tablespoon oil, and place on the grill grates. Grill until the bread is toasted, about 2 minutes per side. Remove from the grill.\nSpread Pimiento Cheese onto 1 side of each piece of toast. Cut each piece into 4 equal rectangles, keeping the pieces together.\nScoop the avocado from the peel into a medium bowl and mash with 1 tablespoon of the extra-virgin olive oil until it is chunky and spreadable. Spoon onto the toast, and top with sliced peaches.\nTop the toast slices with radish slices and watercress leaves. Drizzle the remaining 1 tablespoon extra-virgin olive oil over the toast slices, and sprinkle with gray sea salt and black pepper.","Image":"//20fix.com/xfood/img/grilled-peach-toast-with-pimiento-cheese.jpg"},{"id":"166","Title":"Dad's Peach Cobbler","Ingredients":{"1":"3 cup all-purpose flour, plus more for dusting","2":"3 tablespoons sugar","3":"2 teaspoons kosher salt","4":"¾ cup (1½ sticks) unsalted butter, cut into cubes and chilled","5":"1 cup ice-cold water, plus more as needed","6":"3½ pounds fresh peaches, pitted and quartered or two (29-ounce) cans peaches, drained","7":"1 cup sugar","8":"¼ cup all-purpose flour","9":"1 tablespoon ground cinnamon","10":"½ teaspoon freshly grated nutmeg","11":"Fine sea salt","12":"1 large egg, beaten","13":"Ground cinnamon, for dusting","14":"Sugar, for dusting","15":"Ice cream, for serving"},"Instructions":"Make the crust: In the bowl of a food processor, pulse together the flour, sugar, and 2 teaspoons salt until just combined. Add the butter and pulse a few more times until the mixture is coarse but the butter pieces are still visible. Slowly add the ice water and pulse to form a dough, six to eight pulses. If the dough looks and feels very dry, add more ice water, 1 tablespoon at a time. Divide the dough in half and wrap each half tightly in plastic wrap; flatten each piece into a disc. Refrigerate the dough for 1 hour.\nMake the filling: In a large bowl, mix together the peaches, sugar, flour, cinnamon, nutmeg, and a pinch of salt. Set aside.\nPreheat the oven to 375ºF.\nRemove the dough from the refrigerator and cut in half. On a lightly floured surface, roll it into a 9 x 13-inch rectangle, about ¼ inch thick. Set aside and repeat with the second piece of dough.\nLine a 9 x 13-inch baking dish with one of the dough rectangles, pressing any excess dough against the sides of the dish. Pour in the peach filling and spread it evenly. Place the second rectangle of dough on top of the peaches and tuck the excess dough into corners. Brush the dough with the beaten egg and sprinkle with cinnamon and sugar. Pierce the top with the tip of a sharp knife in several places to allow steam to escape while baking. Bake until the top crust is golden brown, about 1 hour 15 minutes. Let cool on a rack before serving. Serve with ice cream.","Image":"//20fix.com/xfood/img/dads-peach-cobbler-lazarus-lynch.jpg"},{"id":"570","Title":"Peach-Plum Galette","Ingredients":{"1":"2 tsp. cornstarch","2":"1 tsp. finely grated lime zest","3":"1 tsp. kosher salt","4":"1/3 cup sugar, plus more for sprinkling","5":"1 lb. peaches, cut into 3/4\"-thick wedges","6":"1 lb. plums, cut into 3/4\"-thick wedges","7":"1 Tbsp. fresh lime juice","8":"1 tsp. vanilla extract","9":"1 tsp. finely grated peeled ginger (optional)","10":"Extra-Flaky Pastry Dough","11":"1 Tbsp. heavy cream","12":"Softly whipped cream or vanilla ice cream (for serving; optional)"},"Instructions":"Preheat oven to 400°F. Combine cornstarch, lime zest, salt, and 1/3 cup sugar in a medium bowl. Toss with your hands to combine, then add fruit and toss to coat. Add lime juice, vanilla, and ginger (if using); toss gently.\nArrange fruit mixture in the center of chilled dough (still on parchment on baking sheet) and spread out evenly, leaving a 3\" border. Fold edges of dough up and over fruit, pleating as needed and being careful that folded edge of dough doesn’t tear (if it does, patch with dough scraps and pinch to seal). Pour cream into a small bowl and brush all over dough. Sprinkle sugar evenly over dough.\nPlace galette in oven and immediately reduce heat to 375°F. Bake, rotating halfway through, until crust is deep golden brown everywhere, fruit is softened, and juices are bubbling, 45–50 minutes. Let galette cool 2 hours before serving.\nServe galette with whipped cream or ice cream if desired.","Image":"//20fix.com/xfood/img/peach-plum-galette.jpg"},{"id":"613","Title":"Cucumber and Peach Salad with Herbs","Ingredients":{"1":"1 shallot, finely chopped","2":"Kosher salt","3":"1 lemon","4":"2 Tbsp. Katz’s Sauvignon Blanc vinegar or other white wine vinegar","5":"2 lb. mixed heirloom cucumbers, sliced into1/4-inch thick wedges and rounds","6":"1 English hothouse cucumber, halved lengthwise, sliced crosswise","7":"Kosher salt","8":"2 lb. yellow peaches, sliced into 3/4-inch thick wedges","9":"4 oz. mild feta, crumbled","10":"Freshly ground black pepper","11":"Handful of basil leaves, torn if large","12":"Handful of mint leaves, torn if large","13":"1 lemon, halved"},"Instructions":"Place shallot in a small bowl and season with a big pinch of salt. Finely grate zest from lemon into bowl; cut lemon in half and squeeze in juice. Add vinegar and toss to combine. Let sit 10 minutes.\nPlace cucumbers in a medium bowl and season with salt. Spoon half of vinaigrette over and toss gently to coat.\nPlace peaches in a serving bowl or on a platter and season with salt. Spoon remaining vinaigrette over and toss gently with your hands to coat.\nAdd cucumbers to peaches; toss gently again just to combine. Add feta; season with salt and pepper. Top salad with basil and mint and squeeze lemon over.","Image":"//20fix.com/xfood/img/cucumber-and-peach-salad-with-herbs.jpg"},{"id":"639","Title":"White Peach and Bourbon Vanilla Ice-Cream","Ingredients":{"1":"1 quart water","2":"1 1/2 cups (330g) caster (superfine) sugar","3":"8 medium white peaches (1.2kg)","4":"2 cups (500ml) milk","5":"1 cup (250ml) half-and-half","6":"1 teaspoon vanilla bean paste or vanilla extract","7":"8 egg yolks","8":"2/3 cup (150g) caster (superfine) sugar, extra","9":"1/4 cup (60ml) bourbon","10":"18 store-bought amaretti cookies (65g), crushed to serve"},"Instructions":"Place the water and sugar in a large saucepan over high heat, bring to the boil and stir until the sugar is dissolved. Add the peaches, cover with a round of non-stick baking paper and weigh down with a small plate to submerge. Reduce the heat to medium and cook for 15–20 minutes or until soft. Drain the peaches, reserving the syrup. Allow to cool slightly before peeling. Refrigerate half the peaches for 1–2 hours or until cold. Cut the remaining peaches in half, discarding the stones, and place in a food processor. Process until smooth and refrigerate until cold.\nPlace the milk, cream and vanilla in a medium saucepan over high heat and stir until just boiling. Remove from the heat and set aside. Place the egg yolks and extra sugar in a large bowl and whisk until well combined. Gradually pour the milk mixture into the egg mixture, whisking to combine. Return the mixture to the saucepan over low heat and cook, stirring, for 8 minutes or until the custard is thick and coats the back of a spoon. Transfer to a large bowl, cover with plastic wrap and refrigerate for 1–2 hours or until cold.\nAdd the bourbon and the peach puree to the custard and whisk to combine. Pour into a metal (not glass) brownie pan. Freeze for 8 hours or overnight until set.\nCut the ice-cream into squares. In batches, place the squares in the cleaned food processor and process until smooth. Return the mixture to the tin and freeze for 1 hour or until firm.\nScoop the ice-cream into serving bowls. Drizzle with the reserved peach syrup and sprinkle with the amaretti. Serve with the whole poached peaches.","Image":"//20fix.com/xfood/img/white-peach-and-bourbon-vanilla-ice-cream.jpg"},{"id":"1082","Title":"Peach Lassi Sorbet with Crushed Blackberries","Ingredients":{"1":"4 medium peaches, peeled, chopped, frozen (about 4 cups)","2":"1/2 cup plain whole-milk Greek yogurt","3":"2 Tbsp. vodka","4":"1/4 tsp. kosher salt","5":"1/4 cup plus 2 Tbsp. honey","6":"6 oz. fresh blackberries, halved","7":"2 tsp. fresh lemon juice"},"Instructions":"Process peaches, yogurt, vodka, salt, and 1/4 cup honey in a food processor or blender until smooth. Pour peach mixture into a loaf pan (a metal pan will conduct cold more efficiently than tempered glass) and place a piece of parchment paper on top, pressing directly onto surface. Freeze until sorbet is firm, about 6 hours.\nA little before serving, lightly crush half of the blackberries in a small bowl. Add lemon juice, remaining berries, and remaining 2 Tbsp. honey and let sit, tossing occasionally, until berries have released some of their juices, about 20 minutes.\nScoop sorbet into bowls and top with macerated blackberries.\nSorbet can be made 3 days ahead. Keep frozen. Thaw in refrigerator 30 minutes before scooping into bowls.","Image":"//20fix.com/xfood/img/peach-lassi-sorbet-with-crushed-blackberries.jpg"},{"id":"1104","Title":"Peaches and Tomatoes with Burrata and Hot Sauce","Ingredients":{"1":"2 Tbsp. extra-virgin olive oil","2":"2 Tbsp. mild hot sauce (such as Crystal or Frank’s)","3":"2 tsp. unseasoned rice vinegar","4":"2 tsp. honey","5":"Kosher salt","6":"3 ripe peaches or nectarines, cut into wedges","7":"2 large ripe tomatoes or 1 lb. mixed tomatoes, sliced","8":"1 (8-oz.) ball burrata or fresh mozzarella, torn into large pieces","9":"Tarragon sprigs (for serving)","10":"Flaky sea salt"},"Instructions":"Whisk oil, hot sauce, vinegar, and honey in a small bowl until honey is dissolved; season with kosher salt. Toss peaches, tomatoes, and half of dressing in a medium bowl; let sit 5 minutes.\nTransfer fruit salad to a platter. Top with burrata and drizzle with remaining dressing. Scatter a few torn tarragon sprigs over and season with sea salt.","Image":"//20fix.com/xfood/img/peaches-and-tomatoes-with-burrata-and-hot-sauce.jpg"},{"id":"1145","Title":"Cinnamon-Oat Peach Crisp","Ingredients":{"1":"5 lb. medium peaches (about 12), peeled, sliced 1/2\" thick","2":"2/3 cup granulated sugar","3":"2 Tbsp. plus 1 cup all-purpose flour","4":"2 cups old-fashioned oats","5":"2/3 cup (packed) light brown sugar","6":"4 tsp. ground cinnamon","7":"1 tsp. kosher salt","8":"1 cup (2 sticks) chilled unsalted butter, cut into small pieces","9":"2 pints vanilla ice cream"},"Instructions":"Toss peaches, granulated sugar, and 2 Tbsp. flour in a large bowl to combine. Let sit, tossing occasionally, 30 minutes.\nPlace a rack in center of oven; preheat to 350°F.\nMeanwhile, whisk oats, brown sugar, cinnamon, salt, and remaining 1 cup flour in a large bowl to combine. Using an electric mixer on low speed, gradually add butter. Once it has all been added, increase speed to medium-high and beat until dry ingredients are incorporated (there should be no dry bits left in the bowl), about 3 minutes.\nScrape peaches and any juices into a 13x9\" baking dish. Evenly scatter oat topping over peaches and bake crisp until peaches are soft, fruit juices are bubbling, and topping is a deep golden brown, 60–70 minutes. Transfer baking dish to a wire rack and let crisp cool 1 hour.\nDivide among bowls and top with large scoops of ice cream.","Image":"//20fix.com/xfood/img/cinnamon-oat-peach-crisp.jpg"},{"id":"1179","Title":"Pork Tenderloin with Peach-Mustard Sauce","Ingredients":{"1":"2 large ripe peaches, peeled, cut into small pieces","2":"1/4 cup ketchup","3":"3 Tbsp. Dijon mustard","4":"1 tsp. light brown sugar","5":"1/2 tsp. freshly ground black pepper","6":"1/2 tsp. (or more) kosher salt","7":"2 pork tenderloins (about 1 lb. each)","8":"4 tsp. kosher salt","9":"1 tsp. freshly cracked black pepper","10":"Vegetable oil (for grill)","11":"1/2 cup peach preserves, warmed"},"Instructions":"Purée peaches, ketchup, mustard, brown sugar, pepper, and 1/2 tsp. salt in a blender until mixture is smooth and creamy. Taste sauce and season with more salt if needed.\nSprinkle pork with salt and pepper and rub all over. Let sit at room temperature 1 hour. Meanwhile, prepare a grill for medium heat and brush grate with oil.\nBrush pork with some preserves. Grill, turning every 4 minutes or so and brushing with any remaining preserves, until charred on all sides and an instant-read thermometer inserted into the thickest part registers 130°F, 10–12 minutes. Transfer to a cutting board and let rest 10 minutes. Slice 1/2\" thick.\nServe sliced pork with Peach-Mustard Sauce alongside.\nSauce can be made 1 day ahead. Cover and chill.","Image":"//20fix.com/xfood/img/grilled-pork-tenderloin-with-peach-mustard-sauce.jpg"},{"id":"1182","Title":"Southern \"One-Cup\" Peach Cobbler","Ingredients":{"1":"1 1/2 lb. peaches, pitted, cut into 1/2\"-thick wedges","2":"2 tsp. finely grated lemon zest","3":"1/4 cup fresh lemon juice","4":"1 cup sugar, divided","5":"3/4 tsp. kosher salt, divided","6":"1/2 cup (1 stick) unsalted butter","7":"1 cup all-purpose flour","8":"1 1⁄2 tsp. baking powder","9":"1 cup whole milk","10":"1 tsp. vanilla extract","11":"Vanilla ice cream or whipped cream (for serving; optional)"},"Instructions":"Toss peaches, lemon zest, lemon juice, 1/4 cup sugar, and 1/4 tsp. salt in a large bowl. Let sit, stirring occasionally, until saucy, about 15 minutes.\nPreheat oven to 350°F. Place butter in a 13x9\" glass or ceramic baking dish and heat in oven until melted, 8–10 minutes. Remove pan from oven.\nMeanwhile, whisk flour, baking powder, and remaining 3/4 cup sugar and 1/2 tsp. salt in another large bowl. Add milk and vanilla and whisk until batter is smooth with no lumps. Pour evenly over melted butter in baking dish (do not mix). Spoon fruit mixture and 3 Tbsp. of the accumulated juices evenly over batter.\nBake cobbler, rotating pan halfway through, until batter is puffed and lightly golden across the surface and browned around the edges, 40–45 minutes. Let cool 10 minutes.\nServe with ice cream or whipped cream if desired.","Image":"//20fix.com/xfood/img/southern-one-cup-peach-cobbler.jpg"},{"id":"1215","Title":"Peach Caprese","Ingredients":{"1":"1/2 cup white balsamic vinegar","2":"1/4 cup extra virgin olive oil","3":"2 white peaches, chilled","4":"2 yellow peaches, chilled","5":"2 (4-ounce) fresh mozzarella balls, preferably water-packed","6":"10 fresh basil leaves, torn","7":"1 teaspoon flaky salt","8":"1 teaspoon freshly ground black pepper"},"Instructions":"In an 8-ounce screw-top jar, combine the vinegar and oil. Screw on the lid and shake well. Refrigerate until well chilled. The dressing can be made ahead and stored in the jar in the refrigerator for up to 1 week.\nRemove the pits from the peaches and cut them into 1/2-inch-thick slices or wedges. Drain the mozzarella if necessary and pat it dry. Use a sharp knife to cut it into 1/4-inch-thick slices.\nOn a serving platter, decoratively arrange slices of the white peaches, yellow peaches, and mozzarella. Scatter the basil leaves on top, drizzle over the dressing, and sprinkle the flaky salt and pepper on top. Serve at once.","Image":"//20fix.com/xfood/img/peach-caprese-salad-recipe.jpg"},{"id":"1231","Title":"Peaches and Shaved Fennel Salad with Red Pepper","Ingredients":{"1":"5 large peaches (about 2 lb. total), cut into 1/2\"-thick wedges","2":"3 Tbsp. Chardonnay vinegar or white wine vinegar, divided","3":"Kosher salt","4":"1 small fennel bulb, halved, very thinly sliced on a mandoline, plus coarsely chopped fennel fronds","5":"1 Tbsp. fresh lemon juice","6":"Extra-virgin olive oil (for drizzling)","7":"Aleppo-style or other mild red pepper flakes (for serving)"},"Instructions":"Toss peaches in a large bowl with 2 Tbsp. vinegar and pinch of salt to coat. Arrange peaches on a platter and spoon any juices left in bowl over top.\nToss fennel in the same bowl with lemon juice and remaining 1 Tbsp. vinegar to coat; season with salt.\nScatter dressed fennel and fennel fronds over peaches on platter and drizzle with oil. Sprinkle with some red pepper flakes.","Image":"//20fix.com/xfood/img/peaches-and-shaved-fennel-salad-with-red-pepper.jpg"},{"id":"1805","Title":"3-Ingredient Ginger-Peach Ice Cream Floats","Ingredients":{"1":"4 small peaches (about 1 pound)","2":"4 cans ginger beer (6 cups), divided","3":"1 pint vanilla ice cream"},"Instructions":"Cook peaches in a large pot of boiling water 1 minute, then submerge in ice water. Slip off skins. Slice into 1/4\" wedges.\nBring peaches and 3 cups ginger beer to a boil in a medium saucepan over high heat. Reduce heat to medium-low, cover, and simmer until peaches are fork-tender, about 5 minutes. Let cool completely.\nTo assemble floats, divide peaches among tall glasses and pour 1 Tbsp. poaching liquid over each; reserve remaining poaching liquid for another use. Top with 2 scoops of ice cream, then pour remaining 3 cups ginger beer over. Serve with spoons and straws.\nPeaches can be poached up to 3 days ahead. Transfer to an airtight container and chill.","Image":"//20fix.com/xfood/img/3-ingredient-ginger-peach-ice-cream-floats.jpg"},{"id":"1806","Title":"3-Ingredient Peach Crisp with Granola Topping","Ingredients":{"1":"6 medium peaches (about 2 pounds)","2":"1/4 cup (packed) light brown sugar","3":"Pinch of kosher salt","4":"2 cups granola (look for granola that holds together in clusters)","5":"2 tablespoons olive oil","6":"A 2-quart (8x8\") baking dish"},"Instructions":"Preheat oven to 375°F. Slice peaches, leaving skin on, into 1/3\" wedges; discard pits (you should have about 6 cups sliced fruit).\nToss fruit, brown sugar, and salt in baking dish. Bake fruit until juices are bubbling and most of the liquid is evaporated, 35–40 minutes.\nMeanwhile, toss granola with oil in a medium bowl.\nSprinkle granola over fruit, then continue to bake until warmed through and golden brown, 7–10 minutes. Let cool 5 minutes before serving.","Image":"//20fix.com/xfood/img/3-ingredient-peach-crisp-with-granola-topping.jpg"},{"id":"1852","Title":"Savory Peach and Cucumber Salad","Ingredients":{"1":"1/3 cup raw pumpkin seeds","2":"1 tablespoon plus 1/4 cup olive oil","3":"Kosher salt","4":"1 cardamom pod","5":"1 whole clove","6":"1/2 teaspoon coriander seeds","7":"1/2 teaspoon cumin seeds","8":"1 serrano chile, finely grated","9":"1 garlic clove, finely grated","10":"3 tablespoons finely chopped parsley","11":"3 tablespoons finely chopped cilantro, plus leaves with tender stems for serving","12":"3 tablespoons (or more) fresh lemon juice","13":"2 medium Persian cucumbers, cut into 1-inch pieces","14":"4 medium yellow peaches, cut into 1–1 1/2-inch pieces","15":"1 avocado, cut into 1-inch pieces","16":"1 teaspoon toasted sesame seeds","17":"A spice mill or mortar and pestle"},"Instructions":"Preheat oven to 350°F. Toast pumpkin seeds on a rimmed baking sheet, tossing halfway through, until golden brown and slightly puffed, 5–7 minutes; let cool. Transfer to a small bowl and toss with 1 Tbsp. oil; season with salt.\nMeanwhile, toast cardamom, clove, coriander, and cumin in a dry small skillet over medium heat, tossing occasionally, until fragrant, about 2 minutes. Remove seeds from cardamom pod; discard pod. Finely grind seeds along with other spices in spice mill or with mortar and pestle. Mix in a large bowl with chile, garlic, parsley, chopped cilantro, lemon juice, and remaining 1/4 cup oil; season with salt. Add cucumber and toss. Let sit 5 minutes.\nAdd peaches, avocado, and half of the pumpkin seeds to cucumber mixture and season generously with salt; toss to coat. Taste and adjust seasoning with more salt and/or lemon juice.\nServe topped with sesame seeds, cilantro leaves, and remaining pumpkin seeds.","Image":"//20fix.com/xfood/img/savory-peach-and-cucumber-salad.jpg"},{"id":"1872","Title":"Peach and Pomegranate Pavlova","Ingredients":{"1":"1 x My Favorite Meringue recipe","2":"2 tbsp freeze-dried raspberries, crushed to a fine powder","3":"300ml (1 1/4 cups) heavy cream","4":"4 ripe peaches, pitted and thinly sliced","5":"1 pomegranate, deseeded"},"Instructions":"Preheat the oven to 250°F/120°C/100°C fan/the lowest gas mark and line a baking sheet with baking parchment or a reusable baking sheet.\nMake the meringue mixture then sprinkle the raspberry powder over the top and fold through a few times. You want to see ripples of raspberry, so don’t mix it in completely. Spoon onto the baking sheet and spread it out into a large rectangle that is the same thickness all over. Bake for three hours so the meringue is completely dried out and crisp. To ensure a crunchy shell and soft, chewy middle, I like to turn the oven off and leave the meringue to cool in the oven overnight. If you don’t have time, just leave it to cool on the tray until completely cold.\nWhip the cream into soft peaks and just before serving, spoon it onto the top of the meringue. Arrange the peach slices on top of the cream, fanning them out, then sprinkle the pomegranate seeds on top.","Image":"//20fix.com/xfood/img/peach-and-pomegranate-pavlova.jpg"},{"id":"1874","Title":"Fresh Peach Crostata","Ingredients":{"1":"3 medium (or 2 large) ripe peaches","2":"3 tablespoons plus 5 tablespoons sugar","3":"1/4 cup all-purpose flour, plus more for dusting","4":"3 tablespoons Earth Balance, at room temperature","5":"1/4 teaspoon nutmeg","6":"1 teaspoon almond extract","7":"1/2 recipe Flaky Pastry Dough","8":"2 tablespoons sliced almonds (optional)"},"Instructions":"Preheat the oven to 325°F. Bring a small pot of water to a boil over high heat. Using a small, sharp knife, cut a small \"x\" into the skin at the bottom of each peach. Place the peaches in boiling water for 20 seconds. Pour into a colander and rinse under cool running water. Starting at the \"x,\" peel the skin from the peaches and discard. Slice the peaches and place in a small bowl, sprinkling with the 3 tablespoons sugar and set aside.\nIn a medium bowl, combine the remaining 5 tablespoons sugar with the flour, Earth Balance, nutmeg, and almond extract. Using your fingers, rub the mixture together until incorporated and set aside.\nDust a clean work surface with flour. Roll the pastry dough out into a circle about 13 inches across, trimming the edges so they are even. Transfer the dough to a sheet of parchment paper. Spread two-thirds of the sugar-flour mixture on the bottom of the crust, leaving a 2-inch border around the edge. Place two-thirds of the peaches over the flour mixture. Sprinkle the remaining flour mixture over the peaches. Add the remaining peaches on top. Fold the outer edge of the pastry dough in over the crostata to create a crust, pinching excess dough to secure.\nLeaving the crostata on the parchment paper, transfer to a baking sheet. Sprinkle the sliced almonds on top and bake until the crust is golden brown and the filling is bubbly, about 50 minutes. Remove from the oven and allow to cool on a wire rack for at least 10 minutes before serving. Serve hot, warm, or at room temperature.","Image":"//20fix.com/xfood/img/fresh-peach-crostata.jpg"},{"id":"1905","Title":"3-Ingredient Pesto-Grilled Chicken with Peaches","Ingredients":{"1":"1 3/4 cups store-bought or homemade pesto, divided","2":"1/2 cup plus 2 tablespoons vegetable oil, divided, plus more for grill","3":"1 3/4 teaspoons kosher salt, divided","4":"3/4 teaspoon freshly ground black pepper, divided","5":"8 small bone-in, skin-on chicken thighs (about 3 pounds)","6":"4 ripe peaches, halved"},"Instructions":"Whisk 1 1/2 cups pesto, 1/2 cup oil, 1 tsp. salt, and 1/2 tsp. pepper in a medium bowl until smooth. Add chicken to bowl and slide your hand between skin and meat to loosen skin. Rub half of pesto mixture under skin, then half over outside. Cover bowl with plastic wrap and chill at least 1 hour or up to overnight.\nPrepare a grill for medium-high heat or heat a grill pan or cast-iron skillet over medium-high; oil grate or pan. Season chicken with remaining 3/4 tsp. salt and 1/4 tsp. pepper. Grill chicken, skin side down, covered, until golden brown and lightly charred, 7–9 minutes. Turn and grill until cooked through and an instant-read thermometer inserted into thickest part of thigh registers 165°F, 5–7 minutes. Transfer chicken to a plate.\nBrush peach halves with oil. Reduce heat to medium and grill peaches, cut side down, until warmed through, 2–3 minutes.\nMeanwhile, whisk remaining 1/4 cup pesto and 2 Tbsp. oil in a small bowl. Arrange chicken and peaches on a platter and drizzle pesto sauce over. Serve remaining sauce alongside.","Image":"//20fix.com/xfood/img/3-ingredient-pesto-grilled-chicken-with-peaches.jpg"},{"id":"1912","Title":"Peach-Bourbon Jam","Ingredients":{"1":"1/2 vanilla bean","2":"1 pound ripe but firm yellow peaches, halved, pitted, and cut into 1/2-inch pieces (3 cups)","3":"1 cup sugar","4":"1/2 cup peeled and grated Granny Smith apple (1/2 apple)","5":"1 cup bourbon","6":"1 tablespoon bottled lemon juice"},"Instructions":"Place 2 small plates in freezer to chill. Cut vanilla bean in half lengthwise. Using tip of paring knife, scrape out seeds. Stir vanilla bean and seeds, peaches, sugar, apple, bourbon, and lemon juice together in large saucepan, cover, and let sit for 20 minutes.\nBring mixture to boil, stirring often, over medium-high heat. Once sugar is completely dissolved, reduce heat to medium-low, cover, and simmer, stirring occasionally, until peaches are softened, about 10 minutes.\nOff heat, crush fruit with potato masher until mostly smooth. Return mixture to boil over medium-high heat and cook, stirring and adjusting heat as needed, until mixture resisters 217°F–220°F, about 6 minutes. (Temperature will be lower at higher elevations.) Remove pot from heat and discard vanilla bean.\nTo test consistency, place 1 teaspoon jam on chilled plate and freeze for 2 minutes. Drag your finger through jam on plate; jam has correct consistency when your finger leaves distinct trail. If runny, return pot to heat and simmer for 1 to 3 minutes longer before retesting. Skim any foam from surface of jam using spoon.\nMeanwhile, place two 1-cup jars in bowl and place under hot running water until heated through, 1 to 2 minutes; shake dry.\nUsing funnel and ladle, portion hot jam into hot jars. Let cool to room temperature, cover, and refrigerate until jam is set, 12 to 24 hours. (Jam can be refrigerated for up to 2 months)","Image":"//20fix.com/xfood/img/peach-bourbon-jam.jpg"},{"id":"1924","Title":"Nectarines and Peaches with Lavender Syrup","Ingredients":{"1":"1/2 cup pecans","2":"3 tablespoons honey","3":"2 tablespoons plus 1/4 cup sugar","4":"1 sprig rosemary","5":"1 tablespoon dried lavender buds","6":"Kosher salt","7":"3 ripe white or yellow nectarines, cut into wedges","8":"3 ripe white or yellow peaches, cut into wedges","9":"2 teaspoons finely grated lemon zest","10":"1/2 cup crumbled Gorgonzola, divided"},"Instructions":"Preheat oven to 350°F. Toast pecans on a rimmed baking sheet, stirring once, until slightly darkened in color and fragrant, 10–12 minutes. Let cool.\nMeanwhile, bring honey, 2 Tbsp. sugar, and 3 Tbsp. water to a simmer in a small saucepan over medium-high heat, swirling occasionally until sugar is dissolved. Add rosemary and lavender and remove from heat. Let sit 5 minutes. Remove rosemary and let syrup cool.\nBring a pinch of salt, remaining 1/4 cup sugar, and 1 Tbsp. water to a boil in another small saucepan, stirring to dissolve sugar. Cook (without stirring) until sugar turns a light amber color, about 2 minutes. Add pecans and cook, stirring constantly, until nuts are coated and caramel is a dark amber color, about 2 minutes. Immediately scrape out onto a parchment-lined baking sheet and spread out into a single layer; let cool. Break into smaller pieces.\nToss nectarines, peaches, lemon zest, and 1/4 cup syrup in a large bowl to coat. Let sit 5 minutes. Gently toss in half of Gorgonzola and half of candied pecans; taste and season with salt if needed. Transfer to a platter. Top with remaining Gorgonzola and candied pecans.\nSyrup can be made 1 month ahead; cover and chill. Pecans can be candied 1 day ahead; store airtight at room temperature.","Image":"//20fix.com/xfood/img/nectarine-and-peach-salad-with-pecans-blue-cheese-and-lavender-syrup.jpg"},{"id":"2656","Title":"Blueberry Peach Slab Pie","Ingredients":{"1":"5 cups all-purpose flour, divided, plus more for rolling out dough","2":"2 1/2 teaspoons salt, divided","3":"1 1 1/4 cup plus 3 tablespoons granulated sugar, divided","4":"4 sticks (1 pound) unsalted butter, cut into pieces, divided into 2 bowls, and frozen 15 minutes, plus more for baking sheet","5":"1 large egg","6":"1 tablespoon whole milk","7":"3 pounds yellow peaches (6 to 8 medium peaches)","8":"4 pints blueberries (about 8 cups)","9":"1/2 cup cornstarch","10":"2 tablespoons vanilla extract","11":"3 tablespoons lemon juice","12":"1 tablespoon sanding sugar or sugar in the raw","13":"2 13x18-inch rimmed baking sheets"},"Instructions":"In the bowl of a food processor, pulse 2 1/2 cups flour, 1 teaspoon salt, and 1 1/2 tablespoons sugar. Add half the butter and pulse until coarse, pea-sized crumbs appear. With the machine running, add 1/4 cup ice water and process until the dough just holds together. Squeeze a small amount of dough between your fingers and if it is very crumbly, add more ice water, 1 tablespoon at a time (2 tablespoons maximum). Do not over process.\nTurn dough out onto a lightly floured surface and push together into a rough ball. Knead a few times to combine. Flatten into a disc, cover with plastic wrap, and refrigerate at least 1 hour or overnight. Repeat the same procedure with remaining 2 1/2 cups flour, 1 teaspoon salt, 1 1/2 tablespoons sugar, and butter. Flatten into a second disc and refrigerate at least 1 hour or overnight.\nPreheat oven to 425°F. Position one oven rack on the bottom rung and one in the center of the oven. Completely line bottom rack with foil to catch filling drips and place one 13x18-inch rimmed baking sheet on top of foil to preheat.\nGrease another 13x18-inch rimmed baking sheet with butter. On a floured surface, roll out 1 disc of dough into a 14x19-inch rectangle, about 1/8-inch thick. Roll dough onto rolling pin and unfurl onto greased baking sheet. Press dough into baking sheet and over rimmed edge; trim dough at rimmed edge. Refrigerate 30 minutes. Roll out second disc of dough to the same size, transfer to a large cutting board or 2 pieces of parchment taped together, and refrigerate 30 minutes.\nIn a small bowl, whisk together the egg and milk to create an egg wash, set aside. Bring a large pot of water to a boil and fill a large bowl with ice water. Using a paring knife, lightly score the bottom of each peach with an \"x\". Drop peaches into water for 1 to 2 minutes to loosen skins and transfer to the ice water bath. Once cool enough to handle, remove the skins. Slice into 1/2-inch thick wedges. Place sliced peaches in a large bowl with blueberries, remaining 1/2 teaspoon salt, 1 1/4 cups sugar, cornstarch, vanilla, and lemon. Toss well to combine. Fill the dough lined baking sheet with the fruit mixture.\nBrush the outside edge of filled dough with egg wash. Top with the second dough rectangle. Press top and bottom crusts together and trim top crust to rimmed edge of baking sheet. Tuck and fold edges into base of baking sheet and crimp or decorate as desired. Brush top crust with egg wash and sprinkle with sanding sugar. Using a paring knife, cut vents in the top crust to release steam.\nSlide the filled baking sheet into the preheated baking sheet and bake on bottom rack until the crust begins to turn golden, about 25 minutes. Rotate stacked sheets, move to center rack, and reduce oven to 350°F. Keep foil on bottom rack. Continue baking, rotating sheet again half way through, until the crust is golden brown and you can see the thickened juices bubbling, 60 to 70 minutes more. Cover crust with foil if it begins to darken too much before juices are bubbling. Cool on a rack at least 2 hours to allow juices to set before slicing.","Image":"//20fix.com/xfood/img/blueberry-peach-slab-pie-51249610.jpg"},{"id":"2661","Title":"Peach Parfait With Salted Graham Cracker Crumble","Ingredients":{"1":"5 graham crackers, finely crushed","2":"1/3 cup all-purpose flour","3":"1 teaspoon kosher salt","4":"1/4 cup plus 1 teaspoon granulated sugar","5":"6 tablespoons unsalted butter, melted, plus 2 tablespoons room temperature","6":"2 ripe peaches, cut into 1/3-inch wedges","7":"2 tablespoons light brown sugar","8":"1 tablespoon plus 1 teaspoon fresh lemon juice","9":"1 cup fresh raspberries","10":"1 cup heavy cream"},"Instructions":"Preheat oven to 325°F. Pulse graham cracker crumbs, flour, salt, and 1/4 cup granulated sugar in a food processor until finely ground. Transfer to a medium bowl and add melted butter; mix until a few large clumps form. Spread out crumble on a rimmed baking sheet and bake, shaking once, until golden, 12–15 minutes. Let cool.\nMeanwhile, toss peaches, brown sugar, and 1 Tbsp. lemon juice in a medium bowl. Heat remaining 2 Tbsp. butter in a large skillet over medium; cook peaches, tossing often, until sugar is dissolved and peaches are soft, about 5 minutes. Let cool slightly.\nMash raspberries with a spoon in a small bowl, then mix in remaining 1 tsp. granulated sugar and remaining 1 tsp. lemon juice. Let sit 5 minutes for raspberries to soften.\nBeat cream in a medium bowl to medium-soft peaks. Divide warm peaches among bowls and top with whipped cream, raspberries, and graham cracker crumble.","Image":"//20fix.com/xfood/img/peach-parfait-with-salted-graham-cracker-crumble.jpg"}],"t":131,"p":{"limitstart":0,"limit":25,"total":131,"pagesStart":1,"pagesStop":6,"pagesCurrent":1,"pagesTotal":6}}}