{
    "ingredient": "Lima bean",
    "recipes": {
        "s": 1,
        "d": [
            {
                "id": "8896",
                "Title": "Spring Greens and Lima Bean Soup",
                "Ingredients": {
                    "1": "1 cup dried large lima beans",
                    "2": "2 bunches dandelion greens, Swiss chard, or mustard greens (1 1/2 pounds total), tough bottom stems removed, leaves cut into 2-inch pieces",
                    "3": "4 tablespoons extra-virgin olive oil, divided",
                    "4": "2 celery stalks, finely chopped",
                    "5": "2 carrots, peeled, finely chopped",
                    "6": "1 large onion, finely chopped",
                    "7": "8 cups low-salt chicken broth",
                    "8": "1 14 1/2-ounce can diced tomatoes in juice, drained",
                    "9": "1/2 cup freshly grated Parmesan cheese"
                },
                "Instructions": "Place beans in large bowl. Pour enough cold water over to cover; let soak overnight.\nDrain beans; place in heavy large pot and add enough water to cover by 2 inches. Bring to boil. Reduce heat to medium-low and simmer until beans are just tender, about 45 minutes. Add greens to pot; cook until tender, 4 to 5 minutes. Drain; set aside.\nHeat 3 tablespoons oil in same pot over medium heat. Add celery, carrots, and onion. Sauté until onion is translucent, about 6 minutes. Add broth, tomatoes, and bean mixture. Reduce heat to low. Simmer 20 minutes to allow flavors to blend. Cover and let soup rest 15 minutes. Ladle soup into bowls. Sprinkle with cheese and drizzle with remaining 1 tablespoon oil.",
                "Image": "//20fix.com/xfood/img/spring-greens-and-lima-bean-soup-352537.jpg"
            },
            {
                "id": "9187",
                "Title": "Lima Beans with Wild Mushrooms and Chard",
                "Ingredients": {
                    "1": "1 pound dried lima beans",
                    "2": "3 1 1/2-ounce packages assorted dried wild mushrooms",
                    "3": "2 tablespoons extra-virgin olive oil",
                    "4": "1 large onion, chopped",
                    "5": "4 garlic cloves, chopped",
                    "6": "1/4 teaspoon dried crushed red pepper",
                    "7": "1/4 teaspoon dried thyme",
                    "8": "6 cups (lightly packed) sliced stemmed Swiss chard"
                },
                "Instructions": "Place lima beans in large bowl with enough water to cover by 5 inches. Soak overnight.\nBring 2 cups water and dried mushrooms to boil in small saucepan. Using slotted spoon, transfer mushrooms to medium bowl; reserve liquid in saucepan.\nHeat oil in heavy large pot over medium heat. Add onion and garlic; sauté until onion is tender, 10 minutes. Drain beans; add to pot. Pour in mushroom liquid, leaving sediment behind. Add 6 cups water. Bring to simmer; skim foam from top. Stir in red pepper and thyme. Simmer partially covered until beans are tender, 45 minutes. Season with salt. Chop mushrooms; add to pot. Simmer uncovered over medium heat until beans and mushrooms are very tender, stirring occasionally and adding water to thin as needed, about 15 minutes longer. DO AHEAD: Can be made 3 days ahead. Cool, then cover and chill. Rewarm beans before continuing.\nAdd chard to beans. Cover pot; cook until chard is tender, stirring often, about 8 minutes. Season with salt and pepper.",
                "Image": "//20fix.com/xfood/img/lima-beans-with-wild-mushrooms-and-chard-351259.jpg"
            },
            {
                "id": "9747",
                "Title": "Succotash of Fresh Corn, Lima Beans, Tomatoes and Onions",
                "Ingredients": {
                    "1": "2 tablespoons extra-virgin olive oil",
                    "2": "1 1/2 cups chopped onion",
                    "3": "Coarse kosher salt",
                    "4": "1 large garlic clove, minced",
                    "5": "3 cups chopped red tomatoes (about 1 1/2 pounds)",
                    "6": "2 1/4 cups corn kernels cut from 4 ears of corn (preferably 2 ears of white corn and 2 ears of yellow corn)",
                    "7": "2 cups fresh lima beans (from about 2 pounds pods) or 10 to 11 ounces frozen lima beans or baby butter beans, thawed",
                    "8": "3 tablespoons thinly sliced fresh basil"
                },
                "Instructions": "Heat oil in heavy large skillet over medium heat. Add onion and sprinkle with coarse salt. Sauté until soft and translucent, about 5 minutes. Add garlic; stir until fragrant, about 1 minute. Add tomatoes, corn, and lima beans. Reduce heat to medium-low, cover, and simmer until corn and lima beans are tender and tomatoes are soft, about 20 minutes, stirring occasionally. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill. Rewarm before continuing.\nStir in basil and serve.",
                "Image": "//20fix.com/xfood/img/succotash-of-fresh-corn-lima-beans-tomatoes-and-onions-350129.jpg"
            },
            {
                "id": "12306",
                "Title": "Grilled Halibut with Lima Bean and Roasted Tomato Sauce",
                "Ingredients": {
                    "1": "4 large tomatoes (preferably heirloom; 2 lb total)",
                    "2": "3 garlic cloves, cut lengthwise into slivers",
                    "3": "1 teaspoon salt",
                    "4": "1/2 teaspoon black pepper",
                    "5": "2 tablespoons olive oil",
                    "6": "2 lb fresh lima or fava beans in pod, shelled, or 10 oz frozen baby lima beans or shelled edamame (soybeans; 2 cups), not thawed",
                    "7": "1/2 cup chopped fresh basil",
                    "8": "1 to 2 tablespoons fresh lemon juice",
                    "9": "6 (6-oz) pieces halibut fillet (1 1/4 to 1 1/2 inches thick)"
                },
                "Instructions": "Put oven rack in middle position and preheat oven to 450°F.\nCore tomatoes, then halve crosswise. Stud the cut side of each half with garlic slivers, then sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper (total). Arrange tomatoes, cut sides up, in a lightly oiled shallow baking pan, then drizzle evenly with 1 tablespoon oil. Roast until just soft and wilted, 15 to 20 minutes.\nWhile tomatoes roast, cook beans in a 6- to 8-quart pot of boiling salted water , uncovered, until just tender, 5 to 8 minutes. Drain in a colander and cool slightly, about 10 minutes. When beans are cool enough to handle, gently slip off skins. Coarsely chop beans and roasted tomatoes, then toss with basil, remaining tablespoon oil, remaining 1/2 teaspoon salt, remaining 1/4 teaspoon pepper, and lemon juice (to taste).\nPrepare grill for cooking over medium-hot charcoal (moderate heat for gas). If using a charcoal grill, open vents on bottom of grill, then light charcoal. When charcoal turns grayish white (about 15 minutes from lighting), hold your hand 5 inches above grill rack to determine charcoal heat. It is medium-hot when you can hold your hand there for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce to moderate setting.\nPat fish dry and season both sides with salt and pepper. Grill on lightly oiled grill rack, covered only if using gas grill, turning over once, until just cooked through, 6 to 8 minutes total.\nServe fish topped with bean and roasted tomato sauce.",
                "Image": "//20fix.com/xfood/img/grilled-halibut-with-lima-bean-and-roasted-tomato-sauce-232791.jpg"
            },
            {
                "id": "12633",
                "Title": "Roast Leg of Lamb with Mint, Garlic, and Lima Bean Purée",
                "Ingredients": {
                    "1": "1/4 cup olive oil",
                    "2": "1/4 cup finely chopped fresh mint",
                    "3": "1/4 cup finely chopped fresh parsley",
                    "4": "1 tablespoon minced fresh rosemary",
                    "5": "2 garlic cloves, minced",
                    "6": "1 5 1/4-pound boneless leg of lamb, butterflied, trimmed of most fat and sinew",
                    "7": "Coarse kosher salt",
                    "8": "Fresh mint sprigs",
                    "9": "Lima Bean Puree"
                },
                "Instructions": "Preheat oven to 450°F. Mix oil, chopped mint, parsley, rosemary, and garlic in small bowl. Place lamb, cut side up, on work surface. Sprinkle lamb generously with coarse salt and pepper and rub into meat. Spread herb mixture over top of lamb, then roll up, enclosing herb mixture completely. Sprinkle outside of lamb with coarse salt and pepper. Tie lamb with kitchen string at 2-inch intervals. Place lamb in roasting pan. Roast until instant-read thermometer inserted into thickest part of meat registers 130°F for medium-rare, about 1 hour 15 minutes. Remove pan from oven; let lamb rest 15 minutes.\nRemove kitchen string from lamb. Cut lamb into 3/4-inch-thick slices; arrange on platter. Garnish with mint sprigs. Serve with Lima Bean Puree.",
                "Image": "//20fix.com/xfood/img/roast-leg-of-lamb-with-mint-garlic-and-lima-bean-puree-231879.jpg"
            }
        ],
        "t": 5,
        "p": {
            "limitstart": 0,
            "limit": 25,
            "total": 5,
            "pagesStart": 1,
            "pagesStop": 1,
            "pagesCurrent": 1,
            "pagesTotal": 1
        }
    }
}