{"ingredient":"Relish","recipes":{"s":1,"d":[{"id":"253","Title":"Cheesy Chicken Melt With All of the Onions Relish","Ingredients":{"1":"4 teaspoons vegetable oil","2":"2 boneless, skinless chicken breasts, about 1 pound (450g), sliced lengthwise into 4 flat 1⁄2-inch-thick (1.3cm-thick) pieces","3":"1 teaspoon kosher salt","4":"1⁄2 yellow onion, sliced","5":"1 teaspoon distilled white vinegar","6":"1⁄2 red onion, thinly sliced","7":"1⁄2 bunch scallions, white and green parts, thinly sliced","8":"2 tablespoons fried shallots (store-bought is totally great)","9":"3 tablespoons salted butter","10":"4 slices rye bread","11":"4 slices good melting cheese, such as Colby Jack or Muenster"},"Instructions":"Heat a large sauté pan with 2 teaspoons of the vegetable oil over high heat until it is smoking. Season the chicken with 3⁄4 teaspoon of the salt and gently place it in the pan. Cook on one side until almost cooked all the way through, about 5 minutes. Flip the chicken and cook on the other side for about 30 seconds, or until it is no longer pink. Transfer the chicken to a plate to rest.\nImmediately add the yellow onion and the remaining 2 teaspoons vegetable oil to the pan. Stir and cook for 5 minutes, or until the onion is dark and smells amazing but is not burnt. If it’s getting too dark, lower the heat. Add the vinegar, along with the liquid that has collected on the plate where the chicken is resting, and turn the heat to low. Simmer the onion for 2 to 4 minutes, or until the liquid has evaporated. Transfer the onion to a bowl, using a rubber spatula to scrape the pan out completely. When the onion has cooled down a little, about 5 minutes, add the red onion, scallions, fried shallots, and remaining 1⁄4 teaspoon salt and stir to combine.\nMelt 2 tablespoons of the butter in the same pan. Lay out two slices of bread on your work surface and place a slice of cheese on each. Top each piece of cheese with half of the onions, two pieces of chicken, and another slice of cheese, and cover with another slice of bread. Place the sandwiches in the pan with the melted butter. Cook over medium heat, about 3 minutes, until the cheese on the bottom slice is melted and the bread is nicely toasted. Add the remaining 1 tablespoon butter to the pan and flip the sandwiches. Cook them for another 1 to 2 minutes, until the cheese is melted and the bottom is toasty. Remove the sandwiches from the pan, cut them in half, and insert a frilly toothpick or cocktail sword near the top in each half and serve.","Image":"//20fix.com/xfood/img/cheesy-chicken-melt-onion-relish-tyler-kord.jpg"},{"id":"385","Title":"Pol Sambol (Coconut Relish)","Ingredients":{"1":"1 small onion, roughly chopped","2":"1 garlic clove, halved","3":"1 medium tomato, cut into quarters","4":"5 black peppercorns","5":"1 green chilli, deseeded","6":"¾ tsp chilli powder","7":"5 fresh curry leaves","8":"200g (7oz / 2 ½ cups) freshly grated or desiccated (shredded) coconut","9":"1 tsp Maldive fish, crushed (optional)","10":"juice of ½ lime","11":"salt"},"Instructions":"Place the onion, garlic, tomato, black peppercorns, green chilli, chilli powder and curry leaves in a food processor and blitz until you have a fine paste.\nPlace the paste in a medium bowl and add the coconut, Maldive fish (if using) and mix well by hand. Then add the lime juice and salt to taste, mixing well. A few crushed curry leaves can be used as a garnish. Pictured left.","Image":"//20fix.com/xfood/img/pol-sambol-coconut-relish-sri-lanka-the-cookbook.jpg"},{"id":"502","Title":"Sour Cherry Relish","Ingredients":{"1":"1 tablespoon extra virgin olive oil","2":"1 small brown onion, finely chopped","3":"1 tablespoon thyme leaves","4":"500g frozen pitted sour cherries","5":"1 tablespoon finely grated orange rind","6":"1⁄4 cup (60ml) orange liqueur","7":"1⁄3 cup (80ml) red wine vinegar","8":"1 cup (220g) caster (superfine) sugar","9":"Sea salt and cracked black pepper"},"Instructions":"Place the oil in a medium saucepan over medium heat. Add the onion and thyme and cook for 1–2 minutes or until just golden. Add the cherries, orange rind, liqueur, vinegar, sugar, salt and pepper and stir to combine. Bring to the boil and cook for 30–35 minutes or until reduced and glossy. Allow to cool completely at room temperature.","Image":"//20fix.com/xfood/img/sour-cherry-relish.jpg"},{"id":"1278","Title":"Shaved Cauliflower Salad with Coconut-Turmeric Relish","Ingredients":{"1":"1 small or 1/2 large head of cauliflower, core removed","2":"3 Tbsp. olive oil, divided","3":"Kosher salt, freshly ground pepper","4":"Coconut-Turmeric Relish (for serving; optional)"},"Instructions":"Very thinly slice cauliflower on a mandoline into a medium bowl. Drizzle with oil and toss to coat; season with salt and pepper.\nIf using relish, add to cauliflower and toss to coat. Season with more salt and pepper.","Image":"//20fix.com/xfood/img/shaved-cauliflower-salad-with-coconut-turmeric-relish.jpg"},{"id":"1279","Title":"Coconut-Turmeric Relish","Ingredients":{"1":"1/4 cup golden raisins","2":"1/4 cup fresh lemon juice","3":"4 garlic cloves, thinly sliced","4":"1/3 cup extra-virgin olive oil","5":"1/4 cup unsweetened coconut flakes","6":"1 Fresno chile, seeds removed, finely chopped","7":"1 1/2\" piece ginger, peeled, finely grated","8":"1 Tbsp. mustard seeds","9":"1/2 tsp. ground turmeric","10":"Kosher salt, freshly ground pepper"},"Instructions":"Combine raisins and lemon juice in a small bowl; let sit 15–20 minutes for raisins to plump.\nMeanwhile, combine garlic, oil, and coconut in a small saucepan and set over medium-low heat. Cook, swirling pan often, until oil is bubbling and garlic and coconut are golden, 6–8 minutes. Remove from heat immediately and stir in chile, ginger, mustard seeds, and turmeric. Transfer to a heatproof measuring glass and let cool.\nAdd raisins and lemon juice to garlic mixture and toss to coat; season relish with salt.","Image":"//20fix.com/xfood/img/coconut-turmeric-relish.jpg"},{"id":"1282","Title":"Roasted Cauliflower with Coconut-Turmeric Relish","Ingredients":{"1":"1 medium head of cauliflower, cut into 1\"–2\" florets","2":"5 Tbsp. extra-virgin olive oil, divided","3":"Kosher salt, freshly ground pepper","4":"Coconut-Turmeric Relish (for serving; optional)"},"Instructions":"Place oven rack in lowest position and preheat to 450°F. Toss cauliflower and oil on a large rimmed baking sheet; season with salt and pepper. Arrange cauliflower so a flat side is facing down and roast until dark brown and crisp on bottom, 15–20 minutes. Remove from oven and turn pieces over. Roast until second side is dark brown and crisp, 10–15 minutes. Let cool slightly.\nTransfer warm cauliflower to a platter. If using, spoon relish over top and season with more salt and pepper.","Image":"//20fix.com/xfood/img/roasted-cauliflower-with-coconut-turmeric-relish.jpg"},{"id":"1291","Title":"Cauliflower Steaks with Coconut-Turmeric Relish","Ingredients":{"1":"1 medium head of cauliflower","2":"3 Tbsp. extra-virgin olive oil, divided","3":"Kosher salt, freshly ground pepper","4":"Plain whole-milk Greek yogurt and Coconut-Turmeric Relish (for serving; optional)"},"Instructions":"Preheat oven to 400°F. Remove the toughest outer leaves from cauliflower (leave the tender inner leaves) and trim stem. Resting cauliflower on stem, cut in half from top to bottom, creating two lobes with stem attached. Trim off outer rounded edge of each piece to create two 1 1/2\"-thick steaks; reserve trimmed off florets for making cauliflower rice or roasted cauliflower.\nHeat 2 Tbsp. oil in a large cast-iron skillet over medium-high. Cook cauliflower, gently lifting up occasionally to let oil run underneath, until deep golden brown, about 5 minutes. Add remaining 1 Tbsp. oil to skillet, turn steaks over, and season with salt and pepper. Cook until second side is golden brown, about 3 minutes, then transfer skillet to oven. Roast just until stems are tender when pierced with a cake tester or toothpick, 8–12 minutes. Let cool slightly.\nIf using relish, swipe some yogurt over each plate and place a steak on top. Spoon one-quarter of relish over each. Season with more salt and pepper.","Image":"//20fix.com/xfood/img/cauliflower-steaks-with-coconut-turmeric-relish.jpg"},{"id":"1571","Title":"Relish Tray","Ingredients":{"1":"1/2 recipe Quick Pickled Carrots","2":"5 celery stalks, cut into 4\"–5\" logs","3":"1 bunch radishes, halved if large","4":"1 cup cornichons, drained","5":"1 cup pitted black olives, drained"},"Instructions":"Arrange pickled carrots, celery, radishes, cornichons, and olives on a tray of crushed ice.","Image":"//20fix.com/xfood/img/relish-tray.jpg"},{"id":"1588","Title":"Cranberry and Walnut Relish","Ingredients":{"1":"1 tablespoon mustard seeds","2":"1 medium shallot, finely chopped","3":"1 Fresno chile, seeds and ribs removed, finely chopped","4":"3 tablespoon dried currants","5":"3 tablespoon pure maple syrup","6":"3 tablespoon sherry vinegar or red wine vinegar","7":"1/2 teaspoon ground allspice","8":"1/2 teaspoon kosher salt, plus more","9":"1/2 cup walnuts","10":"12 ounces fresh (or frozen, thawed) cranberries","11":"1/3 cup chopped parsley"},"Instructions":"Preheat oven to 350°F. Toast mustard seeds in a dry small saucepan over medium-low heat, rolling around in pan often, until seeds start to pop, about 3 minutes. Remove from heat and add shallot, chile, currants, maple syrup, vinegar, allspice, and 1/2 tsp. salt (mixture will sputter a bit). Stir well to dissolve salt. Let sit until currants are plumped and mixture is cool, 15–20 minutes.\nMeanwhile, toast walnuts on a rimmed baking sheet, tossing halfway through, until golden brown, 8–10 minutes. Let cool.\nPulse walnuts and cranberries in a food processor until very coarsely chopped but with a few whole cranberries in the mix, about 5 short pulses. Transfer to a large bowl and work in shallot mixture. Cover and let sit at least 30 minutes.\nJust before serving, taste and season relish with more salt; stir in parsley.\nRelish (without parsley) can be made 4 days ahead. Chill.","Image":"//20fix.com/xfood/img/cranberry-and-walnut-relish.jpg"},{"id":"2326","Title":"Duck Two Ways With Clementine-Fig Relish","Ingredients":{"1":"1 tablespoon black peppercorns, lightly crushed","2":"1 tablespoon coriander seeds, lightly crushed","3":"1 tablespoon fennel seeds, lightly crushed","4":"8 duck legs (about 8 1/2 pounds), excess fat trimmed, frenched","5":"Kosher salt","6":"4 duck breasts (about 3 1/2 pounds), fat trimmed","7":"2 tablespoons vegetable oil","8":"2 medium leeks, white and pale-green parts only, chopped","9":"12 sprigs thyme","10":"4 garlic cloves, crushed","11":"2 bay leaves","12":"2 cups dry white wine","13":"2 clementines, very thinly sliced crosswise (with peel), seeds removed","14":"1 cup dried black Mission figs, halved","15":"1 1/2 cups cognac or brandy","16":"1 cup sugar","17":"2 tablespoons whole grain mustard","18":"1/2 teaspoon crushed red pepper flakes","19":"2 bay leaves","20":"2 tablespoons sherry vinegar or red wine vinegar"},"Instructions":"Mix peppercorns, coriander seeds, and fennel seeds in a small bowl. Prick skin of duck legs all over with a paring knife; season generously with salt. Sprinkle duck legs with spice mixture, pressing to adhere. Score fat of each duck breast in a crosshatch pattern, spacing 1/2” apart; season all over with salt. Divide legs and breasts between 2 large rimmed baking sheets. Let sit at room temperature 1 hour or chill uncovered up to 3 days.\nIf chilling, let duck legs sit at room temperature 1 hour before braising.\nPlace a rack in lower third of oven; preheat to 300°F. Heat oil in a large wide Dutch oven or other heavy pot over medium and cook leeks, stirring occasionally, until softened and browned around edges, 8–10 minutes. Add thyme sprigs, garlic, and bay leaves and cook, stirring occasionally, until fragrant and garlic is slightly softened, about 2 minutes. Add wine, bring to a boil, and simmer until reduced by half, about 5 minutes.\nRemove pot from heat and slip duck legs, skin side down, into liquid (depending on size of pan, they may overlap quite a bit—this is okay!). Pour in water to come three-quarters of the way up legs. Cover pot and braise duck legs in oven until submerged in their own fat, 1 1/2–2 hours.\nTurn duck legs skin side up and continue to braise (still covered) until tender and the bones wiggle easily in joints, 1 1/2–2 hours longer. Let legs cool in braising liquid, then chill until fat rises to the surface and solidifies, at least 2 hours.\nCook clementines, figs, cognac, sugar, mustard, red pepper flakes, and bay leaves in a medium saucepan over medium heat, stirring occasionally to dissolve sugar, until figs absorb some liquid and mixture is syrupy, 10–15 minutes. Let cool; remove bay leaves. Stir in vinegar, then strain 1/3 cup syrup through a fine-mesh sieve into a small bowl; set aside to use for glazing duck. Set remaining relish aside for serving.\nLet duck breasts sit until room temperature, about 1 hour.\nPlace 2 duck breasts, skin side down, in a large skillet; set over medium-low heat and cook duck, occasionally pouring excess fat from skillet into a bowl (save it!), until skin is golden brown and crisp, 12–15 minutes. Turn duck over, increase heat to medium, and cook on other side 2 minutes. Transfer to a cutting board. Wipe out skillet and let cool down, then repeat with remaining 2 breasts. (If you have 2 large skillets, by all means do all 4 breasts at once.) Let rest at least 10 minutes before slicing.\nMeanwhile, place a rack in upper third of oven; preheat to 425°F. Remove duck legs from braising liquid, brushing off any seeds or fat clinging to surface. Place, skin side up, on a wire rack set inside a foil-lined rimmed baking sheet and lightly brush with reserved glaze. Roast until golden brown and skin is crisp, 10–15 minutes.\nServe duck legs and sliced breasts with reserved relish.\nDuck legs can be braised 2 days ahead. Keep chilled. Relish can be made 2 days ahead. Cover and chill strained glaze and relish separately. Bring to room temperature before using.","Image":"//20fix.com/xfood/img/duck-two-ways-with-clementine-fig-relish.jpg"},{"id":"2413","Title":"Citrus-Pomegranate Relish","Ingredients":{"1":"1/2 cup sugar","2":"1/3 cup sherry vinegar","3":"Kosher salt, freshly ground pepper","4":"4 small oranges (such as blood or Cara Cara) or tangelos","5":"1/2 cup pomegranate seeds"},"Instructions":"Cook sugar undisturbed in a dry medium saucepan over medium-high until a ring around the edges is melted, about 5 minutes. Using a heatproof spatula, pull melted sugar in toward the center of saucepan. Continue to cook, pulling melted sugar into the center and reducing heat if sugar begins to smoke, until all sugar is melted and a deep caramel color, 6–8 minutes. Remove from heat and carefully add vinegar (it will spatter and caramel will seize). Cook sauce over medium heat, stirring, until caramel dissolves; season generously with salt and pepper. If sauce tastes too tart, add more salt a pinch at a time to balance out. Let cool.\nSlice off ends from oranges; set on ends and remove skins and white pith. Slice oranges crosswise into 1/4\"-thick rounds. Place in a large bowl; add pomegranate seeds and sauce and toss to coat.\nRelish can be made 1 week ahead. Cover and chill. Let sit at room temperature 2 hours before serving.","Image":"//20fix.com/xfood/img/citrus-pomegranate-relish.jpg"},{"id":"2438","Title":"Relish Tray With D.I.Y. Eggs","Ingredients":{"1":"1/2 bunch dill, large stems removed, divided","2":"6 teaspoons coriander seeds, divided","3":"6 teaspoons fennel seeds, nigella seeds, or mustard seeds, divided","4":"2 Fresno chiles, thinly sliced","5":"2 1/2 cups thinly sliced vegetables (such as fennel, scallions, celery, peeled carrots, and/or peeled beets)","6":"Kosher salt","7":"2 cups apple cider vinegar","8":"1/3 cup light agave nectar","9":"1 cup mayonnaise","10":"1/4 cup Dijon mustard","11":"1 tablespoon fresh lemon juice","12":"2 teaspoons ground turmeric","13":"Pinch of cayenne pepper","14":"8 large eggs, room temperature","15":"8 ounces black Cerignola olives","16":"1 cup smoked almonds","17":"Flaky sea salt"},"Instructions":"Divide dill, coriander seeds, and fennel seeds evenly among six 8-oz. resealable plastic containers, jars, or small bowls. Place chiles, fennel, scallions, celery, carrots, and/or beets individually in a container, followed by a generous pinch of kosher salt. Whisk vinegar, agave, and 1/2 cup water in a measuring glass; pour over vegetables. Cover and chill at least 12 hours and up to 2 days.\nWhisk mayonnaise, mustard, lemon juice, turmeric, and cayenne in a small bowl; season sauce with kosher salt.\nCook eggs in a large saucepan of boiling salted water 8 minutes. Transfer to a bowl of ice water; let cool. Peel eggs under running water; halve lengthwise.\nPlace pickled vegetables individually in small serving bowls. Place olives, almonds, and some sea salt each in a small bowl. Place eggs on a platter and serve with sauce, pickles, olives, almonds, and sea salt. Let guests assemble eggs as desired.","Image":"//20fix.com/xfood/img/relish-tray-with-diy-eggs.jpg"},{"id":"2446","Title":"Croque Madame With Cranberry-Mustard Relish","Ingredients":{"1":"1/3 cup leftover cranberry sauce","2":"3 tablespoons whole grain mustard","3":"1/2 teaspoon crushed red pepper flakes","4":"4 (1/2-inch-thick) slices Pullman or other white bread","5":"4 tablespoons unsalted butter, divided","6":"8 ounces aged white cheddar, grated (about 3 cups), divided","7":"8 ounces thinly sliced ham, divided","8":"2 teaspoons vegetable oil","9":"4 large eggs","10":"Kosher salt, freshly ground pepper"},"Instructions":"Preheat oven to 350°F. Mix cranberry sauce, mustard, and red pepper flakes in a small bowl. Spread relish over 1 side of each slice of bread.\nMelt 1 Tbsp. butter in a medium ovenproof nonstick skillet over medium heat. Place 1 slice of bread, plain side down, in skillet and cook until just golden on bottom side, about 2 minutes.\nScatter 3/4 cup cheese over and slightly around bread (the cheese in contact with the pan will begin to melt immediately). Transfer skillet to oven and bake until cheese is golden brown around edges, about 2 minutes. Remove skillet from oven and top bread with a few slices of ham; let sandwich cool slightly in pan 1 minute. Using a rubber spatula, carefully loosen edges of cheese and transfer sandwich to a plate. Repeat with remaining butter, bread, cheese, and ham to make 3 more sandwiches. Wipe out skillet.\nHeat oil in same skillet over medium. Crack eggs into skillet, cover, and cook until whites are just set but yolks are still runny, about 3 minutes. Top each sandwich with a fried egg; season with salt and pepper.","Image":"//20fix.com/xfood/img/croque-madame-with-cranberry-mustard-relish.jpg"},{"id":"2627","Title":"Jamón-Wrapped Spanish Tortilla With Piquillo Relish","Ingredients":{"1":"4 jarred piquillo peppers, finely chopped","2":"1/2 cup green olives, pitted, finely chopped","3":"1 teaspoon sherry vinegar","4":"2 cups olive oil, divided","5":"Kosher salt","6":"12 ounces fingerling potatoes (about 10)","7":"3 garlic cloves, thinly sliced","8":"1 large white onion, thinly sliced","9":"5 large eggs, room temperature, beaten to blend","10":"5 slices thin Serrano ham"},"Instructions":"Mix peppers, olives, vinegar, and 1/3 cup oil in a small bowl; season with salt. Let relish sit at room temperature 1 hour to let flavors meld.\nMeanwhile, heat potatoes and remaining 1 2/3 cups oil in a small saucepan over medium until oil begins to bubble; reduce heat to medium-low and cook, turning potatoes occasionally, until tender but not browned, 25–30 minutes. Transfer potatoes to a rimmed baking sheet with a slotted spoon; let cool slightly. Flatten with your hands and place in a large bowl. Strain oil into a measuring glass.\nHeat 2 Tbsp. potato-cooking oil in a medium skillet over medium. Cook garlic, stirring occasionally, until golden, about 2 minutes. Add onion and cook, stirring occasionally, until soft and translucent, 8–10 minutes; season with salt. Transfer to bowl with potatoes. Add eggs and 1/3 cup potato-cooking oil and mix gently to combine; season with salt.\nHeat 1 tsp. potato-cooking oil in a small nonstick skillet over medium. Pour in egg mixture and cook, stirring often until beginning to set and occasionally pushing away from sides to shape and compact, until golden brown and set on bottom, about 5 minutes. Press down on tortilla with spatula to flatten. Set a plate face down over skillet and swiftly invert tortilla onto plate. Slide back into skillet, browned side up, and cook until golden brown on other side, about 2 minutes. Slide tortilla onto a clean plate; let cool.\nJust before serving, drape ham over tortilla and tuck ends under; spoon some relish on top.","Image":"//20fix.com/xfood/img/jamon-wrapped-spanish-tortilla-with-piquillo-relish.jpg"},{"id":"2832","Title":"Sweet and Spicy Bacon Kebabs with Scallion-Ginger Relish","Ingredients":{"1":"6 scallions, thinly sliced","2":"1 serrano chile, thinly sliced","3":"1 tablespoon fresh lime juice","4":"1 teaspoon toasted sesame oil","5":"1/2 teaspoon finely grated peeled ginger","6":"1/2 teaspoon light brown sugar","7":"Kosher salt","8":"Vegetable oil (for grill)","9":"2 tablespoons honey","10":"2 tablespoons sambal oelek","11":"1 tablespoon unseasoned rice vinegar","12":"1 teaspoon Sriracha","13":"1/2 pound thick-cut bacon","14":"Lime wedges (for serving)","15":"8 (8–12-inch-long) metal skewers"},"Instructions":"Toss scallions, chile, lime juice, oil, ginger, and brown sugar in a medium bowl to combine; season with salt.\nPrepare a grill for medium-high, indirect heat (for a charcoal grill, bank coals on one side of grill; for a gas grill, leave one or two burners off). Oil grates. Combine honey, sambal oelek, vinegar, and Sriracha in a small bowl; set glaze aside.\nThread bacon onto 6–8 skewers, folding back and forth in accordion style, and grill over indirect heat, turning every minute or so, until browned and crisp, 10–12 minutes. Baste with reserved glaze, turning every 30 seconds or so, until lacquered and slightly sticky, about 3 minutes (move to an even cooler spot if needed to keep glaze from scorching). Serve bacon with relish and lime wedges.\nGlaze can be made 1 week ahead. Cover and chill.","Image":"//20fix.com/xfood/img/sweet-and-spicy-grilled-bacon-kebabs-with-scallion-ginger-relish.jpg"},{"id":"3072","Title":"Cucumber and Raisin Relish with Mustard Seeds","Ingredients":{"1":"1/2 cup apple cider vinegar","2":"2 tablespoons light brown sugar","3":"2 teaspoons kosher salt","4":"2 teaspoons mustard powder","5":"1 medium cucumber (about 1/2 pound), cut into 1/4 inch pieces","6":"1/3 cup finely chopped onion","7":"2 ounces golden raisins (about 1/3 cup)","8":"2 teaspoons mustard seeds"},"Instructions":"Bring vinegar, brown sugar, salt, mustard powder, and 1/2 cup water to a boil in a medium pot over high heat, stirring occasionally, until sugar and salt dissolve, about 5 minutes.\nPlace cucumber, onion, raisins, and mustard seeds in a heatproof resealable container. Pour hot brining liquid over cucumber mixture; stir to combine. Let cool to room temperature, then cover and chill at least 2 hours before serving. Serve cool or at room temperature.","Image":"//20fix.com/xfood/img/cucumber-and-raisin-relish-with-mustard-seeds.jpg"},{"id":"3153","Title":"Pikliz (Haitian Pickled Vegetable Relish)","Ingredients":{"1":"2 1/2 cups thinly sliced cabbage, cut crosswise 2-3 times for shorter shreds (from about 1/4 large cabbage)","2":"1 cup julienned or grated carrots (from about 1 medium carrot)","3":"1/2 cup thinly sliced shallots (from about 1 large shallot)","4":"6 Scotch bonnet peppers, stemmed, quartered","5":"3 sprigs thyme","6":"8 whole cloves","7":"1 teaspoon kosher salt","8":"3 cups (or more) distilled white vinegar","9":"3 tablespoons fresh key lime (or regular lime) juice"},"Instructions":"Pack cabbage, carrots, shallots, peppers, thyme, cloves, and salt into a 1 1/2-quart resealable jar. Add vinegar and lime juice, seal jar, and shake until ingredients are distributed and salt is dissolved. Add more vinegar if needed to just cover vegetables. Chill, shaking gently twice daily, at least 3 days before serving.\nPikliz can be made 1 month ahead. Seal and chill.","Image":"//20fix.com/xfood/img/pikliz-haitian-pickled-vegetable-relish.jpg"},{"id":"3239","Title":"Hanger Steak With Tangy Tomato Relish","Ingredients":{"1":"1 1/4 pounds hanger steak (about 2 pieces), center membrane removed, or flank steak","2":"Fine sea salt and freshly ground black pepper, to taste","3":"2 teaspoons canola or vegetable oil","4":"Flaky sea salt (optional)","5":"Fresh flat-leaf parsley leaves, for garnish","6":"Tangy tomato relish, recipe follows","7":"2 14-ounce cans cherry tomatoes, drained, or three cups fresh","8":"2 tablespoons olive oil","9":"Fine sea salt and freshly ground black pepper to taste","10":"1 teaspoon yellow mustard seeds","11":"1 medium red onion, chopped","12":"2 garlic cloves, minced","13":"1/8 teaspoon red pepper flakes, such as Aleppo or Marash","14":"1 1/2 tablespoons fresh ginger, peeled and minced","15":"1/4 cup fresh orange juice","16":"1 tablespoon Worcestershire sauce"},"Instructions":"Season the hanger steak with fine sea salt and pepper. Let steak sit at room temperature for at least 20 minutes before cooking.\nHeat the oil in a heavy 9-or 10-inch skillet over high heat. Working in batches if necessary, add the steak to the pan and cook, turning once, until browned on both sides and an instant-read thermometer registers 130˚F for medium-rare, 7 to 8 minutes total.\nLet the steak rest at least 10 minutes, then slice it on a diagonal. Season with flaky sea salt, if desired, and serve with parsley leaves and tomato relish.\nPreheat the oven to 425˚F.\nToss the tomatoes with 1 tablespoon of the olive oil and spread them in a single layer in a baking dish. Season with salt and black pepper to taste and roast until the tomatoes are crinkled and browned and any liquid in the pan is reduced, 18 to 20 minutes. Let cool.\nIn a wide nonreactive saucepan, heat the remaining 1 tablespoon oil over medium- high heat. Add the mustard seeds and cook until they pop, about 30 seconds. Add the onion, garlic, red pepper flakes, ginger, and a pinch of salt. Cook, stirring frequently, until the onion has softened, about 3 minutes. Add the roasted tomatoes and stir to combine, but take care to keep the tomatoes intact. Add the orange juice and Worcestershire sauce. Cook, stirring gently, until the juices have thickened to a jammy consistency, about 5 minutes. Taste and season with salt and black pepper.","Image":"//20fix.com/xfood/img/hanger-steak-with-tangy-tomato-relish.jpg"},{"id":"3285","Title":"Baked Minty Rice with Feta and Pomegranate Relish","Ingredients":{"1":"1/2 cup walnuts","2":"3/4 cup pomegranate seeds (from about 1/2 large pomegranate)","3":"3/4 cup Castelvetrano olives, pitted, coarsely chopped","4":"1/2 cup olive oil","5":"1/4 cup coarsely chopped fresh mint","6":"1/4 cup coarsely chopped fresh parsley","7":"1 tablespoon pomegranate molasses","8":"1 garlic clove, crushed","9":"Kosher salt, freshly ground pepper","10":"2 cups basmati rice","11":"4 tablespoons unsalted butter, cut into pieces","12":"3/4 teaspoons kosher salt","13":"10 mint sprigs","14":"8 ounces feta, sliced 1/4\" thick","15":"Pomegranate molasses can be found at Middle Eastern markets, some supermarkets, and online."},"Instructions":"Place a rack in upper third of oven; preheat to 350°F. Toast walnuts on a rimmed baking sheet, tossing once, until golden brown, 5–8 minutes. Let cool, then coarsely chop. Increase oven temperature to 450°F.\nToss walnuts, pomegranate seeds, olives, oil, mint, parsley, pomegranate molasses, and garlic in a medium bowl to combine. Season with salt and pepper.\nCombine rice, butter, and salt in a 13x9\" baking dish, then pour in a scant 3 1/2 cups water; top with mint sprigs. Cover tightly with foil and bake until rice is tender and water is absorbed, 30–35 minutes. Remove from oven; pluck out mint. Fluff rice with a fork.\nHeat broiler. Arrange feta over rice. Broil until rice around edges of pan is browned and crisp and feta is starting to brown, 8–10 minutes. Spoon pomegranate relish over.","Image":"//20fix.com/xfood/img/baked-minty-rice-with-feta-and-pomegranate-relish.jpg"},{"id":"3709","Title":"Seared Black Bass With Scallion-Chile Relish","Ingredients":{"1":"4 tablespoons olive oil, divided","2":"4 (5–6-ounce) skin-on black bass fillets","3":"Kosher salt, freshly ground pepper","4":"1 bunch scallions, thinly sliced","5":"1 serrano chile, thinly sliced","6":"2 cups cilantro leaves with tender stems","7":"2 tablespoons fresh lime juice","8":"1 teaspoon toasted sesame seeds"},"Instructions":"Heat 2 tablespoons oil in a large nonstick skillet over medium-high until very hot but not smoking. Season bass with salt and pepper and cook, skin side down, gently pressing occasionally with a spatula to ensure contact with skillet, until skin is browned and crisp and flesh is nearly opaque, 6–8 minutes. Turn and cook until flesh is opaque throughout, about 1 minute longer.\nMeanwhile, toss scallions, chile, cilantro, lime juice, sesame seeds, and remaining 2 tablespoons oil in a medium bowl; season with salt. Serve bass with scallion-chile relish.","Image":"//20fix.com/xfood/img/seared-black-bass-with-scallion-chile-relish-56389714.jpg"},{"id":"3893","Title":"Chicken and Couscous with a Punchy Relish","Ingredients":{"1":"1 whole chicken, about 4 pounds","2":"1 tablespoon butter, softened","3":"Medium-grain kosher salt and freshly ground black pepper","4":"1 lemon","5":"Approximately 2.5 cups chicken stock or water","6":"4 cloves garlic, with loose paper removed but unpeeled","7":"8 ounces large pearl couscous (see Note)', \"1/4 cup extra-virgin olive oil (it needn't be an expensive one but should taste good)\", '2 to 4 anchovy fillets, rinsed if salt-packed","8":"Generous pinch of crushed red pepper flakes","9":"1 1/2 tablespoons capers, rinsed if packed in salt, drained if packed in brine","10":"2 tablespoons golden raisins or dried currants","11":"A couple of handfuls of flat-leaf parsley, chopped","12":"Pickled caperberries, for garnish (optional)"},"Instructions":"Preheat an oven to 400°F with a baking pan on the lower middle rack.\nPat the chicken dry with paper towels. Rub the butter all over the chicken, making sure to give the back a good coating. Season generously with salt and pepper, inside and out. Position the wing tips behind the back and tie the legs together. Place the chicken, breast side up, on the preheated pan. Roast for 30 minutes.\nMeanwhile, stir the juice from 1/2 lemon into the stock in a small saucepan. Heat over medium-low heat until steaming, then pop in the garlic. Pull from the heat and keep in a warm spot. (I leave it on top of the hot stove, but with the burner off.) After 30 minutes are up for the chicken, pour 1 cup of the liquid into the baking pan, holding back the garlic, and roast for 30 minutes more.\nCut the juiced lemon half into wedges; keep the other half for the relish.\nPull the baking pan from the oven. Sprinkle the couscous around the chicken. Pour the remaining liquid onto the couscous and tuck in the lemon wedges and soaked garlic. Return the baking pan to the oven and continue to roast until both the chicken and the couscous are cooked through, around 30 minutes. If the liquid is absorbed before the couscous is cooked, add more liquid, a half cup at a time, as needed.\nLet the baking pan stand for 10 minutes while you make the relish. Squeeze the (now) roasted garlic into a small skillet. Add the oil and set the pan over medium heat. When the oil is hot, add the anchovies and red pepper flakes. Cook, stirring and breaking up the anchovies and garlic, until they've turned into a grungy paste, 2 to 3 minutes. Add the capers to the pan, and cook for 1 minute more. Stir in the juice from the second half of the lemon, along with the raisins and half of the parsley. Reduce the heat and simmer for 2 minutes, then check for seasoning. Remove the chicken to a board and carve as you'd like. Fluff the couscous with a fork, then arrange the cut chicken on top. Scatter the rest of the parsley over the whole baking pan of chicken and couscous, and serve with the relish.","Image":"//20fix.com/xfood/img/chicken-and-couscous-with-a-punchy-relish-56389470.jpg"},{"id":"4274","Title":"Roasted Citrus Relish","Ingredients":{"1":"1 1/2 pink grapefruit","2":"1 1/2 navel orange","3":"3 lemons","4":"3 tablespoons sugar","5":"1 tablespoon olive oil","6":"1 teaspoon kosher salt","7":"1/4 cup parsley leaves","8":"Flaky sea salt (such as Maldon)"},"Instructions":"Slice 1/2 pink grapefruit, 1/2 navel orange, and 1 lemon crosswise into paper-thin rounds; remove seeds. Toss in a medium bowl with 3 tablespoons sugar, 1 tablespoon olive oil, and 1 teaspoon kosher salt. Roast on a parchment-lined baking sheet in a 350° oven until golden in spots and crisp, 20–30 minutes; let cool.\nMeanwhile, cut all peel and white pith from 1 pink grapefruit, 1 navel orange, and 2 lemons. Working over a medium bowl, cut along sides of membranes to release segments into bowl; discard membranes. Tear roasted citrus into pieces and toss with segments, breaking up larger segments. Stir in 1/4 cup parsley leaves; season with flaky sea salt (such as Maldon).","Image":"//20fix.com/xfood/img/roasted-citrus-relish-51255290.jpg"},{"id":"4533","Title":"Poblano-Cilantro Relish","Ingredients":{"1":"3 large garlic cloves, unpeeled","2":"3 poblano chiles","3":"1 cup cilantro","4":"2 tablespoons fish sauce","5":"1 tablespoon sugar","6":"1 tablespoon lime juice, plus more for seasoning","7":"1 tablespoon vegetable oil"},"Instructions":"Light a grill and preheat for for at least 10 minutes or preheat a grill pan. Skewer the garlic. Grill the garlic and poblanos over moderately high heat, turning frequently, until the garlic is charred and softened, about 5 minutes, and the poblanos are blackened all over, about 10 minutes.\nTransfer the vegetables to a plate. Peel the garlic and transfer to a food processor. Peel the peppers, then core them and discard most of the seeds. Cut the peppers into strips and transfer to a food processor.\nPulse the garlic and peppers until coarsely chopped. Add the cilantro, fish sauce, sugar and 1 tablespoon of lime juice and pulse to a chunky puree. Add the vegetable oil and process until incorporated. Season the relish with more lime juice, if desired, and serve.","Image":"//20fix.com/xfood/img/poblano-cilantro-relish-51240010.jpg"},{"id":"4542","Title":"Charred Corn and Pepperoncini Relish with Basil","Ingredients":{"1":"1/4 cup cider vinegar","2":"1 1/2 teaspoons sugar","3":"1/4 cup finely diced sweet onion","4":"4 pepperoncini, cored and finely chopped","5":"Kosher salt","6":"3 ears of corn","7":"1 tablespoon of vegetable oil, plus more for brushing","8":"Freshly ground pepper","9":"1/4 cup finely chopped basil"},"Instructions":"Light a grill and preheat for at least 10 minutes or preheat a grill pan.\nIn a large bowl, whisk the vinegar with the sugar until dissolved. Add the onion, pepperoncini and a pinch of salt and let stand while you grill the corn.\nBrush the corn with vegetable oil and season with salt and pepper, then grill over moderately high heat, turning frequently until tender and blistered in spots. Let cool slightly, then, using a serrated knife, cut the kernels off the cobs.\nAdd the corn and the 1 tablespoon of oil to the onions and toss; season with salt and pepper. Let the relish stand for at least 15 minutes, stirring occasionally, to let the flavors meld. Add the basil just before serving.","Image":"//20fix.com/xfood/img/charred-corn-and-pepperoncini-relish-with-basil-51239750.jpg"},{"id":"4557","Title":"Caramelized Kimchi Relish","Ingredients":{"1":"3 cups kimchi, finely chopped","2":"1/4 cup sugar","3":"1/2 cup cider vinegar"},"Instructions":"Heat large skillet until very hot. In a bowl, toss half of the kimchi with the sugar and vinegar and add it to the skillet. Cook over high heat until the liquid is thickened and sticky and the kimchi is browned in spots, 5 to 6 minutes. Let cool slightly.\nScrape the caramelized kimchi back into to the bowl. Add the uncooked kimchi, then toss and serve.","Image":"//20fix.com/xfood/img/caramelized-kimchi-relish-51239740.jpg"}],"t":81,"p":{"limitstart":0,"limit":25,"total":81,"pagesStart":1,"pagesStop":4,"pagesCurrent":1,"pagesTotal":4}}}