{"ingredient":"Breakfast sandwich","recipes":{"s":1,"d":[{"id":"333","Title":"Breakfast Sandwich on an English Muffin With Charred Red Onions, Herbs, and Cheddar","Ingredients":{"1":"1 medium red onion, trimmed, cut in half through equator, peeled, separated into rings","2":"1 tsp. soy sauce","3":"½ tsp. garlic powder","4":"2 Tbsp. extra-virgin olive oil, divided","5":"Kosher salt","6":"¼ cup finely chopped soft herbs, such as basil, cilantro, and/or dill","7":"2 Tbsp. green or red hot sauce","8":"1 Tbsp. unsalted butter","9":"4 large eggs, lightly beaten","10":"2 whole-grain English muffins, toasted","11":"2 oz. sliced sharp cheddar cheese"},"Instructions":"Preheat oven to 350°F. Toss onion, soy sauce, garlic powder, and 1 Tbsp. oil on a large rimmed baking sheet to coat. Season with salt. Bake, tossing once halfway through, until onion is browned around the edges and very tender, 25–35 minutes. Let cool 5 minutes.\nMeanwhile, toss herbs, hot sauce, and remaining 1 Tbsp. oil in a small bowl. Season with salt, if needed.\nMelt butter in a small nonstick skillet over medium heat. Add eggs; season with salt. Cook, stirring with a rubber spatula, until eggs have set into creamy folds, 1–2 minutes.\nSpread herb sauce on cut sides of muffins. Transfer bottom halves to a rimmed baking sheet. Top with eggs, then lay cheese over. Bake bottom halves just until cheese is melted, about 5 minutes. Top with onion and close with muffin tops.\nDo Ahead: Onion can be cooked 5 days ahead. Transfer to an airtight container and chill. To make a sandwich quickly without turning your oven on, fold the cheese into the eggs when they have just begun to set, top with onion (no need to rewarm), and assemble with toasted English muffins.","Image":"//20fix.com/xfood/img/breakfast-egg-sandwich-on-english-muffin-charred-red-onions-herbs-and-cheddar.jpg"},{"id":"1380","Title":"The Best Vegan Breakfast Sandwich","Ingredients":{"1":"1 (16 oz/450 g) brick medium-firm tofu","2":"3/4 cup unsweetened nondairy milk","3":"1/3 cup nutritional yeast","4":"1/4 cup tapioca flour","5":"1 teaspoon ground turmeric","6":"1 teaspoon garlic powder","7":"1 teaspoon onion powder","8":"1 teaspoon sea salt","9":"1/2 teaspoon ground pepper","10":"2 tablespoons finely chopped chives","11":"3 tablespoons vegan butter, for frying","12":"5 English muffins, split in half","13":"5 tablespoons vegan butter","14":"5 vegan cheddar cheese slices","15":"Cassava Bacon","16":"2 vine tomatoes, sliced thick"},"Instructions":"To make the vegan egg, drain the tofu of excess water. Place in a high-powered blender with the nondairy milk, nutritional yeast, tapioca flour, turmeric, garlic and onion powders, salt, and pepper. Blend on high until smooth. The batter should be the consistency of a thick pancake batter. Add a bit more nondairy milk if you need to thin it out. Stir in the chopped chives.\nHeat a nonstick pan over medium heat and add a bit of vegan butter. Let it melt and spread it around the frying surface. Pour approximately 1/3 cup of the batter onto the pan and gently spread out to a 6-to 7-inch circle. Cook on the first side for 4 to 5 minutes; the patty should be bubbling and look slightly cooked through and darker in color before flipping. Flip and cook for another 4 to 5 minutes. Fold the patty in half and then in half again, so it looks like you’ve folded a thick crepe, and cook for another minute on each side to make sure that the middle is thoroughly cooked. Set each folded patty aside on a plate and cover to keep warm. Butter the pan before pouring the next 1/3 cup of batter into the pan. As you go, you might need to lower the heat or adjust cook times, as the pan will get hotter.\nWhen you’re on your last egg patty, set the oven to broil and place the English muffins on a baking sheet. Generously butter each side of the muffins and place 1 piece of cheese on each of the bottom halves. Toast under the broiler for a couple of minutes until the cheese is melted and the muffins are golden brown. Watch closely so the muffins don’t burn!\nPlace the bacon strips in the pan once the egg patties are done just to heat through.\nTo assemble each sandwich, place an egg patty on top of the cheese, add a tomato slice and as many bacon strips as you want, and finish with the top half of the muffin. The patties can be made ahead and heated through in a pan or the oven or in a microwave before serving. You can also store extra batter in the fridge for up to 4 days.","Image":"//20fix.com/xfood/img/the-best-vegan-tofu-breakfast-sandwich.jpg"},{"id":"1960","Title":"Breakfast Sandwiches with Chile-Fennel Sausage Patties","Ingredients":{"1":"1 1/2 teaspoons fennel seeds","2":"1 teaspoon dried oregano","3":"1 teaspoon red pepper flakes","4":"1 pound best-quality ground pork","5":"1/2 teaspoon sea salt","6":"1/2 teaspoon freshly cracked black pepper","7":"1 tablespoon olive oil","8":"4 slices Swiss cheese","9":"1 tablespoon butter","10":"4 large free-range eggs","11":"4 English muffins, store-bought or homemade, split and toasted","12":"1/4 cup Spicy Herb Mayo","13":"1 large heirloom tomato, thinly sliced","14":"4 sandwich-size lettuce leaves"},"Instructions":"Make the sausage patties: Using a mortar and pestle, smash together the fennel seeds, oregano, and red pepper flakes. In a large bowl, combine the ground pork with the spice mixture, salt, and black pepper. Give the sausage a good mix, separate it into four equal portions, and shape them into patties. The patties should be just larger than the width of the English muffins, as they will shrink when cooked.\nHeat two large skillets, one over medium heat and the other over medium-low heat. Pour the olive oil into the first pan and, working in batches if necessary, fry the sausage patties for 5 minutes per side, or until crispy and cooked through. When you flip the patties, top each with cheese.\nMelt the butter in the second pan. Crack in the eggs, taking care to not break the yolks. Gently fry the eggs until the whites have set but the yolks are still nice and runny.\nWhile the eggs and sausage are cooking, spoon a heaping spoonful of the mayo onto each muffin half.\nTo build each breakfast sandwich, lay a sausage patty, tomato slice, and fried egg on each English muffin bottom. Sprinkle each egg with a pinch of salt and black pepper, then top with a lettuce leaf and the other muffin half. Serve immediately.","Image":"//20fix.com/xfood/img/breakfast-sandwiches-with-chile-fennel-sausage-patties.jpg"},{"id":"5394","Title":"Breakfast Sandwich","Ingredients":{"1":"4 1 1/2-ounce turkey sausage patties","2":"1 cup arugula, cleaned with large stems removed","3":"2 teaspoons extra-virgin olive oil","4":"6 large eggs","5":"Salt and freshly ground black pepper","6":"4 whole wheat English muffins, split and toasted","7":"1 medium tomato, sliced"},"Instructions":"To prepare the turkey sausage and arugula: In a preheated small nonstick sauté pan, cook the turkey sausage patties over medium heat for 2 to 3 minutes on each side or until the patties are golden brown and thoroughly cooked. Remove the turkey sausage patties from the pan. Add the arugula to the same pan along with 1 tablespoon water. Quickly wilt the arugula and remove from the heat.\nTo prepare the eggs: Place the olive oil in a preheated nonstick medium sauté pan. Crack the eggs into a small mixing bowl and whisk together with a fork for 1 minute. Season with salt and freshly ground black pepper. Pour the egg mixture into the pan and let sit for 15 seconds. Using a small rubber spatula, gently move the eggs around the pan, scraping from the bottom every 7 seconds or so. Continue to cook the eggs for 2 minutes longer or until they are just cooked (they should glisten and be just set).\nPlace a cooked turkey sausage patty on each muffin bottom and top with the cooked eggs. Place the wilted arugula and sliced tomato over the eggs and top with the other half of the muffin. Serve immediately.","Image":"//20fix.com/xfood/img/breakfast-sandwich-51178000.jpg"}],"t":4,"p":{"limitstart":0,"limit":25,"total":4,"pagesStart":1,"pagesStop":1,"pagesCurrent":1,"pagesTotal":1}}}