{"ingredient":"Water","recipes":{"s":1,"d":[{"id":"155","Title":"Grilled Watermelon Salad With Lime Mango Dressing and Cornbread Croutons","Ingredients":{"1":"½ cup coarsely chopped ripe mango","2":"¼ cup fresh lime juice","3":"¼ cup dry sake","4":"2 tablespoons champagne vinegar","5":"1 teaspoon minced seeded bird’s-eye chile","6":"½ teaspoon kosher salt","7":"¼ cup canola oil","8":"3 pounds seedless watermelon, peel left on, cut into 1-inch-thick slabs","9":"Olive oil","10":"Kosher salt","11":"½ cup hulled pumpkin seeds","12":"¼ teaspoon ground cayenne","13":"1 teaspoon sugar","14":"4 cups 1-inch cubes homemade or store-bought cornbread","15":"2 tablespoons unsalted butter, melted","16":"8 fresh shiso leaves, shredded (or Thai basil or mint)","17":"½ cup dates, pitted and chopped","18":"1 serrano chile, sliced into rings","19":"Freshly ground black pepper","20":"½ cup ricotta or mascarpone"},"Instructions":"Put all of the ingredients except the oil in a blender. Blend on high. After the ingredients are blended, slowly add the oil and continue to blend until the mixture is thickened and emulsified. (Makes 1 cup.)\nHeat a grill pan to medium-high heat. Drizzle the watermelon slices with just enough oil to thinly coat and place them on the hot grill.\nGrill each side of the watermelon slices for about 2 minutes, until charred. Transfer to a plate and season with salt.\nRemove the rind and dice the grilled watermelon into large cubes.\nPreheat the oven to 350°F. Toss the pumpkin seeds with the cayenne, sugar, and 2 teaspoons oil and place on a small baking sheet. Roast for 6 to 10 minutes, until golden.\nBrush the cornbread cubes with the melted butter and place in a single layer on a baking sheet. Put in the oven along with the pumpkin seeds and bake for 10 minutes, turning halfway with a flexible spatula. Remove from the oven when the croutons are toasted and golden.\nToss the watermelon, shiso, dates, and chile in the bowl with ¼ cup Lime Mango Dressing (reserve remaining dressing for another use). Taste and adjust the seasoning with salt and pepper. Add the cornbread croutons and toss very gently to combine without breaking the croutons. Spoon the salad onto a large platter and garnish with the pumpkin seeds and cheese.","Image":"//20fix.com/xfood/img/grilled-watermelon-salad-with-lime-mango-dressing-and-cornbread-croutons.jpg"},{"id":"160","Title":"Watermelon Salad With Radishes and Mint","Ingredients":{"1":"Kosher salt and freshly ground black pepper","2":"1 bunch red radishes, cut into ⅛-inch slices","3":"2 tablespoons red wine vinegar","4":"4 teaspoons extra-virgin olive oil","5":"½ red onion, cut into thin slivers","6":"4½ pounds watermelon (1/4 of a large melon), rind removed, flesh cut into 1-inch cubes","7":"2 tablespoons torn mint leaves"},"Instructions":"Dissolve a spoonful of salt in a large bowl of ice and water. Add the radishes and let sit for a few minutes to crisp.\nWhisk the vinegar, oil, and 1 teaspoon salt in a large bowl. Drain the radishes and add to the bowl, along with the onion and watermelon.\nGently toss with your hands to coat evenly.\nSpread on a serving platter, grind pepper all over, and top with the mint.","Image":"//20fix.com/xfood/img/watermelon-salad-with-radishes-and-mint.jpg"},{"id":"213","Title":"Avocado and Lemon Water (Agua de Aguacate y Limón Amarillo)","Ingredients":{"1":"1 avocado, halved","2":"4 cups (950 ml/32 fl oz) water","3":"½ cup (120 ml/4 fl oz) lemon juice or lime juice","4":"½ cup (100 g) sugar, plus more to taste"},"Instructions":"Scoop the avocado into a blender. Add the rest of the ingredients and blend until smooth. Add more sugar to taste, if desired. Serve over ice.","Image":"//20fix.com/xfood/img/avocado-and-lemon-water-olvera.jpg"},{"id":"235","Title":"Cacao Water (Agua de Cacao)","Ingredients":{"1":"1 cup (130 g) cacao beans","2":"5 cups (1.2 liters or 2½ pints) fresh coconut water or good-quality bottled coconut water"},"Instructions":"In a dry small saucepan or frying pan, toast the cacao beans until browned on both sides and fragrant, 5–8 minutes. In a large pitcher, combine the cacao beans and coconut water. Cover and refrigerate for 2 days. Strain through a fine-mesh sieve (discard the cacao beans). Serve over ice.","Image":"//20fix.com/xfood/img/cacao-water-agua-de-cacao.jpg"},{"id":"392","Title":"Watermelon, Lime, and White Pepper Yogurt Drink","Ingredients":{"1":"1 1/2 cups [210 g] cubed watermelon, cut in 1-in [2.5-cm] cubes","2":"1 generous cup [150 g] ice cubes","3":"1 cup [240 ml] soda water","4":"1/2 cup [135 g] plain yogurt","5":"1/4 cup [60 ml] fresh lime juice","6":"2 Tbsp honey","7":"1/8 tsp white pepper","8":"Pinch of salt"},"Instructions":"Blend the watermelon, ice cubes, soda water, yogurt, lime juice, honey, white pepper, and salt in a blender until well combined. Pour into a glass and serve immediately.","Image":"//20fix.com/xfood/img/watermelon-lime-and-white-pepper-yogurt-drink-baco-los-angeles-recipe.jpg"},{"id":"393","Title":"Watermelon Chia Smoothie","Ingredients":{"1":"1 cup (150 g) watermelon chunks, seeds removed","2":"1⁄4 cup (37 g) frozen strawberries","3":"1⁄4 cup (33 g) frozen cauliflower florets","4":"2 fresh mint leaves","5":"1 tablespoon chia seeds","6":"1⁄2 cup (120 ml) coconut water, herbal iced tea, or milk of choice"},"Instructions":"Combine all the ingredients in a blender and blend until smooth.","Image":"//20fix.com/xfood/img/watermelon-chia-smoothie-strawberries-cauliflower-quick-breakfast-catherine-mccord.jpg"},{"id":"660","Title":"Tomato-Watermelon Salad with Turmeric Oil","Ingredients":{"1":"1/4 cup virgin coconut oil","2":"1 tsp. coarsely crushed peppercorns","3":"1 tsp. coarsely crushed coriander seeds","4":"1/2 tsp. cumin seeds","5":"1/2 tsp. ground turmeric","6":"1/4 large seedless watermelon (about 3 lb.), preferably yellow, rind removed, flesh cut into 1/2\" pieces (about 4 cups)","7":"2 medium or 1 large heirloom tomato, cut into 1/2\" pieces","8":"8 oz. mild French feta, cut into 1/2\" pieces","9":"Flaky sea salt"},"Instructions":"Heat coconut oil, peppercorns, coriander seeds, cumin seeds, and turmeric in a small saucepan over medium until fragrant, about 3 minutes. Let turmeric oil cool slightly.\nArrange watermelon, tomato, and feta on a platter. Drizzle turmeric oil evenly over and sprinkle with salt.","Image":"//20fix.com/xfood/img/tomato-watermelon-salad-with-turmeric-oil.jpg"},{"id":"673","Title":"Country-Style Ribs with Quick-Pickled Watermelon","Ingredients":{"1":"1/2 cup (packed; about 3 ounces) light brown sugar or palm sugar","2":"1/2 cup soy sauce","3":"1/4 cup unseasoned rice vinegar","4":"3 scallions, thinly sliced","5":"6 garlic cloves, minced","6":"2 tablespoons minced peeled ginger (from one 2x1-inch piece)","7":"1 tablespoon chopped cilantro leaves","8":"1 tablespoon hot chili paste (such as sambal oelek)","9":"1 tablespoon toasted sesame oil","10":"1 teaspoon freshly ground black pepper","11":"1/2 medium onion, sliced","12":"3 pounds (1-inch-thick) country-style pork ribs or bone-in pork chops","13":"2 tablespoons Chinese hot mustard powder","14":"1 teaspoon coriander seeds","15":"1/3 cup Champagne vinegar or white wine vinegar","16":"2 tablespoons fresh lime juice","17":"1 tablespoon finely chopped shallot","18":"1 teaspoon honey","19":"1/2 cup olive oil","20":"Kosher salt, freshly ground pepper","21":"5 cups coarsely chopped seedless watermelon (cut from half a 6- to 7-pound watermelon)","22":"4 cups Sun Gold or cherry tomatoes (about 1 1/4 pounds), halved","23":"1/4 cup cilantro leaves with tender stems plus more for garnish"},"Instructions":"First, make the marinade. Bring brown sugar and 1/2 cup water to a boil in a small saucepan, stirring to dissolve sugar. Lower heat to medium and simmer until reduced to 1/4 cup; transfer to a medium bowl. Whisk in soy sauce and next 8 ingredients. Stir in onion. Let cool. Pour the marinade into a large resealable plastic bag.\nRub ribs with mustard powder and add to marinade in bag; seal bag and turn ribs to coat. Place bag in a baking dish and chill, turning occasionally, for at least 6 hours and up to overnight.\nStart with the dressing. In a small saucepan over low heat, toast coriander seeds until fragrant and beginning to pop, 2-3 minutes. Transfer coriander to a baking sheet and crush slightly with the back of a cool skillet. Combine coriander, vinegar, lime juice, shallot, and honey in a small bowl. Whisk in oil and season with salt and pepper. Set vinaigrette aside.\nPlace watermelon in a large bowl; add 1/2 cup vinaigrette and toss to coat. Cover and chill, tossing occasionally, for up to 1 hour to lightly pickle watermelon.\nBuild a medium fire in a charcoal grill, or heat a gas grill to medium-high. Transfer ribs from bag, leaving some marinade clinging to surface, onto a baking sheet. Pour remaining marinade from bag into a medium saucepan. Bring to a boil; reduce heat to medium and simmer for 3 minutes. Set marinade aside.\nGrill ribs until nicely charred and cooked to medium, about 5 minutes per side. Using tongs, dunk each rib into reserved marinade. Return ribs to grill and cook, turning once, until cooked to medium-well, about 2 minutes per side. Transfer to a platter.\nToss tomatoes, 1/4 cup cilantro, and 1 Tbsp. vinaigrette in a medium bowl. Season to taste with salt and pepper.\nTop ribs with pickled watermelon. Scatter tomato mixture over. Garnish with more cilantro. Serve, passing remaining vinaigrette alongside for drizzling over.","Image":"//20fix.com/xfood/img/country-style-ribs-with-quick-pickled-watermelon.jpg"},{"id":"737","Title":"Ice Water Salad","Ingredients":{"1":"1 1/2 lb. mixed crunchy vegetables (such as fennel, radishes, turnips, beets, and/or carrots), tough skins peeled","2":"1 cup walnuts","3":"5 oil-packed anchovy fillets","4":"2 large garlic cloves","5":"1/3 cup extra-virgin olive oil, plus more for drizzling","6":"3 Tbsp. fresh lemon juice","7":"2 oz. Parmesan, shaved, divided","8":"Kosher salt","9":"A mortar and pestle"},"Instructions":"Thinly slice vegetables on a mandoline (they should be about the thickness of a nickel). Fill a large salad spinner (or bowl) with ice water and add vegetables; let sit at least 15 minutes or up to 6 hours. (Cover and chill if letting sit longer than 1 hour.)\nMeanwhile, preheat oven to 325°F. Toast walnuts on a rimmed baking sheet, tossing once, until deep golden brown, about 9 minutes. Let cool, then crush or chop to about the size of a lentil.\nSmash anchovies, garlic, and a big pinch of salt in a mortar and pestle to form a smooth paste. (Alternatively, you can use the side of a chef’s knife to crush the garlic, then mash with the anchovies and salt on a cutting board.) Transfer to a small saucepan and add 1/3 cup oil. Cook over medium-low, stirring often, until garlic is just starting to turn golden brown, about 3 minutes. Transfer to a large bowl and let cool slightly. Mix in walnuts and lemon juice; taste and season with salt.\nSkim off any ice cubes from water bath and drain vegetables. Cover salad spinner and spin vegetables, periodically pouring off any collected water as needed, until they are very dry. Add to bowl with dressing and toss to coat. Add half of Parmesan and toss again just to evenly distribute.\nArrange salad on a platter. Top with remaining Parmesan, drizzle with some oil, and season with pepper.","Image":"//20fix.com/xfood/img/ice-water-shaved-vegetable-salad.jpg"},{"id":"828","Title":"Avocado Water","Ingredients":{"1":"1 small ripe avocado, pit removed","2":"5 Tbsp. fresh lime juice","3":"3 Tbsp. sugar","4":"Tiny pinch of kosher salt"},"Instructions":"Scoop avocado flesh into a blender and add lime juice, sugar, salt, 1/2 cup ice cubes, and 2 cups cold water. Purée until smooth; blend in another splash of water if mixture is too thick. Pour into glasses, filled with ice if desired.","Image":"//20fix.com/xfood/img/avocado-water.jpg"},{"id":"897","Title":"Watercress and Persimmon Salad with Champagne Vinaigrette","Ingredients":{"1":"3 Tbsp Champagne vinegar","2":"2 Tbsp minced shallot","3":"1 tsp grated lemon zest","4":"1/4 cup extra-virgin olive oil","5":"3 firm-ripe Fuyu persimmons","6":"16 cups watercress (from 2 bunches), tough stems discarded"},"Instructions":"Whisk together vinegar, shallot, zest, 1/2 tsp salt, and 1/4 tsp pepper in a small bowl. Add oil in a slow stream, whisking until combined well.\nPeel persimmons and cut into 1/3-inch-thick wedges. Toss watercress with persimmons and enough vinaigrette to coat, then season with salt and pepper.\nVinaigrette can be made 1 day ahead and chilled.","Image":"//20fix.com/xfood/img/watercress-and-persimmon-salad-with-champagne-vinaigrette.jpg"},{"id":"1097","Title":"Watermelon with Lime Dressing and Peanuts","Ingredients":{"1":"2 Tbsp. fresh lime juice","2":"1 Tbsp. fish sauce","3":"1 1/2 tsp. sugar","4":"2 sprigs basil, plus leaves for serving","5":"1/2 (6-lb.) baby seedless watermelon, rind removed, flesh cut into irregular bite-size pieces (about 6 cups)","6":"1/4 cup salted, dry-roasted peanuts","7":"2 Tbsp. extra-virgin olive oil","8":"Flaky sea salt"},"Instructions":"Stir lime juice, fish sauce, sugar, and 1 Tbsp. water in a large bowl until sugar is dissolved. Lightly crush 2 basil sprigs by scrunching up in your hand and add to dressing along with watermelon; toss gently until coated.\nTransfer watermelon salad to a platter, leaving basil sprigs behind. Top with peanuts and basil leaves, drizzle with oil, and season with salt.","Image":"//20fix.com/xfood/img/watermelon-with-lime-dressing-and-peanuts.jpg"},{"id":"1176","Title":"Strawberry and Watercress Salad","Ingredients":{"1":"1/2 medium rhubarb stalk, very thinly sliced on a diagonal","2":"6 oz. strawberries, hulled, halved, sliced if large","3":"2 Tbsp. fresh lemon juice","4":"2 tsp. honey","5":"1 bunch watercress, tough stems removed","6":"1/2 cup basil leaves","7":"1/2 cup cilantro leaves with tender stems","8":"2 scallions, thinly sliced on a diagonal","9":"Kosher salt","10":"Crushed red pepper flakes","11":"2 Tbsp. extra-virgin olive oil","12":"Poppy seeds (for serving)"},"Instructions":"Toss rhubarb, strawberries, lemon juice, and honey in a medium bowl to combine.\nArrange watercress, basil, and cilantro on a platter, then scatter scallions over. Season with salt and sprinkle with red pepper flakes. Spoon berry mixture and juices over; drizzle with oil and sprinkle with poppy seeds.","Image":"//20fix.com/xfood/img/strawberry-and-watercress-salad.jpg"},{"id":"1434","Title":"Citrus and Avocado Salad with Orange Water","Ingredients":{"1":"2 1/2 pounds mixed citrus (such as oranges, blood oranges, and/or grapefruit)","2":"1/2 cup kumquats, thinly sliced, seeds removed (optional)","3":"2 tablespoons fresh lemon juice","4":"2 teaspoons orange-flower or rose water","5":"Large pinch of kosher salt","6":"1 avocado, cut into large pieces","7":"3 tablespoons salted or unsalted, roasted pistachios, finely crushed","8":"3 tablespoons tarragon leaves","9":"Extra-virgin olive oil (for drizzling)"},"Instructions":"Using a paring knife, remove peel and white pith from citrus, being careful not to remove too much of the flesh. Slice citrus into 1/2\"-thick rounds, then cut into 1 1/2\" pieces (it looks cool and is less fussy if pieces aren’t too exact in shape and size). Transfer to a medium bowl and add kumquats, if using, lemon juice, orange-flower water, and salt. Toss and let sit 5 minutes so citrus can release some of their juices.\nTransfer citrus, leaving juice behind, to a large plate. Tuck avocado in between and around citrus.\nSpoon citrus juice over salad, scatter pistachios and tarragon over, and drizzle with oil.","Image":"//20fix.com/xfood/img/citrus-and-avocado-salad-with-orange-water.jpg"},{"id":"1444","Title":"Vanilla Heart Cakes with Rosewater Icing","Ingredients":{"1":"1 x quantity One-Bowl Vanilla Cake batter","2":"2 cups (320g) icing (confectioner’s) sugar, sifted","3":"1/4 teaspoon rosewater","4":"1/4 cup (60ml) boiling water","5":"Edible dried rose petals, for sprinkling"},"Instructions":"Preheat oven to 160°C (325°F). Lightly grease a 20cmx30cm cake tin and line with non-stick baking paper. Spread the cake batter into the tin and bake for 35–40 minutes or until cooked when tested with a skewer. Allow to cool in the tin for 5 minutes. Turn out onto a wire rack to cool completely. Place the sugar, rosewater and water in a large bowl and whisk until smooth. Use an 8cm heart-shaped cookie cutter to cut hearts from the cake. Spoon over the icing and top with petals. Refrigerate until just set.","Image":"//20fix.com/xfood/img/vanilla-heart-cakes-with-rosewater-icing.jpg"},{"id":"1801","Title":"Watermelon, Arugula, and Pine Nut Salad","Ingredients":{"1":"1 tablespoon fresh lemon juice","2":"1 tablespoon red-wine vinegar","3":"1/2 teaspoon table salt, or to taste","4":"2 tablespoons extra-virgin olive oil","5":"3 cups cubed (1/2 to 3/4 inch) seeded watermelon, drained (from a 2 1/2-lb piece, rind discarded)","6":"6 cups baby arugula (6 oz)","7":"1/4 cup pine nuts (1 oz)","8":"1/3 cup crumbled feta or ricotta salata (1 1/2 oz)","9":"Coarsely ground black pepper to taste","10":"Fleur de sel to taste (optional)"},"Instructions":"Whisk together lemon juice, vinegar, and salt in a large bowl, then add oil in a slow stream, whisking until emulsified.\nAdd watermelon, arugula, and pine nuts and toss to coat, then sprinkle with cheese, pepper, and fleur de sel (if using).","Image":"//20fix.com/xfood/img/watermelon-arugula-and-pine-nut-salad-109628.jpg"},{"id":"1856","Title":"Steak with Watercress Salad and Chile-Lime Dressing","Ingredients":{"1":"2 teaspoons Chinese hot mustard powder or English mustard powder (such as Colman’s)","2":"2 teaspoons fish sauce","3":"1 teaspoon demerara or light brown sugar, divided","4":"Kosher salt, freshly ground pepper","5":"1–1 1/2 pounds boneless rib eye","6":"1 red Thai chile, very thinly sliced","7":"2 tablespoons fresh lime juice","8":"2 tablespoons olive oil, plus more for drizzling","9":"1 tablespoon vegetable oil","10":"2 tablespoons unsalted butter","11":"1 bunch watercress, tough stems trimmed (about 6 cups)","12":"2 Persian cucumbers, thinly sliced","13":"1/4 cup mint leaves","14":"1/4 cup salted, dry-roasted peanuts, lightly crushed"},"Instructions":"Whisk mustard powder, fish sauce, 1/2 tsp. demerara sugar, and 1 Tbsp. very hot water in a medium bowl until sugar is dissolved; season with salt and plenty of pepper. Add steak to bowl and turn several times to coat. Let sit while you make the vinaigrette.\nWhisk chile, lime juice, 2 Tbsp. olive oil, and remaining 1/2 tsp. demerara sugar in a large bowl; set vinaigrette aside.\nHeat vegetable oil in a medium skillet, preferably cast iron, over medium-high. Add steak and cook, turning every couple of minutes, until nicely browned and medium-rare, 7–10 minutes. Add butter to skillet, then tilt skillet toward you and use a large spoon to baste steak with foaming butter for a minute longer. Transfer steak to a cutting board and let rest 5 minutes.\nMeanwhile, add watercress, cucumbers, and mint leaves to bowl with reserved vinaigrette and toss to combine; season salad with salt and pepper. Top with peanuts and drizzle with olive oil.\nSlice steak and serve with salad.","Image":"//20fix.com/xfood/img/steak-with-watercress-salad-and-chile-lime-dressing.jpg"},{"id":"1911","Title":"3-Ingredient Grilled Watermelon, Feta, and Tomato Salad","Ingredients":{"1":"1 tablespoon olive oil, plus more","2":"1 (4-pound) seedless watermelon, rind removed, cut into 1/2\"-thick slices","3":"1 teaspoon kosher salt, divided","4":"4 multicolored heirloom tomatoes, thinly sliced","5":"1/2 teaspoon freshly ground black pepper, plus more","6":"6 ounces feta, thinly sliced (about 1 1/4 cups)"},"Instructions":"Prepare a grill for medium-high heat or heat a grill pan or cast-iron skillet over medium-high; oil grate or pan.\nUsing a 2\" diameter ring cutter or thin drinking glass, cut watermelon into circles; you should have 20–22 pieces (reserve scraps for another use). Season watermelon on both sides with 1/2 tsp. salt. Grill watermelon until well charred, about 2 minutes per side. Transfer to a plate and set aside until cool to the touch, about 10 minutes.\nMeanwhile, toss tomatoes, 1 Tbsp. oil, 1 tsp. salt, and 1/2 tsp. pepper in a large bowl.\nLayer watermelon, tomato mixture, and cheese in alternating layers on a platter, draining any extra liquid from tomatoes before using. Drizzle with oil, season with pepper, and serve.","Image":"//20fix.com/xfood/img/3-ingredient-grilled-watermelon-feta-and-tomato-salad.jpg"},{"id":"1987","Title":"Wild Rice with Watercress and Hazelnuts","Ingredients":{"1":"2 cups wild rice","2":"1 bay leaf","3":"Kosher salt","4":"1/3 cup skin-on hazelnuts","5":"6 tablespoons unsalted butter","6":"1 large onion, thinly sliced","7":"6 garlic cloves, thinly sliced","8":"1/4 cup sherry vinegar or red wine vinegar","9":"1 tablespoon pure maple syrup","10":"1 tablespoon whole grain Dijon mustard","11":"Freshly ground black pepper","12":"2 cups trimmed watercress, upland cress, or micro cress"},"Instructions":"Cook rice and bay leaf in a large pot of boiling salted water until some grains have burst and rice is tender, 45–55 minutes. Drain thoroughly and spread out rice on a rimmed baking sheet to cool; discard bay leaf.\nMeanwhile, preheat oven to 350°F. Toast hazelnuts on a rimmed baking sheet, tossing halfway through, until slightly darkened and fragrant, 8–10 minutes. Let cool, then rub hazelnuts in a clean kitchen towel to remove some of the skins. Gently crush nuts by pressing under the flat side of a chef’s knife; set aside.\nHeat butter in a large skillet over medium-low. Cook onion and garlic, stirring often, until onion is golden, 15–20 minutes. Remove from heat.\nWhisk vinegar, maple syrup, and mustard in a large bowl until smooth. Scrape in onion mixture and cooled rice and toss to coat; season with salt and pepper. Fold in nearly all of the hazelnuts and cress, then transfer to a platter. Top with remaining hazelnuts and cress.\nRice can be cooked 2 days ahead. Let cool; cover and chill. Rice mixture (without hazelnuts and cress) can be made 3 hours ahead; store airtight at room temperature.","Image":"//20fix.com/xfood/img/wild-rice-salad-with-watercress-and-hazelnuts.jpg"},{"id":"2144","Title":"Roasted Black Bass with Orange-Flower Water","Ingredients":{"1":"3 tablespoons olive oil, plus more","2":"3/4 teaspoon finely ground saffron threads","3":"1 tablespoon orange-flower water","4":"1 large shallot, very finely chopped","5":"2 green garlic, white and pale-green parts only, finely chopped, or 3 garlic cloves, finely grated","6":"1 1/2 cups finely chopped parsley","7":"3/4 cup finely chopped tarragon","8":"1/2 cup finely chopped cilantro","9":"1/2 cup finely chopped mint","10":"1/2 teaspoon ground turmeric","11":"2 serrano chiles, finely grated","12":"2 teaspoons finely grated lemon zest","13":"Kosher salt, freshly ground pepper","14":"4 (1 1/2–2-pound) whole black bass or branzino, cleaned, butterflied, patted dry","15":"4 limes, halved","16":"A mortar and pestle"},"Instructions":"Preheat oven to 425°F. Line 2 rimmed baking sheets with parchment paper and lightly brush parchment with oil. Dissolve saffron in orange-flower water and 3 Tbsp. hot water in a small bowl.\nHeat 3 Tbsp. oil in a large skillet over medium. Cook shallot and green garlic, stirring often, until shallot is soft, about 3 minutes. Add parsley, tarragon, cilantro, mint, and turmeric and cook, stirring often, until herbs darken slightly, about 2 minutes. Remove from heat and stir in chiles and lemon zest; season with salt and pepper.\nDivide fish between prepared baking sheets. Open up and brush half of saffron mixture over flesh; season with salt. Stuff with shallot mixture; tie closed with kitchen twine, spacing 2\" apart. Brush outsides of fish with remaining saffron mixture; season with salt. Roast until flesh is flaky and opaque, 16–20 minutes. Carefully move a rack to upper third of oven; turn on broiler. Working in 2 batches, broil fish until skin begins to crisp, about 2 minutes. Let cool slightly; squeeze limes over.\nFish can be seasoned and stuffed 2 hours ahead.","Image":"//20fix.com/xfood/img/roasted-black-bass-with-orange-flower-water.jpg"},{"id":"2166","Title":"Saffron–Rose Water Brittle with Pistachios and Almonds","Ingredients":{"1":"Nonstick vegetable oil spray","2":"1/8 teaspoon finely ground saffron threads","3":"1 tablespoon rose water","4":"3/4 cup sugar","5":"1/2 cup light corn syrup","6":"3 tablespoons honey","7":"1/4 cup slivered almonds","8":"2 tablespoons unsalted butter","9":"1 teaspoon kosher salt","10":"1 teaspoon baking soda","11":"3 tablespoons chopped pistachios","12":"1 tablespoon coarsely ground dried rose petals","13":"1/2 teaspoon flaky sea salt","14":"A candy thermometer"},"Instructions":"Line a rimmed baking sheet with parchment paper; lightly coat with nonstick spray. Dissolve saffron in rose water in a small bowl.\nBring sugar, corn syrup, honey, and 2 Tbsp. water to a boil in a medium saucepan fitted with candy thermometer over medium heat, stirring to dissolve sugar. Cook, swirling occasionally (do not stir once sugar is dissolved), until thermometer registers 290°F, about 5 minutes. Mix in almonds, butter, and kosher salt and cook, stirring often, until almonds are golden, butter is absorbed, and thermometer registers 300°F, about 2 minutes. Vigorously mix in baking soda, then rose water mixture (caramel will bubble at first but then look smooth and creamy). Immediately pour onto prepared baking sheet and spread out as thin as possible. Sprinkle pistachios, rose petals, and sea salt over brittle. Let cool, then break into bite-size pieces.\nBrittle can be made 1 week ahead. Store airtight at room temperature.","Image":"//20fix.com/xfood/img/saffron-rose-water-brittle-with-pistachios-and-almonds.jpg"},{"id":"2181","Title":"Watercress Salad with Mustard Vinaigrette","Ingredients":{"1":"2 tablespoons Dijon mustard","2":"1 tablespoon best-quality red wine vinegar","3":"1/2 small garlic clove, finely grated","4":"Kosher salt, freshly ground pepper","5":"1/4 cup olive oil","6":"2 small bunches watercress, tough stems trimmed (about 10 cups)"},"Instructions":"Whisk mustard, vinegar, and garlic in a medium bowl; season with salt and pepper, then gradually stream in oil, whisking constantly. Whisk until dressing is emulsified and thick.\nAdd watercress to dressing, season with more salt and pepper, and gently toss until watercress is evenly coated (you want to be careful not to bruise or wilt greens when tossing, so use a light hand). Pile salad lightly onto plates.","Image":"//20fix.com/xfood/img/watercress-salad-with-mustard-vinaigrette.jpg"},{"id":"2308","Title":"Grapefruit Sparkling Water","Ingredients":{"1":"1 1/2 cups sparkling water","2":"2 (2\"-long, 1\"-wide) grapefruit peels","3":"2 teaspoons fresh grapefruit juice"},"Instructions":"Pour sparkling water into a glass filled with ice. Twist 1 grapefruit peel and rub rim of glass. Drop both peels into glass. Stir in grapefruit juice and serve.","Image":"//20fix.com/xfood/img/grapefruit-sparkling-water.jpg"},{"id":"2371","Title":"Watercolor Christmas Ornament Cookies","Ingredients":{"1":"All-purpose flour (for dusting)","2":"1 batch All-in-One Sugar Cookie Dough, chilled","3":"2 cups white royal icing","4":"Red and green gel-paste food coloring","5":"3/4 teaspoon clear lemon extract","6":"1/4 teaspoon gold luster dust","7":"3–4\" ornament cookie cutters; a small paintbrush"},"Instructions":"Position racks in upper and lower thirds of oven; preheat to 350°F. Line 2 rimmed baking sheets with parchment paper.\nGenerously flour a rolling pin and work surface. Working with 1 disc at a time, roll dough to 1/4\" thick. Cut out as many cookies as possible with cookie cutters (if dough becomes too soft, chill until firm). Place cookies 1/2\" apart on prepared baking sheets. Chill 15 minutes.\nBake cookies until edges are light golden brown, 10–12 minutes. Transfer to wire racks and let cool.\nPlace icing in a wide shallow bowl. Add water by the teaspoon and stir to combine until slightly runny. Dip cookies face down into icing, just enough to cover the front and reach the outer edges, being careful not to completely submerge. Lightly shake cookies to level out icing. Transfer cookies to wire racks to let icing dry completely before decorating, about 3 hours.\nMix each food coloring with a small amount of water to dilute in separate bowls; the more water you add, the lighter the colors will be. Fill 2 small bowls with clean water.\nLightly dampen paint brush with water. Working with half of cookies and 1 color, lightly dab a few patches of watercolor “paint” over icing. Dampen brush in clean water. Brush along edges of darker paint to create a watercolor effect with the color fading out gently. For added texture, lightly tap brush over cookie to splatter droplets of color. Transfer cookies to a wire rack to dry as you work. Repeat painting technique with second color on remaining cookies. Let dry.\nMix lemon extract and luster dust in a small bowl to create gold paint. Using a clean paintbrush, splatter cookies in gold and paint tops of ornaments. Let paint dry completely before storing cookies.\nCookies can be made 10 days ahead; store in an airtight container at room temperature.","Image":"//20fix.com/xfood/img/watercolor-christmas-ornament-cookies.jpg"},{"id":"2679","Title":"Watermelon With Yogurt, Poppy Seeds, and Fried Rosemary","Ingredients":{"1":"2 tablespoons olive oil","2":"1 (6-inch) rosemary sprig","3":"1/2 cup plain whole-milk Greek yogurt","4":"1 tablespoon honey","5":"Kosher salt","6":"1 (3-pound) seedless watermelon, rind removed, cut into 2-inch pieces","7":"3 tablespoons fresh grapefruit juice","8":"Flaky sea salt","9":"1 teaspoon crushed red pepper flakes","10":"1 teaspoon poppy seeds"},"Instructions":"Heat oil in a small skillet over medium. Fry rosemary until crisp, about 20 seconds. Transfer to a paper towel to drain; set rosemary oil aside.\nMix yogurt and honey in a small bowl; season with kosher salt.\nToss watermelon and grapefruit juice in a large bowl; season with flaky sea salt.\nSpread yogurt on a large platter. Top with watermelon and crumble fried rosemary over. Drizzle 1 Tbsp. reserved rosemary oil over (save remaining oil for another use) and sprinkle with red pepper flakes and poppy seeds.","Image":"//20fix.com/xfood/img/watermelon-with-yogurt-poppy-seeds-and-fried-rosemary.jpg"}],"t":121,"p":{"limitstart":0,"limit":25,"total":121,"pagesStart":1,"pagesStop":5,"pagesCurrent":1,"pagesTotal":5}}}