{"ingredient":"Apple","recipes":{"s":1,"d":[{"id":"6","Title":"Apples and Oranges","Ingredients":{"1":"3 oz. Grand Marnier","2":"1 oz. Amaro Averna","3":"Small pat salted butter (about ½ teaspoon)","4":"1 cup hot apple cider","5":"1½ to 3 tsp. fresh lemon juice (to taste, depending on the sweetness of your cider)","6":"Garnish: freshly ground pink peppercorns, plus 2 lemon wheels (optional)"},"Instructions":"Add 3 oz. Grand Marnier, 1 oz. Amaro Averna, and a small pat of salted butter to a 16-ounce travel mug or large heatproof measuring cup. Add 1 cup hot apple cider and stir until butter melts.\nAdd 1½ tsp. fresh lemon juice and taste for sweetness, adding additional if needed. If serving in travel mug, garnish with ground pink peppercorns and seal. If serving in mugs, divide drink between two warmed mugs and garnish each with a pink peppercorn-dusted lemon wheel.","Image":"//20fix.com/xfood/img/apples-and-oranges-spiked-cider.jpg"},{"id":"12","Title":"Butternut Squash and Apple Soup","Ingredients":{"1":"6 slices bacon, cut crosswise into ½-inch pieces","2":"2 celery ribs, chopped","3":"1 carrot, chopped","4":"1 medium onion, chopped","5":"¼ teaspoon cinnamon","6":"¾ pound boiling potatoes","7":"2 medium Granny Smith apples (about ¾ pound total)","8":"1 ½ pounds butternut squash, peeled, seeded, and cut into ½-inch pieces (3½ to 4 cups)","9":"2 cups reduced-sodium chicken stock or broth","10":"2 to 2½ cups water","11":"Sour cream"},"Instructions":"Cook bacon in a 6-quart heavy pot over medium heat, stirring occasionally, until crisp, then transfer with a slotted spoon to paper towels to drain, reserving 2 tablespoons fat in pot. (Add vegetable oil if your bacon is very lean and doesn't yield enough fat.)\nCook celery, carrot, and onion in fat in pot over low heat, covered, stirring occasionally, until softened but not browned, 10 to 12 minutes. Add cinnamon and cook, uncovered, stirring, 1 minute.\nWhile vegetables are cooking, peel potatoes and coarsely chop. Peel and core 1 apple and coarsely chop.\nStir squash, potato, chopped apple, stock, 2 cups water, 1 teaspoon salt and 1/2 teaspoon pepper into onion mixture, then simmer, uncovered, stirring occasionally, until vegetables are very tender, 15 to 20 minutes.\nPuree soup in 4 batches in a blender (use caution when blending hot liquids), then heat in cleaned pot over medium low heat, stirring occasionally. (Add additional 1/2 cup water to thin, if necessary.)\nWhile soup is heating, cut enough of remaining apple into thin matchsticks (about 1 1/2-inches long) to measure about 1/2 cup.\nServe soup topped with sour cream, bacon, and apple matchsticks.\nCooks' Notes: Soup can be made 2 days ahead and chilled, covered once cooled. Cooked bacon can be kept refrigerated in an airtight container—reheat in a 375°F oven in a small baking pan.","Image":"//20fix.com/xfood/img/butternut-squash-apple-soup-365210.jpg"},{"id":"36","Title":"Creole Cream Cheesecake With Caramel-Apple Topping","Ingredients":{"1":"2 cups graham cracker crumbs (about 16 whole crackers)","2":"3 tablespoons granulated sugar","3":"3 tablespoons firmly packed light brown sugar","4":"1⁄4 teaspoon kosher salt","5":"1⁄2 cup unsalted butter, melted","6":"2 pounds cream cheese, at room temperature","7":"1 cup granulated sugar","8":"1⅓ cups Creole Cream Cheese","9":"1 teaspoon vanilla bean paste","10":"2 eggs, at room temperature","11":"Ingredient Info: You can substitute 1 cup sour cream mixed with 1⁄4 cup buttermilk for the 1⅓ cups Creole Cream Cheese.","12":"3¾ tablespoons unsalted butter","13":"3⁄4 cup granulated sugar","14":"1⁄4 cup firmly packed light brown sugar","15":"1½ tablespoons honey","16":"4 cups peeled, cored, and evenly chopped Granny Smith apples (about 7)","17":"1½ teaspoons finely grated lemon zest","18":"1 tablespoon fresh lemon juice","19":"3⁄4 teaspoon kosher salt","20":"3⁄4 teaspoon ground cinnamon","21":"1⁄3 teaspoon ground cardamom","22":"1⁄3 teaspoon ground ginger","23":"1 teaspoon vanilla extract"},"Instructions":"Make the crust. Preheat the oven to 375°F. In a medium bowl, stir together the graham cracker crumbs, granulated sugar, brown sugar, salt, and butter to combine. Pat the mixture into a 10-inch springform pan, pressing the crumbs firmly in an even layer on the bottom and making sure they come at least halfway up the side of the pan. Bake for 7 to 10 minutes, until the crust is fragrant, dry, and toasty. Let cool, then wrap the entire outside of the pan tightly in two layers of foil, all the way to the top.\nIn the bowl of a stand mixer fitted with the paddle attachment or in a large bowl using a handheld mixer, cream the plain cream cheese and sugar on medium-high speed for about 4 minutes, until incredibly smooth and light. Stop the mixer and scrape down the bottom and sides of the bowl with a rubber spatula. Add the Creole Cream Cheese and vanilla paste and beat on medium-high speed for about 2 minutes, scraping down the bowl once more. Decrease the speed to medium and beat in the eggs, one at a time, incorporating each one before adding the next. Mix just until the batter is smooth and uniform. Continuing to mix past that point, even though the batter won’t look different, only incorporates extra air, which will cause the cheesecake to bubble excessively and the surface to crack as that air tries to escape during the baking process.\nDecrease the oven temperature to 350°F. Pour the batter into the prepared crust and tap the pan gently on the counter a few times to remove any large air bubbles. Place the springform pan in a large baking or roasting pan (just big enough for the springform pan to fit in) and set the pan on the middle rack in the oven. Fill the pan with enough hot water to reach the rim of the springform pan. Bake for about 1 hour, or until the sides of the custard are set and the middle is still just slightly wobbly. Generally, if the entirety of the custard is fully set, your cheesecake is overbaked. Don’t panic—it’ll still be delicious, and you’ll do better next time!\nLet the cheesecake cool in the water until it is about room temperature. (You don’t want to have to try to grab the pan out of hot water if you can help it.) However, if you’re worried that your cheesecake might be slightly overbaked, you’ll want to pull it out rather quickly, and let it cool at room temperature. Refrigerate for at least 3 hours before slicing. The cake can be refrigerated, covered, for up to 4 days.\nIn a large heavy-bottomed sauté pan, heat the butter until melted. Stir in the granulated sugar, brown sugar, and honey and let cook until bubbling. Add the apples and toss to coat. Stir in the lemon zest, lemon juice, salt, cinnamon, cardamom, and ginger; stir to combine. Cook for about 4 minutes, or until the apples just start to soften. Remove from the heat, stir in the vanilla, and transfer to a bowl to cool completely before use. The filling can be made up to 3 days ahead of time and stored in an airtight container in the refrigerator.","Image":"//20fix.com/xfood/img/creole-cream-cheesecake-with-caramel-apple-topping.jpg"},{"id":"176","Title":"Jerk Baby Back Ribs With Pineapple Salsa","Ingredients":{"1":"1 large red onion, cut into ¼-in/6-mm slices","2":"¾ cup (180 mL) soy sauce","3":"¾ cup (180 mL) vegetable oil","4":"½ cup (120 mL) apple cider vinegar","5":"½ cup (120 mL) water","6":"1 jalapeño chile, sliced","7":"½ habanero chile, stemmed and seeded","8":"⅓ cup (80 mL) white wine vinegar","9":"Two 6 oz. (180-mL) cans pineapple juice","10":"¼ cup (50 g) firmly packed brown sugar","11":"½ pineapple, diced","12":"1 small red onion, diced","13":"3 small jalapeño chiles, diced","14":"⅓ cup (55 g) diced red bell pepper","15":"⅓ cup (8 g) chopped fresh cilantro","16":"2 Tbsp. canola oil","17":"Juice of 1 lime","18":"Kosher salt","19":"2 Tbsp. garlic powder","20":"2 Tbsp. onion powder","21":"1 Tbsp. ground allspice","22":"1 Tbsp. kosher salt","23":"2 tsp. grated nutmeg","24":"2 tsp. cascabel or ancho chile powder","25":"2 tsp. ground cinnamon","26":"2 tsp. ground cayenne pepper","27":"1 tsp. freshly ground black pepper","28":"Two 2-lb (910 g) racks baby back ribs"},"Instructions":"To make the jerk marinade: In a medium bowl, combine the onion, soy sauce, oil, vinegar, water, and jalapeño. (To make ahead, refrigerate in an airtight container for up to 3 days.)\nTo make the habanero vinegar: In a food processor, com¬bine the habanero chile and vinegar and purée until smooth. Pour into a small bowl. (To make ahead, refrigerate in an airtight container for up to 1 month.)\nTo make the pineapple glaze: In a small saucepan, combine the pineapple juice and brown sugar. Bring to a boil over medium heat and cook until sauce is thick and reduced to about one-third, about 15 minutes. (To make ahead, refrigerate in an airtight container for up to 3 days.)\nTo make the pineapple salsa: In a medium bowl, combine the pineapple, onion, jalapeños, bell pepper, cilantro, oil, and lime juice. Season with salt. (To make ahead, refrigerate in an airtight container for up to 8 hours.)\nTo make the jerk spice rub: In a small bowl, combine the garlic powder, onion powder, allspice, salt, nutmeg, chile powder, cinnamon, cayenne, and black pepper in a small bowl.\nUse a butter knife to pry the membrane off the bone side of the ribs. Once you get a piece of the membrane loose, grab it with a paper towel and pull it toward the other end of the slab to remove it. Rub the Jerk Spice Rub evenly over the ribs. Arrange the ribs in a 15-by-10-in/38-by-25-cm baking pan. Pour the Jerk Marinade over the ribs, turning to coat both sides. Cover baking pan with aluminum foil and refrigerate for at least 6 hours and up to 24 hours.\nRemove ribs from marinade, letting the excess drip off. Transfer the ribs to a baking sheet and allow to come to room temperature, about 30 minutes. Brush with the Habanero Vinegar.\nTo cook ribs using a charcoal grill: Prepare grill for indirect cooking over medium heat. Place a shallow metal pan filled with water in the center of the grill and arrange the hot coals around it. Lightly oil the grill grates. Place the ribs on the grate directly above the water-filled pan, cover the grill, and cook until tender, 1 1/2 to 2 hours. Add coals as needed to maintain medium heat.\nTo cook ribs using a gas grill: Preheat the grill with all the burners on high. Lightly oil the grill grates. Place the ribs on the grate, turn off the burner directly under the ribs, and reduce the other burners to medium heat. Cover the grill and cook until tender, 1 1/2 to 2 hours.\nAfter 45 minutes, brush the ribs with some of the Pineapple Glaze, and brush them two or three times before serving. Do not flip the ribs during cooking. When the ribs are done, they will be well browned and the meat will have shrunk back from the ends of the bones. Transfer ribs to a cutting board and let stand 5 minutes before cutting rack into individual ribs. Serve warm with the Pineapple Salsa.","Image":"//20fix.com/xfood/img/jerk-baby-back-ribs-brown-sugar-kitchen.jpg"},{"id":"179","Title":"Apple and Kohlrabi Coleslaw","Ingredients":{"1":"1 cup shredded napa cabbage","2":"1 cup shredded red cabbage","3":"2 ¼ teaspoons kosher salt, plus more as needed","4":"2 cups kohlrabi matchsticks","5":"2 cups Granny Smith (or other green apple) matchsticks","6":"⅓ cup minced fresh parsley, plus ¼ cup whole leaves","7":"¼ cup fresh lime juice","8":"⅓ cup unseasoned rice vinegar","9":"1 tablespoon shoyu","10":"1 teaspoon coconut palm sugar","11":"½ cup safflower oil","12":"Freshly ground white pepper"},"Instructions":"Combine the cabbages in a large bowl. Sprinkle with 2 teaspoons of the kosher salt. With clean hands, massage the cabbage until soft and wilted, about 3 minutes. Transfer the cabbage to a colander set in the sink and rinse the bowl. Put a plate on top of the cabbage and weight it (a 28-ounce can of tomatoes works well for this). Let sit for 1 hour. Rinse the cabbage in cold water and let drain for 20 minutes. Wipe the bowl with a clean kitchen towel.\nReturn the cabbage to the bowl and add the kohlrabi, apples, and minced parsley. Toss well to combine. Set aside.\nIn a blender, combine the lime juice, vinegar, shoyu, sugar, and ¼ teaspoon salt. With the blender running, slowly pour in the safflower oil through the hole in the lid and blend until emulsified. Season with salt and white pepper to taste.\nPour enough of the dressing over the salad to lightly coat, toss, and garnish with the parsley leaves, then serve.","Image":"//20fix.com/xfood/img/apple-and-kohlrabi-coleslaw-vegetable-kingdom.jpg"},{"id":"269","Title":"Sumac, Spelt, and Apple Cake","Ingredients":{"1":"2 large Granny Smith or Bramley apples, peeled, cored and roughly chopped","2":"1 Tbsp (15 ml) lemon juice","3":"1/2 cup (120 ml) water","4":"1 2/3 cups (200 g) wholemeal spelt flour","5":"Scant 1/2 cup (50 g) ground almonds","6":"1 Tbsp (15 g) sumac","7":"1 tsp baking powder","8":"1 tsp baking soda","9":"1/4 cup (60 ml) sunflower oil","10":"1/2 cup plus 2 tbsp (120 g) superfine/caster sugar","11":"1 1/2 cups (200 g) applesauce","12":"3 Braeburn apples, peeled, cored and diced into small chunks","13":"1/2 cup (60 g) confectioners’ sugar","14":"1 Tbsp (15 ml) lemon juice","15":"Sumac, to dust"},"Instructions":"Preheat the oven to 350°F (180°C). Grease a 1-pound (450-g) loaf pan and line with parchment paper.\nTo make the applesauce, add the apple pieces to a saucepan with the lemon juice and water. Let them simmer for 10 to 12 minutes, or until they have completely softened. Remove from the heat and mash the apples with a fork until smooth. You will need roughly 1 1/2 cups (200 g) for this recipe.\nTo make the cake, mix together the flour, almonds, sumac, baking powder and baking soda in a large bowl and set aside. In a medium bowl, combine the oil, sugar and applesauce.\nAdd the wet ingredients into the dry ingredients and stir gently, ensuring there are no lumps of flour. The batter will be fairly thick. Mix in the chopped apples and pour the batter into the prepared loaf pan. Bake for 45 to 50 minutes, or until a toothpick inserted comes out clean. Leave to cool completely in the pan before turning it out.\nTo make the drizzle, mix the sugar and lemon juice in a medium bowl until it’s thick enough to coat the back of a spoon. If it’s too thin, add some more sugar or loosen it up by adding more lemon juice. Once the cake is completely cool, use a teaspoon to drizzle the icing and sprinkle on a little more sumac.","Image":"//20fix.com/xfood/img/sumac-spelt-and-apple-cake-new-way-to-cake-benjamina-ebuehi.jpg"},{"id":"323","Title":"Black Apple Old-Fashioned","Ingredients":{"1":"1 ½ ounces Jägermeister","2":"1 ounce apple brandy","3":"2 dashes apple bitters","4":"Garnish orange twist"},"Instructions":"Combine the Jägermeister, brandy, and bitters in an ice-filled rocks glass and stir gently. Garnish with an orange twist.","Image":"//20fix.com/xfood/img/black-apple-old-fashioned-teague-jagermeister.jpg"},{"id":"396","Title":"Apple Pie Smoothie","Ingredients":{"1":"1 Gala, Fuji, or other sweet apple, cored, seeded, and cut into chunks","2":"1⁄2 cup (120 ml) plain or vanilla yogurt (vegan yogurt works too)","3":"2 tablespoons old-fashioned oats","4":"4 raw walnut halves","5":"1 dried date, pitted","6":"1 tablespoon chia seeds","7":"1⁄2 teaspoon ground cinnamon","8":"1⁄4 cup (60 ml) milk of choice","9":"1⁄4 cup ice"},"Instructions":"Combine all the ingredients in a blender and blend until smooth.","Image":"//20fix.com/xfood/img/apple-pie-smoothie-smoothie-project-catherine-mccord.jpg"},{"id":"398","Title":"Pineapple, Blackberry, and Basil Smoothie","Ingredients":{"1":"1 cup chopped fresh pineapple","2":"1 cup blackberries","3":"½ cup basil leaves","4":"1 cup coconut water","5":"Juice of ½ lime"},"Instructions":"In a blender, combine all the ingredients and process until smooth.","Image":"//20fix.com/xfood/img/pineapple-blackberry-and-basil-smoothie-nonalcoholic-drink-michael-symon.jpg"},{"id":"481","Title":"Applejack Sour","Ingredients":{"1":"2 oz. applejack (preferably Laird’s)","2":"¾ oz. fresh lemon juice","3":"½ oz. fresh orange juice","4":"½ oz. pure maple syrup","5":"2 dashes of Angostura bitters","6":"Freshly grated nutmeg"},"Instructions":"Combine applejack, lemon juice, orange juice, maple syrup, and bitters in a cocktail shaker. Add ice and shake until the outside of the shaker is frosty, about 20 seconds.\nStrain cocktail into an ice-filled rocks glass and sprinkle with nutmeg.","Image":"//20fix.com/xfood/img/applejack-sour-cocktail.jpg"},{"id":"509","Title":"Olive Oil Apple Cake with Spiced Sugar","Ingredients":{"1":"1 cup mild extra-virgin olive oil, plus more for pan","2":"1/2 cup plus 2 tsp. (100 g plus 10 g) granulated sugar, plus more for pan","3":"2 sweet apples, such as Golden Delicious or Gala","4":"1 tsp. ground cinnamon","5":"1/2 tsp. freshly ground black pepper","6":"1/2 tsp. ground cardamom","7":"1/2 tsp. ground ginger","8":"1 1/2 cups (185 g) all-purpose flour","9":"2 tsp. baking powder","10":"2 large eggs","11":"2 egg yolks","12":"1/2 cup (100 g) (packed) brown sugar","13":"1 tsp. vanilla extract","14":"1/2 tsp. kosher salt"},"Instructions":"Preheat oven to 350°F. Pour about 1 Tbsp. oil into a 9x5\" loaf pan and coat bottom and sides with fingertips. Sprinkle granulated sugar onto sides and bottom of pan to lightly coat.\nGrate apples, peel and all, on the large holes of a box grater. Gather apples in a clean kitchen towel and wring out excess liquid. Be aggressive! You want them as dry as possible when they go into the batter.\nWhisk cinnamon, pepper, cardamom, and ginger in a medium bowl. Transfer 1/4 tsp. spice mixture to a small bowl; set aside. Add flour and baking powder to remaining spice mixture and whisk to combine.\nWhisk together eggs, egg yolks, brown sugar, vanilla, salt, and 1/2 cup granulated sugar in a large bowl. Continue whisking vigorously until lightened in color and thickened. Whisking with one hand and pouring with the other, slowly stream 1 cup oil into egg mixture until combined. Gently fold flour mixture into whipped eggs with a flexible rubber spatula just until combined, taking care not to overmix.\nFluff up grated apples and scatter over batter. Gently fold to incorporate.\nTransfer batter to prepared pan; smooth top. Add 2 tsp. granulated sugar to reserved spice mixture and mix to combine. Sprinkle spiced sugar evenly over top of batter.\nBake cake until deep golden brown and a tester inserted into the center comes out clean, 60–70 minutes. Let cake cool in pan. Run a butter knife or offset spatula along edge of cake to loosen and invert onto a platter.\nDo Ahead: Cake can be made 3 days ahead (the flavor gets slightly more intense each day). Store in an airtight container at room temperature.","Image":"//20fix.com/xfood/img/olive-oil-apple-cake-with-spiced-sugar.jpg"},{"id":"513","Title":"Spiced Roast Pork with Fennel and Apple Salad","Ingredients":{"1":"15 dried Kashmiri, guajillo, or New Mexico chiles, seeds removed","2":"5 pieces star anise","3":"3 Tbsp. fennel seeds","4":"2 Tbsp. coriander seeds","5":"2 Tbsp. cumin seeds","6":"1 Tbsp. peppercorns, preferably Tellicherry","7":"2 tsp. whole cloves","8":"6 garlic cloves, smashed","9":"½ cup apple cider vinegar","10":"½ cup vegetable oil, divided","11":"1 (4–5 lb.) boneless pork shoulder (Boston butt), tied","12":"4–5 tsp. kosher salt, plus more","13":"Flaky sea salt","14":"1 fennel bulb, fronds reserved, bulb cored, very thinly sliced","15":"1 Honeycrisp or other crunchy not-too-sour apple, very thinly sliced","16":"2 serrano or red Thai chiles, thinly sliced into rounds","17":"3 Tbsp. extra-virgin olive oil","18":"Small handful of cilantro, finely chopped","19":"Kosher salt","20":"A spice mill or mortar and pestle"},"Instructions":"Cook chiles, star anise, fennel seeds, coriander seeds, cumin seeds, peppercorns, and cloves in a dry small skillet over medium heat, stirring often, until slightly darkened and fragrant, about 2 minutes. Let cool. Set one-fourth of spice mixture aside.\nBlend garlic, vinegar, ¼ cup oil, and ¼ cup water in a blender until smooth. Add remaining toasted spices and blend, adding splashes of water if needed to help turn the blades, until chile paste is mostly smooth; some texture is okay.\nSeason pork with 1 tsp. kosher salt per pound (check the butcher’s sticker on the package to see the weight of what you purchased). Smear half of chile paste all over pork; transfer to a wire rack set inside a rimmed baking sheet or a roasting pan and let sit at room temperature at least 2 hours, or cover and chill up to 12 hours.\nFinely grind reserved spice mixture in a spice mill or with mortar and pestle. Transfer to a small skillet; stir in remaining ¼ cup oil. Set over medium heat and cook, stirring, until spices have darkened slightly and are fragrant, about 1 minute. Let spice oil cool, then transfer to an airtight container. Cover and set aside.\nPreheat oven to 275°F. Roast pork until paste is darkened and looks dried out and an instant-read thermometer inserted into the center registers 120°F, 1½–2 hours, depending on the size. Make sure to take the temperature in more than one spot as there will be thick and thin parts of the roast. Let rest 2 hours.\nPreheat oven to 500°F. Rub pork with reserved chile paste and roast until marinade has formed a fragrant crust and an instant-read thermometer inserted into the thickest part registers 130°F, 8–12 minutes. Transfer pork to a cutting board and let rest 15 minutes. Thinly slice and transfer to a platter. Spoon reserved spice oil over pork; sprinkle with sea salt.\nToss fennel bulb and fronds, apple, lime zest and juice, chiles, and cilantro in a large bowl; season salad with salt. Drizzle oil over and toss to coat. Serve pork with salad.","Image":"//20fix.com/xfood/img/spiced-roast-pork-with-fennel-and-apple-salad.jpg"},{"id":"518","Title":"Apple-Walnut Upside-Down Cake","Ingredients":{"1":"1 cup raw walnuts or pecans","2":"10 Tbsp. unsalted butter, room temperature, divided","3":"4 small or 3 large baking apples (such as Pink Lady), peeled, halved, cored","4":"½ cup (packed) light brown sugar, divided","5":"1 cup all-purpose flour","6":"1 tsp. kosher salt","7":"1 tsp. baking soda","8":"½ tsp. baking powder","9":"¼ tsp. freshly grated nutmeg","10":"1½ tsp. ground cinnamon, plus more for serving","11":"½ cup granulated sugar","12":"2 large eggs, room temperature","13":"1 tsp. vanilla extract","14":"½ cup plain whole-milk Greek yogurt, room temperature","15":"Lightly sweetened, softly whipped cream (for serving)"},"Instructions":"Place a rack in middle of oven and preheat to 350°F. Spread out walnuts on a rimmed baking sheet and toast, tossing once, until golden brown, 10–12 minutes. Let cool.\nMeanwhile, heat a 10\" ovenproof skillet, preferably cast iron, over medium. Add 2 Tbsp. butter and swirl to coat; arrange apple halves cut sides down in a single layer in skillet. Cook apples, undisturbed, rotating skillet on burner as needed for even browning, until cut sides are golden brown, 5–10 minutes (the timing depends on the juiciness of the apples; juicier apples will take longer). Turn apples over and cook on rounded sides just until they start to release their juices and the tip of a knife slides through with slight resistance, about 5 minutes. Transfer apples to a plate, arrange cut sides up, and let cool.\nAdd ¼ cup brown sugar and 1 Tbsp. water to skillet and set over medium heat. Stir with a wooden spoon or heatproof rubber spatula until sugar is dissolved, then cook, swirling skillet occasionally (do not stir at this point), until thick and bubbling in a thin layer, about 1 minute. Let caramel cool in skillet.\nMeanwhile, pulse toasted walnuts, flour, salt, baking soda, baking powder, nutmeg, and 1½ tsp. cinnamon in a food processor until combined and nuts are finely ground. Transfer walnut mixture to a medium bowl.\nCombine granulated sugar, remaining ¼ cup brown sugar, and remaining 8 Tbsp. butter in food processor (no need to wash it) and process in long pulses until mixture is light and smooth. Add eggs and vanilla and process in long pulses, scraping down sides of processor once, until mixture is smooth. Add half of walnut mixture and pulse to combine, then add yogurt and pulse just until incorporated. Add remaining walnut mixture and pulse just to combine.\nArrange apple halves cut sides down over cooled caramel in skillet, spacing evenly. Fold batter a few times with spatula, scraping sides to make sure everything is well mixed. Scrape batter over apples and work into spaces around apples. Smooth surface (it’s okay if there’s only a thin layer of batter in places; it will rise in the oven).\nBake cake until it is browned across the entire surface and the center springs back when gently pressed, 30–40 minutes. Let cake cool in skillet 10 minutes, then run an offset spatula or a small knife around the sides of the pan to loosen. Set a wire rack upside down on skillet and flip over to release cake; carefully remove skillet. If any apples or cake stick to skillet, scrape them off and press back onto the top of the cake.\nServe cake warm or room temperature. Slice into wedges and top with dollops of whipped cream and a dusting of cinnamon.\nDo Ahead: Cake can be baked 2 days ahead. Let cool completely. Store tightly wrapped at room temperature.","Image":"//20fix.com/xfood/img/apple-walnut-upside-down-cake.jpg"},{"id":"522","Title":"Apple-Honey-Pecan Muffins","Ingredients":{"1":"Nonstick vegetable oil spray","2":"2 medium Pink Lady or Jonagold apples","3":"⅔ cup pecans","4":"2 Tbsp. unsalted butter","5":"2 Tbsp. honey","6":"Flaky sea salt","7":"¾ cup all-purpose flour","8":"½ cup spelt flour or all-purpose flour","9":"1½ tsp. baking powder","10":"¼ tsp. baking soda","11":"½ tsp. kosher salt","12":"2 large eggs, room temperature","13":"¾ cup granulated sugar","14":"¾ cup plus 2 Tbsp. extra-virgin olive oil","15":"½ cup buttermilk","16":"Raw sugar or granulated sugar (for sprinkling)"},"Instructions":"Place a rack in middle of oven; preheat to 350°F. Lightly coat flat top of a standard 12-cup muffin pan with nonstick spray (this will prevent muffins from gluing themselves to the pan). Line cups with double layers of muffin liners. Cut apples into quarters; remove cores. Cut each quarter into 4 wedges; set aside.\nPulse pecans in a food processor until you have a fine meal with a bit of texture, like coarse sand. Heat a large skillet over medium-high, then add pecans and toast, stirring, until darkened and very fragrant (it’s okay if they’re even a tiny bit burnt in spots), about 3 minutes. Transfer to a large bowl and let cool slightly.\nWipe out skillet and return to medium-high heat. Melt butter, swirling pan so that it’s evenly coated, until foaming, then add reserved apples. Drizzle with honey and generously sprinkle with sea salt. Cook, tossing often, until apples are tender and deep golden brown and glazed with honey, about 5 minutes. Scrape into a medium bowl and let cool.\nAdd all-purpose flour, spelt flour, baking powder, baking soda, and kosher salt to nuts; whisk to combine. Beat eggs and granulated sugar in the bowl of a stand mixer fitted with the whisk attachment on high speed until mixture is thick, pale, and tripled in volume, 8–10 minutes.\nCombine oil and buttermilk in a measuring glass. With motor running, gradually pour into egg mixture, stopping as soon as incorporated to prevent eggs from deflating. Scrape into bowl with dry ingredients and fold until just combined (be careful not to overmix). Scoop about 2 Tbsp. batter into each muffin cup and place an apple slice on top. Divide remaining batter among muffin cups, filling until just below the top (you may have a spoonful or two of batter left over). Place 1 apple slice on top of each, then spoon any glaze left in the bowl on top. (You’ll have a few leftover apple slices; eat them.) Sprinkle each muffin with some raw sugar and a pinch of sea salt.\nBake muffins until golden brown all over, rotating pan halfway through, 22–28 minutes. Let cool in pan 10 minutes, then transfer to a wire rack and let cool completely.\nDo Ahead: Batter can be made 2 days ahead. Cover and chill.","Image":"//20fix.com/xfood/img/apple-honey-pecan-muffins.jpg"},{"id":"545","Title":"Caramel Apple Cupcakes","Ingredients":{"1":"2 1/2 cups all-purpose flour","2":"3 tsp. baking powder","3":"1 tsp. ground cinnamon","4":"1/2 tsp. salt","5":"16 Tbsp. unsalted butter, at room temperature (European style recommended)","6":"2 cups sugar","7":"4 large eggs, at room temperature","8":"1/3 cup hot water","9":"2 1/2 cups freshly grated apples (4 to 5 medium-size apples—we use Gala apples, but you can use your favorite type)","10":"4 Tbsp. unsalted butter, at room temperature (European style recommended)","11":"4 cups confectioners’ sugar, sifted","12":"1/4 tsp. pure vanilla extract (Nielsen-Massey pure Madagascar Bourbon recommended)","13":"6 oz. cream cheese, at room temperature","14":"2 cups sugar","15":"1 Tbsp. water","16":"12 tbsp. unsalted butter, at room temperature (European style recommended)","17":"1 tsp. pure vanilla extract (Nielsen-Massey pure Madagascar Bourbon recommended)","18":"1 cup heavy cream, at room temperature"},"Instructions":"Preheat the oven to 350°F. Line a standard cupcake pan with twelve paper baking cups, and a second pan with six baking cups, or grease pans with butter if not using baking cups.\nSift together the flour, baking powder, cinnamon, and salt on a sheet of parchment paper or wax paper and set aside.\nPlace the butter in the bowl of a stand mixer or in a bowl with a handheld electric mixer. Beat on medium speed until fluffy. Stop to add the sugar; beat on medium speed until well incorporated, approximately 3 to 5 minutes.\nAdd the eggs one at a time, mixing slowly on medium speed, after each addition. It’s important to add them one at a time so that they will completely incorporate into the batter and you don’t put too much weight on your batter at once. This would collapse all the little air bubbles you created when you creamed the butter and sugar.\nReduce the speed to low. At this stage, it’s always important to mix as slowly and as little as necessary since you don’t want to traumatize your batter. Add one third of the flour mixture to the butter mixture, then gradually add one third of the hot water, beating until well incorporated. Add another third of the flour mixture, followed by one third of the hot water. It’s important to add the flour and water little by little like this, so that your batter does not have too much weight thrown on it and that you allow each amount of flour and water to completely mix into the batter. Stop to scrape down the bowl as needed. Add the remaining flour mixture, followed by the remaining hot water, and beat just until combined.\nUsing a spatula, fold the grated apple into the batter. Take care not to overmix the batter. If you overmix the batter, the cupcakes will not be light and fluffy but instead very dense.\nUse a standard-size ice-cream scoop to fill each baking cup with batter, so the cups are two-thirds full. Bake for 18 to 20 minutes (start checking at 15 minutes) or until a toothpick inserted into the center of a cupcake comes out clean. After 5 minutes, transfer the cupcakes to a wire rack to cool completely for approximately 20 minutes. It’s always best to cool the cupcakes at room temperature. Putting them in the refrigerator to cool can dry out the cake.\nPlace all ingredients in the bowl of an electric mixer fitted with the paddle attachment; beat until well combined. Be sure to beat on high speed at the very end for at least 2 minutes to ensure that the frosting is light and fluffy.\nPour the sugar and water into a large saucepan. Heat on medium-high heat and stir constantly until the sugar completely liquefies. Stir constantly and be careful not to burn the sugar. After all the sugar has dissolved, add the butter and vanilla extract to the saucepan and mix thoroughly. Once the butter has melted and the butter and sugar are completely mixed, remove from heat and, using a whisk, slowly whisk in the heavy cream until you reach a beautiful golden brown caramel color. Set aside and let cool and thicken for 5 minutes at room temperature. Refrigerate for 20 minutes to thicken further before you use to fill or decorate.","Image":"//20fix.com/xfood/img/caramel-apple-cupcakes.jpg"},{"id":"781","Title":"Pineapple Shrimp Noodle Bowls","Ingredients":{"1":"12 oz. pad Thai–style rice noodles","2":"1 lb. large shrimp","3":"12 oz. (1\") fresh pineapple cubes (about 2 cups; from ½ pineapple)","4":"1 tsp. kosher salt","5":"2 Tbsp. soy sauce or tamari","6":"1 Tbsp. freshly grated ginger","7":"2 Tbsp. vegetable oil","8":"2½ cups pineapple juice","9":"1 Tbsp. chili-garlic sauce, such as Huy Fong","10":"1 cup basil leaves, plus more for serving","11":"2 mini seedless cucumbers, thinly sliced","12":"½ small red onion, very thinly sliced crosswise","13":"½ cup salted roasted peanuts, coarsely chopped","14":"Lime wedges (for serving)"},"Instructions":"Cook rice noodles according to package directions.\nMeanwhile, toss shrimp and pineapple in a large bowl; season with salt. Add soy sauce and ginger and toss again to coat.\nHeat oil in a large nonstick skillet over medium-high. Using tongs, pluck out just the pineapple and cook, stirring often, until well browned on all sides, 5–6 minutes. Transfer to a plate. Add shrimp to same skillet and cook over medium-high heat, stirring often, until pink and opaque, 3–4 minutes. Transfer to plate with pineapple.\nCook pineapple juice and chili-garlic sauce in same skillet over medium-high heat, scraping up browned bits with a rubber spatula or wooden spoon and stirring occasionally, until reduced by half and slightly syrupy, 12–16 minutes. Remove from heat. Stir in pineapple-shrimp mixture and 1 cup basil.\nDivide rice noodles among bowls. Spoon pineapple-shrimp mixture over noodles and drizzle with extra sauce. Top with cucumbers, onion, peanuts, and more basil. Serve with lime wedges alongside for squeezing over.","Image":"//20fix.com/xfood/img/pineapple-shrimp-noodle-bowls.jpg"},{"id":"782","Title":"Apple and Calvados Tart (Galette de Pommes au Calvados)","Ingredients":{"1":"All-butter pastry dough","2":"1 3/4 pound Gala apples","3":"2 teaspoons fresh lemon juice","4":"1/3 cup plus 1/2 tablespoon granulated sugar","5":"Calvados applesauce","6":"3 tablespoons unsalted butter, cut into 1/2-inch pieces","7":"1 1/2 tablespoons apple jelly","8":"1 cup chilled heavy cream","9":"1 tablespoon confectioners sugar","10":"1 1/2 tablespoons Calvados","11":"parchment paper; a large baking sheet (at least 14 inches wide)"},"Instructions":"Roll out pastry on a lightly floured surface with a floured rolling pin into a rough 16-inch round (1/8 inch thick), then transfer carefully to parchment-lined large baking sheet. Loosely fold in edge of pastry where necessary to fit on baking sheet, then chill, covered loosely with plastic wrap, 30 minutes.\nPreheat oven to 425°F.\nWhile pastry is chilling, peel and core apples, then cut into 1/8-inch-thick slices. Toss slices with lemon juice and 1/3 cup granulated sugar.\nPut baking sheet with pastry on a work surface and unfold any edges so pastry is flat. Spread applesauce over pastry, leaving a 2-inch border, and top sauce with sliced apples, mounding slightly. Fold edges of dough over filling, partially covering apples (center will not be covered) and pleating dough as necessary. Dot apples with butter, then brush pastry edge lightly with water and sprinkle with remaining 1/2 tablespoon granulated sugar. Bake galette in middle of oven until pastry is golden and apples are tender, 40 to 45 minutes.\nWhile galette is baking, melt apple jelly in a very small saucepan over moderately low heat, stirring.\nSlide baked galette on parchment onto a rack, then brush with melted jelly and cool galette until warm or room temperature.\nBeat together cream and confectioners sugar in a bowl with an electric mixer until cream just holds soft peaks, then beat in Calvados. Serve galette topped with dollops of Calvados cream.","Image":"//20fix.com/xfood/img/apple-and-calvados-tart-107610.jpg"},{"id":"791","Title":"Coconut Shrimp with Pineapple Herb Dipping Sauce","Ingredients":{"1":"1/2 cup unsweetened shredded coconut","2":"1/4 cup whole wheat flour","3":"2 large egg whites","4":"1 tablespoon water","5":"1/2 cup panko bread crumbs","6":"18 large shrimp, shelled and deveined with tail part of shell left on","7":"1 tablespoon low-sodium soy sauce","8":"1/8 teaspoon freshly ground black pepper","9":"1/2 (8-ounce) can pineapple chunks in juice","10":"1/2 cup loosely packed fresh herbs (basil, rosemary, parsley)","11":"Juice of 1/2 lime"},"Instructions":"Prepare the Coconut Shrimp: Preheat oven to 350°F. Spread coconut on an ungreased baking sheet. Toast in the oven for 3–5 minutes or until golden brown, stirring frequently to ensure even cooking. Transfer coconut to a pie plate; cool.\nTurn oven temperature up to 425°F. Grease the same baking sheet. Place flour in a small bowl. In another small bowl, whisk egg whites with water until foamy. Stir panko into the coconut in the pie plate. In a large bowl, toss shrimp with soy sauce and pepper.\nOne at a time, hold shrimp by tail and coat with flour, shaking off excess; then dip in egg white mixture. Finally, roll in coconut mixture to coat well.\nPlace shrimp on the prepared baking sheet. Bake for 10–12 minutes or until shrimp are opaque throughout and coating is crisp.\nMeanwhile, prepare the Pineapple Herb Dipping Sauce: Drain pineapple, reserving 1/4 cup juice. In a food processor, pulse pineapple, reserved pineapple juice, herbs, and lime juice until blended.\nServe coconut shrimp with dipping sauce.","Image":"//20fix.com/xfood/img/coconut-shrimp-with-pineapple-herb-dipping-sauce.jpg"},{"id":"844","Title":"Apples, Potatoes, and Bacon","Ingredients":{"1":"450g potatoes (about 2 large)","2":"6 juniper berries","3":"2 large apples","4":"30g (2 tablespoons) butter","5":"2 tablespoons olive oil","6":"6 rashers smoked back bacon","7":"A small handful parsley, chopped","8":"150ml (2/3 cup) crème fraîche","9":"1–2 teaspoons grain mustard"},"Instructions":"Put a pan of water on to boil. Scrub the potatoes and cut them into large pieces, drop them into the boiling water and cook for ten minutes, then drain. Roughly crush the juniper berries. Cut the apples into quarters and remove the cores.\nWarm the butter in a shallow pan with the olive oil, then add the crushed juniper berries, apples and drained potatoes. Keep the heat low to moderate and the pan partially covered with a lid. Baste from time to time. As the apples and potatoes edge towards tenderness, add the back bacon to the pan and let it cook in the appley butter. Season with salt, coarsely ground black pepper and half the chopped parsley.\nWhen the potatoes are golden and the apples soft, remove everything from the pan on to warm plates. Tip away any fat, but not any delicious crusty bits stuck to the pan, then spoon in the crème fraîche and mustard. Bring to the boil, stirring constantly, then spoon over the bacon and apples.","Image":"//20fix.com/xfood/img/apples-potatoes-and-bacon.jpg"},{"id":"849","Title":"A Salad of Brussels Sprouts, Clementines, and Russet Apple","Ingredients":{"1":"175g (6 ounces) Brussels sprouts","2":"2 clementines or other small citrus","3":"A russet apple","4":"1 tablespoon sesame seeds","5":"2 tablespoons olive oil","6":"A handful skinned almonds","7":"A large handful flat-leaf parsley leaves","8":"A clementine","9":"A lemon","10":"2 tablespoons olive oil","11":"1 tablespoon white wine vinegar","12":"1 tablespoon honey"},"Instructions":"Put a large pan of water on to boil. Trim the sprouts, then remove the outer leaves and put them into a bowl of cold water. Slice what is left of the sprouts into quarters and add to the leaves. Rinse thoroughly, then drain. Lightly salt the boiling water, then lower in the sprouts. Leave them to cook for a maximum of two minutes, until their colors are bright.\nHave ready a bowl of water with ice cubes in it. Failing that, a basin of very cold water. Drain the sprouts and put them into the iced water. This will stop them cooking.\nRemove the peel from the clementines. Slice the fruit in half, then into thin slices, and place in the salad bowl. Halve the apple, then cut each half into thin segments, removing any seeds as you go. Toss the apples with the clementines.\nIn a dry pan, toast the sesame seeds to a rich golden brown, then tip half of them into a small bowl and the remainder into the clementines and sprouts. Return the pan to the heat, and add the oil and then the almonds. Leave them to cook, moving them around the pan every few minutes, until they are golden and fragrant. Salt lightly, then remove and place on kitchen paper.\nDrain and lightly dry the sprouts and their leaves, then toss them gently with the apples and clementines. Squeeze the clementine and lemon and stir their juice into the reserved sesame seeds. With a fork or a small whisk, beat in the olive oil, white wine vinegar and honey. Season with salt and black pepper, then use to dress the salad.","Image":"//20fix.com/xfood/img/a-salad-of-brussels-sprouts-clementines-and-russet-apple.jpg"},{"id":"862","Title":"Pineapple-Glazed Ham","Ingredients":{"1":"1/2 pineapple, peeled, sliced into rings","2":"1 large orange, sliced into thick rounds","3":"1 (10-lb.) cured smoked bone-in ham or 6-lb. cured boneless ham","4":"3 cups pineapple juice","5":"1/2 cup apple cider vinegar","6":"1/2 cup (packed) light brown sugar","7":"1/4 cup hot sauce","8":"Maraschino cherries (for serving)"},"Instructions":"Preheat oven to 300°F. Stack 2–3 sheets of foil ample enough to cover ham on a work surface and arrange pineapple and orange slices on top in a single layer. Set ham on fruit (if using a bone-in ham and it has a fat cap, score very lightly, making cuts about 3/4\" apart) and wrap up tightly. Transfer to a wire rack set inside a large rimmed baking sheet and bake until an instant-read thermometer inserted into the thickest part of ham registers 115°F, 3–3 1/2 hours for boneless, 3 1/2–4 hours for bone-in.\nMeanwhile, bring pineapple juice, vinegar, brown sugar, and hot sauce to a boil in a large saucepan. Reduce heat; simmer, swirling occasionally, until thick enough to coat a spoon. Keep warm.\nRemove ham from oven and increase oven temperature to 425°F. Unwrap ham, peeling back the foil so it covers the baking sheet (this will make for easy cleanup). Once oven is at 425°F, baste ham with warm glaze and return to oven. Bake, brushing with more glaze every 3 minutes or so, until glaze is deeply browned and thermometer registers 125°F, 12–15 minutes. Carefully transfer ham to a cutting board and let rest 30–60 minutes before slicing.\nWhile ham is resting, roast fruit, spooning juices over from time to time, until deeply browned, 20–25 minutes.\nServe ham with roasted fruit and cherries alongside.","Image":"//20fix.com/xfood/img/pineapple-glazed-ham.jpg"},{"id":"925","Title":"Glazed and Flaky Apple Tart","Ingredients":{"1":"1/2 cup sliced almonds","2":"6 medium sweet-tart apples (such as Pink Lady, Honeycrisp, or Winesap)","3":"1 lemon, halved","4":"1/2 cup pure maple syrup","5":"1/4 cup brandy, preferably apple","6":"2 tsp. vanilla extract","7":"Pinch of kosher salt","8":"2 Tbsp. raw sugar, divided","9":"1 Tbsp. all-purpose flour, plus more for dusting","10":"1 large egg, beaten to blend","11":"Shortcut Puff Pastry","12":"Vanilla ice cream (for serving)"},"Instructions":"Place a rack in middle of oven; preheat to 350°F. Toast almonds on a rimmed baking sheet, tossing once, until golden brown, 6–8 minutes. Let cool.\nReduce oven temperature to 275°F. Peel apples; cut in half. Using a melon baller or teaspoon, scoop out cores. Rub cut sides of lemon all over apples, then place apples cut side down in a 13x9\" baking dish. Squeeze lemon halves over and add maple syrup, brandy, vanilla, and salt. Cover tightly with foil and bake until juices are bubbling and apples are tender but still intact (poke through foil with a tester or toothpick to check), 60–80 minutes. Uncover and let cool. Increase oven temperature to 400°F.\nMeanwhile, toss almonds, 1 Tbsp. raw sugar, and 1 Tbsp. flour in a small bowl; set aside. Let puff pastry sit at room temperature about 4 minutes to soften slightly. Roll out on a lightly floured sheet of parchment paper, dusting with more flour as needed to prevent sticking and rotating once or twice, to a 16x12\" rectangle. Slide parchment paper with pastry onto a large rimmed baking sheet. Trim around sides to straighten and tidy edges, then cut off a 1\" strip from each side (you’ll have 4 strips). Brush around edge of rectangle with egg, then place strips on top, aligning with edges. Trim any overhang from corners. Brush rim you just created with egg and sprinkle with remaining 1 Tbsp. raw sugar. Scatter reserved almond mixture over pastry, staying inside the rim.\nGently arrange apples on top of almond mixture; reserve juices left in dish. Chill tart 15 minutes.\nBake tart 20 minutes. Reduce oven temperature to 350°F and continue to bake until pastry is deep golden brown and puffed, 45–55 minutes.\nMeanwhile, scrape reserved apple juices into a small saucepan and cook over medium heat, swirling pan often, until syrupy (you should have 2–4 Tbsp.), 6–8 minutes. Remove glaze from heat.\nRemove tart from oven and brush glaze over apples. Serve warm or room temperature with scoops of ice cream.\nTart can be baked 10 hours ahead. Store loosely wrapped at room temperature. Reheat in a 250°F oven if desired.","Image":"//20fix.com/xfood/img/glazed-and-flaky-apple-tart.jpg"},{"id":"939","Title":"Coconut-Apple-Ginger Dal","Ingredients":{"1":"2 Tbsp. virgin coconut oil","2":"1/4 tsp. cayenne pepper","3":"1/4 tsp. ground cumin","4":"1/4 tsp. ground turmeric","5":"1/2 large onion, finely chopped","6":"2 garlic cloves, finely chopped","7":"1 (3\") piece ginger, peeled, finely chopped","8":"1 large apple (unpeeled), grated on the large holes of a box grater","9":"1 1/2 cups red lentils","10":"1 (13.5-oz.) can coconut milk","11":"2 Tbsp. fresh lime juice","12":"Kosher salt, freshly ground pepper","13":"Plain yogurt, cilantro leaves, and toasted unsweetened coconut flakes (for serving)"},"Instructions":"Heat oil in a large pot over medium-high. Cook cayenne, cumin, and turmeric, stirring, until fragrant, about 1 minute. Add onion, garlic, and ginger and cook, stirring, until softened, about 3 minutes. Add apple and lentils and stir to coat. Stir in coconut milk and 2 1/2 cups water and bring to a boil. Reduce heat and simmer, stirring occasionally, until lentils are completely soft and dal is thick, 20–25 minutes. Add lime juice and season with salt and pepper.\nDivide dal among bowls and top with yogurt, cilantro, and coconut flakes; season with more pepper.","Image":"//20fix.com/xfood/img/coconut-apple-ginger-dal.jpg"},{"id":"1051","Title":"Chicken in Pineapple Sauce (Chicken Hamonado)","Ingredients":{"1":"3 lb (1.3 kg) chicken pieces of your choice (thighs, drumsticks or wings)","2":"2 tbsp (30 ml) fish sauce","3":"1 tbsp (15 ml) lemon juice","4":"1 tsp freshly ground black pepper, plus more to taste","5":"2 tbsp (30 ml) vegetable oil","6":"4 cloves garlic, chopped","7":"1 small onion, chopped","8":"1 cup (240 ml) unsweetened pineapple juice","9":"2 tbsp (25 g) sugar","10":"2 tbsp (30 ml) soy sauce","11":"1 (14-oz [398-ml]) can pineapple chunks with juice","12":"Salt, to taste","13":"Steamed rice, for serving"},"Instructions":"In a large bowl, combine the chicken pieces with the fish sauce, lemon juice and pepper; toss to combine. Cover with plastic wrap and refrigerate for at least an hour. Drain the chicken and discard the marinade.\nHeat the oil in a Dutch oven or heavy-bottomed pan over medium-high heat. Add the garlic and onion, and sauté until the onion begins to soften, about 2 minutes.\nAdd the chicken and sauté until no longer pink, about 5 minutes.\nAdd the pineapple juice, sugar and soy sauce. Bring to a boil, reduce the heat to medium and simmer covered until the chicken is almost tender, about 20 minutes.\nAdd the pineapple chunks with juice and continue to simmer until the sauce has reduced and the chicken is tender, about 20 minutes. Season to taste with salt.\nServe with steamed rice.","Image":"//20fix.com/xfood/img/chicken-in-pineapple-sauce-hamonado.jpg"},{"id":"1060","Title":"Big Apple Crumble Cupcakes","Ingredients":{"1":"3 1/2 tablespoons granulated sugar","2":"1 cup sifted all-purpose flour","3":"2 teaspoons ground cinnamon","4":"6 tablespoons cold butter, diced into small cubes","5":"1/2 cup light brown sugar","6":"2 1/2 cups sifted all-purpose flour","7":"3 teaspoons baking powder","8":"1 teaspoon ground cinnamon","9":"1/2 teaspoon salt","10":"16 tablespoons unsalted butter","11":"2 cups granulated sugar","12":"4 large eggs","13":"1/3 cup hot water","14":"2 1/2 cups freshly grated apples (4 to 5 medium apples)","15":"16 tablespoons unsalted butter","16":"4 cups confectioners’ sugar","17":"1 teaspoon whole milk","18":"1/8 teaspoon salt","19":"1 teaspoon ground cinnamon","20":"1/4 teaspoon pure vanilla extract"},"Instructions":"Preheat the oven to 350°F.\nIn a medium mixing bowl, combine all of the ingredients, and mix together using your fingertips. Spread the crumb mixture on a cookie sheet lined with parchment paper, and bake for 30 minutes or until the crumble reaches a golden brown color. Let cool and set aside. Leave the oven on to bake the cupcakes.\nLine a cupcake pan with twelve paper baking cups and a second pan with six baking cups.\nSift together the flour, baking powder, cinnamon, and salt, and set aside.\nIn the bowl of a stand mixer or in a bowl with a handheld electric mixer, cream together the butter and sugar until light and fluffy, approximately 3 to 5 minutes.\nAdd the eggs one at a time, mixing slowly after each addition.\nAdd one third of the flour mixture to the butter mixture, then gradually add one third of the hot water, beating slowly until well incorporated. Add another third of the flour mixture, followed by a third of the hot water. Add the remaining flour mixture, followed by the remaining hot water, and beat just until combined. Stop to scrape down the bowl as needed.\nUsing a spatula, fold the grated apple and half of the apple crumble mixture into the batter.\nUsing a standard-size ice cream scoop, fill each baking cup so that it is two-thirds full. Bake for 18 to 20 minutes (start checking at 15 minutes) or until a toothpick inserted into the center of a cupcake comes out clean. After 5 minutes, transfer the cupcakes to a wire rack to cool completely for approximately 20 minutes.\nPlace all ingredients in the bowl of a stand mixer or in a bowl with a handheld electric mixer. Beat until the frosting is light and airy, approximately 3 to 5 minutes. Frost each cupcake with a signature swirl (see below), and top with a sprinkling of the remaining apple crumble.","Image":"//20fix.com/xfood/img/apple-cinnamon-crumble-cupcakes.jpg"}],"t":390,"p":{"limitstart":0,"limit":25,"total":390,"pagesStart":1,"pagesStop":10,"pagesCurrent":1,"pagesTotal":16}}}