{"ingredient":"Fig","recipes":{"s":1,"d":[{"id":"848","Title":"Coconut-Fig Energy Balls","Ingredients":{"1":"30 dried unsweetened Turkish figs (you can easily switch out the figs for dates for a variation)","2":"2 cups unsweetened shredded coconut, divided","3":"1/3 cup coconut oil, melted","4":"1/4 teaspoon ground cinnamon","5":"Sea salt or pink Himalayan sea salt to taste"},"Instructions":"Line a large baking sheet with parchment paper and set aside.\nIn a food processor or blender, place the figs, 1 1/2 cups coconut, coconut oil, cinnamon, and salt and blend until a smooth paste forms. It will have the consistency of brown sugar.\nForm the dough into 1-inch balls, about 1 tablespoon of batter for each, and then roll the balls in the remaining shredded coconut.\nRefrigerate for 30 minutes and serve.","Image":"//20fix.com/xfood/img/coconut-fig-energy-balls.jpg"},{"id":"928","Title":"Cranberry-Fig Sauce","Ingredients":{"1":"3 Tbsp. unsalted butter","2":"1 large shallot, finely chopped","3":"1 Tbsp. finely chopped rosemary","4":"1 lb. fresh (or frozen) cranberries","5":"6 oz. dried Turkish figs, coarsely chopped","6":"2/3 cup (packed) light brown sugar","7":"1/4 cup balsamic vinegar","8":"1/2 tsp. kosher salt, plus more","9":"Pinch of crushed red pepper flakes"},"Instructions":"Melt butter in a large saucepan over medium heat. Cook shallot and rosemary, stirring often, until shallot is starting to turn golden, about 4 minutes. Add cranberries, figs, brown sugar, vinegar, 1/2 tsp. salt, and red pepper flakes and increase heat to medium-high. Bring to a boil, stirring to dissolve sugar, and cook, stirring often and reducing heat as needed to avoid scorching, until cranberries burst, juices are syrupy, and pan is visible when a wooden spoon is dragged across the bottom, 9–12 minutes. Let cool. Taste and season with more salt if needed.\nSauce can be made 1 week ahead. Cover and chill.","Image":"//20fix.com/xfood/img/cranberry-fig-sauce.jpg"},{"id":"954","Title":"Dried Fig and Marsala Tart","Ingredients":{"1":"500g dried figs","2":"50g golden raisins","3":"100ml dry Marsala","4":"100g natural raw granulated sugar","5":"50g butter","6":"175g cold butter","7":"225g all-purpose flour","8":"2 Tbsp natural raw granulated sugar","9":"2 large egg yolks","10":"Heavy cream, ice cream, or crème fraîche","11":"You will also need a 24cm round Tatin tin or shallow, non-stick cake tin with a fixed base."},"Instructions":"Set the oven at 400°F/200°C/Gas 6. Put the figs and raisins into a mixing bowl, pour over the Marsala and leave to stand for forty-five minutes, stirring occasionally.\nCut the cold butter into small cubes and rub into the flour, either with your fingertips or using a food processor. Work until you have what looks like coarse, fresh breadcrumbs. Stir in the sugar.\nAdd the egg yolks to the butter and flour. Mix together until you have a soft dough, then turn out on to a floured board and knead briefly, for just a minute. Shape the dough into a smooth, fat cylinder. Wrap it in greaseproof paper or clingfilm and leave to rest in the fridge for thirty minutes.\nPlace the Tatin mould or a frying pan over a moderate heat. (If you will be baking the tart in a cake tin, use a frying pan to make the caramel, otherwise you will damage your tin.) Add the Marsala from the dried fruit, leaving the fruit behind in the bowl, then add the sugar. Bring to the boil and leave to form a thin caramel. If you are using a Tatin mould, remove from the heat. If you are using a cake tin, pour the caramel from the frying pan into the tin.\nCut the butter into small cubes and scatter it over the caramel. Place the plumped-up figs on the base of the tin in a single layer (neatly or not, as you wish), then scatter over the raisins, pushing them into any gaps.\nRoll out the pastry a little larger than the Tatin mould or cake tin. With the help of the rolling pin—it is very fragile—lift the pastry into the mould or tin, pressing it gently into place over the figs. Tuck in any overhanging pastry.\nBake in the preheated oven for about thirty minutes, until the pastry is golden. Remove from the oven and leave to settle for ten to fifteen minutes. Place a large serving plate on top of the tart, then, using oven gloves, hold the tin and plate firmly and carefully turn them over, leaving the tart to slide out on to the plate. Serve warm with cream, ice cream or crème fraîche.","Image":"//20fix.com/xfood/img/dried-fig-and-marsala-tart.jpg"},{"id":"959","Title":"Beet and Fig Salad with Candied Pecans","Ingredients":{"1":"1/2 cup pecans","2":"2 tablespoons honey","3":"2 pounds small red beets","4":"1 1/2 cups extra virgin olive oil","5":"Maldon sea salt and freshly cracked black pepper","6":"Juice of 1 lemon","7":"4 to 6 cups arugula","8":"1 pint fresh Black Mission figs","9":"1/2 cup Kefir Labneh"},"Instructions":"Preheat the oven to 335°F. In a small ovenproof sauté pan, combine the pecans and honey and place in the oven. After 5 minutes, stir the pan to evenly coat the pecans with the now-melted honey. After another 5 minutes, stir again. After a final 5 minutes, remove the pan from the oven and empty the nuts out onto parchment paper, making sure to separate each nut so they don’t stick together once cool.\nPreheat the oven to 375°F. Slice the tops off the beets and wash the beets thoroughly. Toss the beets with enough olive oil to coat (about 1/2 cup) and a pinch each of sea salt and pepper. Place in a shallow roasting pan, add about 1/4 inch water to the pan, and cover with foil. Roast until a small knife easily pierces a beet, 45 to 60 minutes. When cool enough to handle, use your hands and a towel to slide the peels off under cold running water. Cut the beets into wedges and toss them with half of the lemon juice, a pinch of sea salt, and 1/2 cup olive oil. Set aside.\nIn a bowl, toss the arugula with a pinch of sea salt and the remaining lemon juice and olive oil and divide among four plates. Add the figs to the bowl that had the arugula and toss with whatever dressing is still in the bowl (give them a good stir to coat). Arrange the figs atop the arugula. Add the beets and pecans to the plates in the same manner and garnish with small dollops of labneh.","Image":"//20fix.com/xfood/img/beet-and-fig-salad-with-candied-pecans.jpg"},{"id":"1066","Title":"Lemon and Fig Cupcakes","Ingredients":{"1":"2 1/2 cups sifted all-purpose flour","2":"2 1/2 teaspoons baking powder","3":"1/4 teaspoon salt","4":"8 tablespoons unsalted butter","5":"1 3/4 cups sugar","6":"2 large eggs","7":"2 1/4 teaspoons pure vanilla extract","8":"1 1/4cups whole milk","9":"1/2 cup freshly squeezed lemon juice","10":"1/2 cup freshly grated lemon zest (from approximately 2 to 3 lemons)","11":"1/2 cup fresh or dried figs, sliced","12":"4 tablespoons unsalted butter","13":"4 cups sifted confectioners’ sugar","14":"1/4 teaspoon pure vanilla extract","15":"6 ounces cream cheese"},"Instructions":"Preheat the oven to 350˚F. Line two cupcake pans with twelve paper baking cups each. Sift together the flour, baking powder, and salt in a bowl, and set aside.\nIn the bowl of a stand mixer or in a bowl with a handheld electric mixer, cream together the butter and sugar until light and fluffy, approximately 3 to 5 minutes.\nAdd the eggs one at a time, mixing slowly after each addition.\nCombine the vanilla extract and milk in a large liquid measuring cup.\nAdd one third of the flour mixture to the butter mixture, then gradually add one third of the milk mixture, beating slowly until well incorporated. Add another third of the flour mixture, followed by another third of the milk mixture. Stop to scrape down the bowl as needed. Add the remaining flour mixture, followed by the remaining milk mixture, and beat just until combined.\nAdd the lemon juice and lemon zest, and mix until well combined.\nScoop batter into the baking cups so that each is two-thirds full. On top of each cupcake, place one fig slice so that it covers the surface of the batter. Bake for 15 to 18 minutes or until a toothpick inserted into the center of a cupcake comes out clean. Transfer the pans to a wire rack to cool completely. Serve and enjoy!\nIn the bowl of a stand mixer or in a bowl with a handheld electric mixer, mix all the ingredients for approximately 3 to 5 minutes, until the frosting is light and airy. Frost each cupcake with a thick layer of the frosting using an offset spatula.","Image":"//20fix.com/xfood/img/lemon-and-fig-cupcakes.jpg"},{"id":"1665","Title":"Pork Chops with Fig and Grape Agrodolce","Ingredients":{"1":"4 (1\"-thick) bone-in pork chops, preferably Frenched (about 2 pounds)","2":"1 1/2 teaspoons kosher salt, divided","3":"1 1/4 teaspoon freshly ground black pepper, divided","4":"4 tablespoons extra-virgin olive oil, divided","5":"3/4 cup balsamic vinegar","6":"1/2 teaspoon crushed red pepper flakes (optional)","7":"2 tablespoons plus 1 teaspoon honey, divided","8":"2 cups seedless red grapes, halved (about 10 ounces)","9":"8 ounces fresh black Mission figs, halved","10":"3 sprigs rosemary","11":"1/4 cup (1/2 stick) cold unsalted butter, cubed","12":"1 tablespoon fresh lemon juice","13":"1/2 teaspoon Dijon mustard","14":"1 small head of radicchio (about 10 ounces), leaves separated and cut into medium pieces","15":"1 cup (loosely packed) parsley leaves"},"Instructions":"Preheat oven to 400°F. Season pork chops on both sides with 1 1/4 tsp. salt and 1 tsp. pepper.\nHeat 1 Tbsp. oil in a large skillet over high. Working in batches if needed, sear pork chops until browned, about 2 minutes per side. Transfer chops to a wire rack set inside a rimmed baking sheet; reserve pan drippings in skillet. Roast pork until an instant-read thermometer inserted into the center registers 135°F, about 15 minutes. Let pork rest 5 minutes.\nMeanwhile, heat skillet with drippings over medium-high. Add vinegar and cook, scraping up drippings with a wooden spoon. Stir in red pepper flakes, if using, 2 Tbsp. honey, and 1/4 tsp. salt. Add grapes, figs, and rosemary and stir to coat. Continue to cook, stirring occasionally, until sauce is thickened and fruit is softened, about 8 minutes. Remove from heat and stir in butter.\nWhisk lemon juice, mustard, and remaining 3 Tbsp. oil, 1 tsp. honey, 1/2 tsp. salt, and 1/4 tsp. pepper in a large bowl. Add radicchio and parsley and toss to coat.\nDivide radicchio salad and pork chops among plates. Top with agrodolce.","Image":"//20fix.com/xfood/img/pork-chops-with-fig-and-grape-agrodolce.jpg"},{"id":"2259","Title":"Figs-in-a-Blanket with Goat Cheese","Ingredients":{"1":"1/4 cup plus 2 tablespoons red wine vinegar","2":"3 tablespoons honey","3":"3/4 teaspoon crushed red pepper flakes","4":"1/2 teaspoon kosher salt","5":"1/2 teaspoon freshly ground black pepper","6":"24 dried black Mission figs (medium or large), stems trimmed, halved","7":"1 large egg","8":"1 (14- or 17-ounce) box of puff pastry (preferably all-butter puff), thawed according to package directions","9":"All-purpose flour (for surface)","10":"6 1/2 ounces plain goat cheese","11":"Sesame seeds or poppy seeds (for topping; optional)"},"Instructions":"Arrange racks in upper and lower thirds of oven; preheat to 400°F. Line 2 rimmed baking sheets with parchment paper.\nStir vinegar, honey, red pepper flakes, salt, pepper, and 1 cup water in a medium pot. Add figs and bring to a boil. Reduce heat, bring to a simmer, and cook, stirring occasionally, until figs are softened and liquid has almost evaporated and is a syrupy consistency, 7–10 minutes. Transfer figs to a plate; let cool.\nBeat egg with 1 Tbsp. water in a small bowl. If using a 14-ounce package with 1 sheet of pastry, roll pastry to an 18x12\" rectangle on a lightly floured surface. If using a 17-ounce package with 2 sheets of pastry, roll each sheet to a 12x9\" rectangle. Cut pastry along the 12\" side into 12 (1-inch-wide) strips. Cut each strip crosswise into pieces about 4 1/2\" long. You should have 48 (4 1/2x1\") strips pastry.\nScoop a heaping 1/2 tsp. cheese and press into cut side of 1 fig half. Place fig half in the center of 1 pastry strip. Brush 1 end of pastry with egg wash and roll to enclose. Transfer seam side down to prepared sheet. Repeat with remaining cheese, figs, and pastry. Brush top of each pastry with egg wash and sprinkle with seeds, if using. Bake pastries, rotating and switching sheets top to bottom halfway through, until golden brown and puffed, 15–18 minutes.\nFigs can be cooked 2 days ahead; cover and chill.","Image":"//20fix.com/xfood/img/figs-in-a-blanket-with-goat-cheese.jpg"},{"id":"2326","Title":"Duck Two Ways With Clementine-Fig Relish","Ingredients":{"1":"1 tablespoon black peppercorns, lightly crushed","2":"1 tablespoon coriander seeds, lightly crushed","3":"1 tablespoon fennel seeds, lightly crushed","4":"8 duck legs (about 8 1/2 pounds), excess fat trimmed, frenched","5":"Kosher salt","6":"4 duck breasts (about 3 1/2 pounds), fat trimmed","7":"2 tablespoons vegetable oil","8":"2 medium leeks, white and pale-green parts only, chopped","9":"12 sprigs thyme","10":"4 garlic cloves, crushed","11":"2 bay leaves","12":"2 cups dry white wine","13":"2 clementines, very thinly sliced crosswise (with peel), seeds removed","14":"1 cup dried black Mission figs, halved","15":"1 1/2 cups cognac or brandy","16":"1 cup sugar","17":"2 tablespoons whole grain mustard","18":"1/2 teaspoon crushed red pepper flakes","19":"2 bay leaves","20":"2 tablespoons sherry vinegar or red wine vinegar"},"Instructions":"Mix peppercorns, coriander seeds, and fennel seeds in a small bowl. Prick skin of duck legs all over with a paring knife; season generously with salt. Sprinkle duck legs with spice mixture, pressing to adhere. Score fat of each duck breast in a crosshatch pattern, spacing 1/2” apart; season all over with salt. Divide legs and breasts between 2 large rimmed baking sheets. Let sit at room temperature 1 hour or chill uncovered up to 3 days.\nIf chilling, let duck legs sit at room temperature 1 hour before braising.\nPlace a rack in lower third of oven; preheat to 300°F. Heat oil in a large wide Dutch oven or other heavy pot over medium and cook leeks, stirring occasionally, until softened and browned around edges, 8–10 minutes. Add thyme sprigs, garlic, and bay leaves and cook, stirring occasionally, until fragrant and garlic is slightly softened, about 2 minutes. Add wine, bring to a boil, and simmer until reduced by half, about 5 minutes.\nRemove pot from heat and slip duck legs, skin side down, into liquid (depending on size of pan, they may overlap quite a bit—this is okay!). Pour in water to come three-quarters of the way up legs. Cover pot and braise duck legs in oven until submerged in their own fat, 1 1/2–2 hours.\nTurn duck legs skin side up and continue to braise (still covered) until tender and the bones wiggle easily in joints, 1 1/2–2 hours longer. Let legs cool in braising liquid, then chill until fat rises to the surface and solidifies, at least 2 hours.\nCook clementines, figs, cognac, sugar, mustard, red pepper flakes, and bay leaves in a medium saucepan over medium heat, stirring occasionally to dissolve sugar, until figs absorb some liquid and mixture is syrupy, 10–15 minutes. Let cool; remove bay leaves. Stir in vinegar, then strain 1/3 cup syrup through a fine-mesh sieve into a small bowl; set aside to use for glazing duck. Set remaining relish aside for serving.\nLet duck breasts sit until room temperature, about 1 hour.\nPlace 2 duck breasts, skin side down, in a large skillet; set over medium-low heat and cook duck, occasionally pouring excess fat from skillet into a bowl (save it!), until skin is golden brown and crisp, 12–15 minutes. Turn duck over, increase heat to medium, and cook on other side 2 minutes. Transfer to a cutting board. Wipe out skillet and let cool down, then repeat with remaining 2 breasts. (If you have 2 large skillets, by all means do all 4 breasts at once.) Let rest at least 10 minutes before slicing.\nMeanwhile, place a rack in upper third of oven; preheat to 425°F. Remove duck legs from braising liquid, brushing off any seeds or fat clinging to surface. Place, skin side up, on a wire rack set inside a foil-lined rimmed baking sheet and lightly brush with reserved glaze. Roast until golden brown and skin is crisp, 10–15 minutes.\nServe duck legs and sliced breasts with reserved relish.\nDuck legs can be braised 2 days ahead. Keep chilled. Relish can be made 2 days ahead. Cover and chill strained glaze and relish separately. Bring to room temperature before using.","Image":"//20fix.com/xfood/img/duck-two-ways-with-clementine-fig-relish.jpg"},{"id":"2412","Title":"Cranberry Chutney With Orange, Figs, and Mustard","Ingredients":{"1":"2 tablespoons olive oil","2":"1 medium shallot, finely chopped","3":"1 (2-inch) piece ginger, peeled, finely chopped","4":"3/4 teaspoon ground cinnamon","5":"1 medium orange, unpeeled, seeds removed, chopped","6":"6 dried Turkish figs, chopped","7":"1 3/4 cups sugar","8":"1/2 cup sherry vinegar or red wine vinegar","9":"2 tablespoons whole grain mustard","10":"1 (10-ounce) bag fresh or frozen cranberries","11":"Kosher salt, freshly ground pepper"},"Instructions":"Heat oil in a large saucepan over medium. Cook shallot and ginger, stirring occasionally, until shallot is translucent, about 3 minutes. Stir in cinnamon and cook, stirring often, until fragrant, about 1 minute. Mix in orange, figs, sugar, vinegar, mustard, and 1/2 cup water and bring to a simmer, stirring until sugar is dissolved. Add cranberries and increase heat to medium-high. Bring to a boil and cook, stirring occasionally, until cranberries burst and liquid is reduced to a light syrup, 12–18 minutes. Let cool slightly; season with salt and pepper.\nChutney can be made 1 week ahead. Let cool; cover and chill.","Image":"//20fix.com/xfood/img/cranberry-chutney-with-orange-figs-and-mustard.jpg"},{"id":"2440","Title":"Figs with Bacon and Chile","Ingredients":{"1":"5 ounces slab bacon, sliced 1/2 inch thick, then sliced crosswise into 1/2-inch pieces","2":"3 tablespoons pure maple syrup","3":"8 ripe fresh figs, halved lengthwise","4":"2 tablespoons sherry vinegar or red wine vinegar","5":"1/2 teaspoon crushed red pepper flakes, finely chopped"},"Instructions":"Cook bacon pieces in a large nonstick skillet over medium-low, stirring often, until brown and crisp, 8–10 minutes. Using a slotted spoon, transfer bacon to a small bowl.\nPour off all but 2 Tbsp. fat from skillet; save for another use. Add maple syrup to skillet, swirling to combine, and heat over medium-high. Arrange figs in skillet in a single layer, cut side down. Cook, swirling liquid occasionally, until figs are slightly softened and caramelized, about 5 minutes.\nArrange figs cut side up on a platter and press pieces of bacon onto the surface of each fig.\nSet the skillet over medium heat, add vinegar, and stir into juices. Bring to a simmer and cook, stirring constantly, until syrupy, about 1 minute. Drizzle syrup over figs, then sprinkle with red pepper.","Image":"//20fix.com/xfood/img/figs-with-bacon-and-chile.jpg"},{"id":"2532","Title":"Apple and Fig Custard","Ingredients":{"1":"4 tablespoons unsalted butter, plus more for dish","2":"2 tablespoons demerara sugar, plus more for sprinkling","3":"1/2 cup granulated sugar","4":"2 teaspoons finely grated lemon zest","5":"1 vanilla bean, halved lengthwise","6":"3 large eggs, room temperature","7":"2/3 cup whole milk, room temperature","8":"2 tablespoons apple brandy or dark rum","9":"3/4 cup crème fraîche, room temperature","10":"1/2 cup all-purpose flour","11":"1 teaspoon kosher salt, plus more","12":"2 pounds firm baking apples (about 4 large), peeled, cored, sliced into 1/2-inch-thick rings","13":"6 ounces fresh mission figs, halved lengthwise"},"Instructions":"Place rack in top third of oven; preheat to 450°F. Butter a shallow 2-qt. baking dish and sprinkle with demerara sugar. Combine granulated sugar and zest in a medium bowl. Scrape in seeds from vanilla bean; save pod for another use. Massage zest and seeds into sugar with your fingers until mixture is very fragrant.\nBlend eggs in a blender until very frothy, about 1 minute. With motor running, gradually stream in milk, then brandy. Add sugar mixture, crème fraîche, flour, and 1 tsp. salt and blend just until smooth. Let custard rest while you roast the apples.\nCook remaining 4 Tbsp. butter in a small saucepan over medium heat, stirring often, until butter foams, then browns (do not let it burn), about 5 minutes. Remove from heat and add apples, a pinch of salt, and remaining 2 Tbsp. demerara sugar and toss to coat.\nArrange apples in a single layer on a rimmed baking sheet. Roast in oven, tossing halfway through, until caramelized and tender, 25–30 minutes. Let apples sit until they are cool enough to handle but still warm (otherwise they’ll stick), then arrange in prepared dish, reserving a few slices for placing on top. Add figs, reserving a few for on top. Place dish on a rimmed baking sheet and carefully pour custard over fruit. Arrange reserved apple slices and figs on top. Reduce oven temperature to 375°F and bake custard until golden and center is firm, 30–35 minutes. Let cool slightly before serving.\nCustard can be blended 1 day ahead. Cover and chill. Bring to room temperature and mix gently before pouring over fruit.","Image":"//20fix.com/xfood/img/apple-and-fig-custard.jpg"},{"id":"3158","Title":"Fig-Braised Chicken with Spiced Walnuts","Ingredients":{"1":"2 tablespoon ghee or olive oil","2":"1/2 cup dried mission figs, diced","3":"1/2 cup dried cherries","4":"1/4 cup balsamic vinegar","5":"1 tablespoon Worcestershire sauce","6":"6 boneless, skinless chicken thighs","7":"2 tablespoons ghee or olive oil","8":"1 teaspoon sea salt","9":"1 cup Chicken Bone Broth","10":"Chopped fresh flat-leaf parsley, for garnish","11":"1/2 cup walnuts","12":"1 tablespoon olive oil","13":"1/4 teaspoon sea salt","14":"1/4 teaspoon paprika"},"Instructions":"In a cast-iron skillet or sauté pan over medium-high heat, add 1 tablespoon ghee or oil along with the figs and cherries and sauté for 2 minutes. Add the balsamic vinegar and Worcestershire sauce and simmer to reduce by one third, about 3 minutes. Remove from the heat.\nTransfer the marinade to a bowl and place in the freezer to cool for about 10 minutes.\nIn the same bowl or a resealable zip-top bag, combine the chicken and marinade. Mix thoroughly to coat the chicken evenly, cover if using a bowl, and refrigerate for at least 2 hours, or up to 24 hours.\nWhen you are ready to eat, preheat the oven to 400°F.\nTransfer the chicken from the marinade to a plate. Reserve the marinade.\nHeat the remaining 1 tablespoon ghee or oil in an oven-safe cast-iron skillet or sauté pan over medium-high heat. Season the chicken thighs with the sea salt and cook the chicken in the hot ghee or oil until browned, about 3 minutes per side. Add the reserved marinade and bone broth and bring to a simmer. Reduce the liquid by half, about 10 minutes, turning the chicken periodically to ensure even cooking.\nOn a baking sheet or in an oven-safe sauté pan, toss the walnuts with the olive oil, sea salt, and paprika. Spread out in an even layer and toast in the oven for about 10 minutes.\nTransfer the skillet or pan with the chicken to the oven and cook for 10 minutes. Remove from the oven and let sit for 10 minutes. Serve the chicken, garnished with toasted walnuts and chopped fresh parsley.","Image":"//20fix.com/xfood/img/fig-braised-chicken-with-spiced-walnuts.jpg"},{"id":"3426","Title":"Milk Pudding with Rose Water Caramel and Figs","Ingredients":{"1":"1/3 cup cornstarch","2":"3 cups whole milk, divided","3":"1 cup heavy cream","4":"3 tablespoons honey","5":"3 tablespoons sugar","6":"Pinch of kosher salt","7":"1 cup sugar","8":"2 tablespoons light corn syrup","9":"1 3\" cinnamon stick","10":"1/2 teaspoon rose water","11":"8 fresh black figs, quartered"},"Instructions":"Whisk cornstarch and 1 cup milk in a medium bowl; set slurry aside.\nHeat cream, honey, sugar, salt, and remaining 2 cups milk in a medium saucepan over medium, whisking occasionally, until mixture just begins to boil, 8–10 minutes. Whisking constantly, gradually add reserved slurry and cook, still whisking, until pudding thickens and comes to a boil, about 1 minute. Scrape into a large bowl and cover with plastic wrap, pressing directly against surface. Chill until cold, at least 4 hours.\nPudding can be made 2 days ahead. Keep chilled.\nBring sugar, corn syrup, and 1/4 cup water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Cook, swirling pan occasionally (do not stir), until caramel turns golden amber. Remove from heat, add cinnamon stick, and stir in 1/4 cup water (be careful as caramel will bubble vigorously); stir to combine and loosen. Stir in rose water, then gently toss figs in caramel. Remove cinnamon stick.\nWhisk chilled pudding until smooth and creamy. Divide among bowls; serve topped with warm caramel and figs.","Image":"//20fix.com/xfood/img/milk-pudding-with-rose-water-caramel-and-figs-56390105.jpg"},{"id":"4182","Title":"Roast Ducks with Potatoes, Figs, and Rosemary","Ingredients":{"1":"2 5-pound whole Peking ducks","2":"2 large onions, quartered","3":"1 large bunch rosemary, divided","4":"Kosher salt, freshly ground pepper","5":"3 pounds small Yukon Gold potatoes, peeled","6":"2 pints fresh black Mission or Turkish figs, halved"},"Instructions":"Many purveyors stock these birds frozen, so pick them up a day or two before cooking so they can defrost.\nPreheat oven to 425°. Set ducks, breast side down, on a work surface and score fatty areas along backs and thighs with a paring knife, being careful not to cut into flesh. Turn over and score fat, concentrating mainly on breasts but extending to tops of legs. Poke a few holes around extra-fatty areas of cavity.\nStuff ducks with onions and all but 4 sprigs rosemary; season generously with salt and pepper (much of the seasoning will melt away as the fat renders).\nPlace ducks, breast side down, in a large roasting pan; pour in 1/2 cup water. Roast, rotating pan occasionally, until duck fat starts to render, water is evaporated, and skin is golden brown, about 40 minutes. Remove pan from oven and transfer ducks to a platter or baking dish. Carefully pour rendered fat into a heatproof measuring cup.\nToss potatoes and 1/4 cup duck fat in roasting pan (save remaining fat for another use); season with salt and pepper. Scoot potatoes to perimeter and return ducks to pan, breast side up. Roast until potatoes and dark meat are tender and an instant-read thermometer inserted into breasts registers 155°, 50–60 minutes. Transfer ducks to a cutting board; let rest at least 10 minutes before carving.\nMeanwhile, add figs and remaining 4 rosemary sprigs to pan; toss well. Roast until figs are soft and juicy, 5–8 minutes. Serve duck with figs and potatoes.","Image":"//20fix.com/xfood/img/roast-ducks-with-potatoes-figs-and-rosemary-51259450.jpg"},{"id":"4257","Title":"Cal-Italia Pizza with Prosciutto and Figs","Ingredients":{"1":"1 (13-ounce/370-gram) ball Master Dough , preferably with starter made with Poolish","2":"1 cup (255 grams) balsamic vinegar","3":"3 parts flour mixed with 1 part semolina, for dusting","4":"2-ounce (55-gram) piece Asiago cheese, cold, for shaving","5":"6 ounces (170 grams) whole-milk mozzarella cheese, shredded (1-1/2 cups)","6":"1-1/2 ounces (45 grams) Gorgonzola cheese, broken into small pieces","7":"2 to 3 tablespoons (40-60 grams) fig jam, preferably Dalmatia brand","8":"3 ounces (85 grams) thinly sliced prosciutto (about 6 slices)","9":"2 pizza baking stones or steels, pizza peel"},"Instructions":"Remove the dough ball from the refrigerator and leave wrapped at room temperature until the dough warms to 60°F to 65°F. Meanwhile, set up the oven with two pizza stones or baking steels and preheat to 500°F for 1 hour.\nMeanwhile, put the vinegar in a small, heavy saucepan over medium heat. Once steam is rising from the surface, reduce the heat to the lowest setting to keep the vinegar below a simmer. No bubbles should break through the surface. If the lowest setting is still too hot, place the pan over a diffuser. Once the vinegar has reduced by three-fourths, remove it from the heat. The glaze can be stored in a covered container at room temperature for several months.\nDust the work surface with the dusting mixture, then move the dough to the surface and dust the top.\nSprinkle a wooden peel with the dusting mixture.\nRoll out the dough into a round 15 inches in diameter. Using a pizza wheel, trim the dough to a 13-inch round, flatten the edge, then dock the surface of the dough.\nMove the dough to the peel. As you work, shake the peel forward and backward to ensure the dough isn't sticking.\nUsing a vegetable peeler, shave the Asiago over the surface of the dough, leaving a 3/4-inch border. Mound the mozzarella in the center of the pizza and use your fingertips to spread it out evenly over the Asiago.\nSlide the pizza onto the top stone.\nBake for 7 minutes. Lift the pizza onto the peel and distribute the Gorgonzola pieces evenly over the top. Rotate the pizza 180 degrees, transfer it to the bottom stone, and bake for 3 to 4 minutes, until the bottom is browned and crisp and the top is golden brown.\nTransfer the pizza to a cutting board and cut into 6 wedges. Spoon small dollops of fig jam (about 1/4 teaspoon each) around the pizza. Tear the prosciutto slices lengthwise into 2 or 3 strips and drape the pieces over the pizza slices. To finish, squeeze a thin spiral of balsamic glaze onto the pizza.","Image":"//20fix.com/xfood/img/cal-italia-pizza-with-prosciutto-and-figs-51255840.jpg"},{"id":"4413","Title":"Fig and Walnut Bostock","Ingredients":{"1":"1 cup walnuts","2":"4 tablespoons (1/2 stick) unsalted butter, room temperature","3":"1/4 cup honey","4":"1 large egg","5":"1/4 cup all-purpose flour","6":"3/4 teaspoon baking powder","7":"1/4 teaspoon kosher salt","8":"2 large eggs, beaten to blend","9":"8 1\"-thick slices brioche, preferably day-old (from about 1 medium loaf)","10":"8 large fresh figs, quartered","11":"4 tablespoons (1/2 stick) unsalted butter, melted","12":"2 tablespoons honey","13":"Powdered sugar (for serving)"},"Instructions":"Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing occasionally, until fragrant, 8.10 minutes; let cool. Pulse in a food processor until finely ground.\nUsing an electric mixer on high speed, beat butter and honey until light and fluffy, about 4 minutes. Mix in egg, then flour, baking powder, salt, and walnuts just to blend.\nPreheat oven to 350°. Whisk eggs and 1 teaspoon water in a small bowl and brush 1 side of brioche slices with egg wash. Place on a rimmed baking sheet and spread each slice with about 2 tablespoons walnut creme. Top with figs, cut side up. Brush figs with butter and drizzle with honey.\nBake bostock until edges are golden brown and figs look softened and juicy, 20.25 minutes. Transfer baking sheet to a wire rack and let bostock cool.\nDust with powdered sugar just before serving.","Image":"//20fix.com/xfood/img/fig-and-walnut-bostock-51248650.jpg"},{"id":"4534","Title":"Yogurt with Fresh Figs, Honey, and Pine Nuts","Ingredients":{"1":"3 tablespoons pine nuts","2":"1/4 cup honey","3":"1/2 teaspoon rose water or orange-flower water","4":"3 cups plain Greek yogurt","5":"16 fresh figs, halved"},"Instructions":"Toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden brown, about 4 minutes. Immediately transfer to a plate.\nHeat honey and rose water in a small saucepan over medium heat, stirring occasionally, until very runny, about 1 minute (do not let boil); let cool.\nServe yogurt and figs drizzled with warm honey mixture and topped with pine nuts.","Image":"//20fix.com/xfood/img/yogurt-with-fresh-figs-honey-and-pine-nuts-51239840.jpg"},{"id":"4600","Title":"Dutch Oven Cornbread with Fig Jam","Ingredients":{"1":"3/4 cup (1 1/2 sticks) unsalted butter","2":"1 1/2 cups all-purpose flour","3":"1 1/2 cups cornmeal","4":"1/4 cup sugar","5":"2 teaspoon baking soda","6":"2 teaspoon kosher salt","7":"1/2 teaspoon baking powder","8":"3 large eggs","9":"1 cup whole milk","10":"3/4 cup fig jam"},"Instructions":"Preheat oven to 425°. Place butter in a 10\"-12\"-diameter Dutch oven, cover, and place in oven to heat pot and melt butter, 6-8 minutes (don't let butter burn). Swirl butter to coat bottom and partway up sides of pan; pour butter into a small bowl and set aside.\nMeanwhile, whisk flour, cornmeal, sugar, baking soda, salt, and baking powder in a large bowl. Whisk eggs and milk in a medium bowl; add to cornmeal mixture along with reserved melted butter and whisk to combine. Scrape batter into hot Dutch oven.\nCover and bake until cornbread has started to set around edges, 10-12 minutes. Dot surface with jam. Cover and bake until a tester inserted into the center comes out clean, 15-20 minutes longer. Let cool, uncovered, 15 minutes. To serve, cut cornbread into wedges.","Image":"//20fix.com/xfood/img/dutch-oven-cornbread-with-fig-jam-51238440.jpg"},{"id":"4680","Title":"Inside-Out Grilled Cheese with Fig Chutney and Caramelized Onions","Ingredients":{"1":"1 tablespoon olive oil","2":"1 tablespoon unsalted butter","3":"2 large yellow onions, halved and very thinly sliced","4":"3 thyme sprigs","5":"1/2 teaspoon kosher salt","6":"1/4 teaspoon black pepper","7":"1 1/2 cups chopped dried black mission figs","8":"2 (3-inch) strips orange zest","9":"2 tablespoons fresh orange juice","10":"1/4 cup apple cider vinegar","11":"2 tablespoons honey","12":"3 thyme sprigs","13":"1/4 cup chopped hazelnuts","14":"1/4 teaspoon kosher salt","15":"1/4 teaspoon black pepper","16":"8 ounces Halloumi cheese, sliced lengthwise into 4 (3/8-inch-thick) slices","17":"1 tablespoon olive oil","18":"1/2 cup baby arugula"},"Instructions":"Heat the olive oil and butter in a large skillet over medium heat. Add the onions and cook until softened, stirring occasionally, about 20 minutes. Reduce the heat to low, add 3 thyme sprigs, and continue to cook and stir until onions are completely soft and light brown in color, 30 to 40 minutes more. Remove from heat and discard thyme sprigs. Season with 1/2 teaspoon salt and 1/4 teaspoon pepper.\nIn a medium pot over medium heat, cook the figs, orange zest and juice, vinegar, honey, 3 thyme sprigs, and 1/2 cup water. Stir occasionally until thickened and starting to break down, 12 to 15 minutes. Add additional water, 1 tablespoon at a time, if necessary to achieve a jammy consistency. Discard the orange zest and thyme sprigs, stir in the hazelnuts, and cook 2 minutes more. Remove from heat and season with 1/4 teaspoon salt and 1/4 teaspoon pepper.\nHeat a grill or grill pan over medium high heat. Brush the slices of Halloumi on one side with 1 tablespoon olive oil. Place the oiled side on the grill and cook until browned, 1 to 2 minutes. Place one slice Halloumi, grilled side down, on a plate and layer 1/4 cup arugula, 2 tablespoons caramelized onions, and 2 tablespoons fig chutney on top. Top with another slice of Halloumi, grilled side up, to form a sandwich. Repeat with remaining Halloumi to make a second sandwich.\nThe leftover caramelized onions and fig chutney can be refrigerated for up to a week.","Image":"//20fix.com/xfood/img/inside-out-grilled-cheese-with-fig-chutney-and-caramelized-onions-51234920.jpg"},{"id":"4779","Title":"Fighting Irish","Ingredients":{"1":"3/4 ounce 12-year-old Irish whiskey, such as Redbreast","2":"3/4 ounce 12-year-old single-malt Scotch whisky, such as Bowmore","3":"3/4 ounce Green Chartreuse","4":"3/4 ounce freshly squeezed lemon juice","5":"3/4 ounce fresh pineapple juice","6":"1/2 ounce orgeat syrup*","7":"5 dashes habanero bitters, such as Bittermens","8":"Freshly grated nutmeg for garnish","9":"*Orgeat is a sweet syrup made from almonds, sugar, and orange-flower or rose water. Fee Brothers and Torani orgeat syrups are available on Amazon."},"Instructions":"Chill a punch glass.\nIn a cocktail shaker, combine the Irish whiskey, Scotch whisky, Green Chartreuse, lemon juice, pineapple juice, orgeat syrup, and bitters. Add ice and shake vigorously until well chilled, about 30 seconds. Fine-strain into a chilled glass, finish with freshly grated nutmeg, and serve.","Image":"//20fix.com/xfood/img/fighting-irish-51228410.jpg"},{"id":"4787","Title":"Charred Brussels Sprouts with Pancetta and Fig Glaze","Ingredients":{"1":"3 tablespoons olive oil (divided)","2":"3 to 4 ounces pancetta, diced","3":"1 1/2 pounds Brussels sprouts, trimmed and halved (or quartered if large) through the stem end (about 6 cups)","4":"1/4 teaspoon kosher salt","5":"2 tablespoons fig jam","6":"1 tablespoon water","7":"1/4 teaspoon freshly ground black pepper"},"Instructions":"In a large (12 inches or wider) frying pan, heat 1 tablespoon of the oil over medium heat. Add the pancetta and cook, stirring occasionally, for about 3 minutes, until crisp. Using a slotted spoon, transfer the pancetta to a small bowl. Return the pan to medium-high heat and add the remaining 2 tablespoons oil. Add the Brussels sprouts, keeping them in a single layer as much as possible. Having a few extra sprouts is fine, but if they are mounded in a pile, they will not brown or cook evenly. If necessary, use a larger pan, cook them in two batches, or pull out the extra for another use. Stir in the salt. Cook, stirring occasionally, for about 10 minutes, until the Brussels sprouts are tender and well browned—even charred in spots. If the sprouts are browning too quickly, lower the heat to medium.\nAdd the fig jam and the water and stir until the jam melts and coats the Brussels sprouts. Add the reserved pancetta and the pepper and stir to combine. Taste and add additional salt or pepper if needed. Serve warm.","Image":"//20fix.com/xfood/img/charred-brussels-sprouts-with-pancetta-and-fig-glaze-51226820.jpg"},{"id":"5045","Title":"Chocolate Torte with Calvados-Poached Figs","Ingredients":{"1":"1 cup (2 sticks) unsalted butter, room temperature, plus more for pan","2":"1 cup superfine sugar, divided, plus more for pan","3":"8 ounces bittersweet chocolate, chopped","4":"1 1/2 cups blanched hazelnuts","5":"1/2 cup all-purpose flour","6":"2 tablespoons unsweetened cocoa powder","7":"1 teaspoon kosher salt","8":"6 large eggs, separated","9":"1 teaspoon vanilla extract","10":"1/2 teaspoons cream of tartar","11":"2/3 cup Calvados (apple brandy)","12":"2/3 cup granulated sugar","13":"2 cups dried black Mission figs or pitted prunes (about 8 ounces), halved if large"},"Instructions":"Place a rack in middle of oven; preheat to 375°F. Butter a 9\"-diameter springform pan or cake pan and line with a round of parchment. Butter parchment and sprinkle pan with superfine sugar.\nMelt chocolate in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring, until smooth; let cool slightly.\nPulse hazelnuts, flour, cocoa powder, salt, and 1/2 cup superfine sugar in a food processor until finely ground; sift through a medium-mesh sieve. Pulse any larger pieces again in food processor, if needed.\nUsing an electric mixer on high speed, beat 1 cup butter and remaining 3/4 cup superfine sugar until light and fluffy, about 4 minutes. Add egg yolks, 1 at a time, beating to blend between additions. Beat in vanilla. Reduce speed to low; mix in melted chocolate. Gradually add dry ingredients, mixing just until combined.\nUsing clean beaters and with mixer on medium-high speed, beat egg whites and cream of tartar in a medium bowl until stiff peaks form.\nUsing a rubber spatula, fold 1/3 of whites into chocolate batter to loosen, then fold remaining whites into batter just until combined. Scrape batter into prepared pan.\nBake cake 20 minutes, then reduce oven temperature to 350°F and bake until a tester inserted into the center comes out clean, 30–40 minutes longer. Transfer pan to a wire rack; let cake cool 30 minutes before unmolding to cool completely.\nDO AHEAD: Cake can be baked 2 days ahead. Store tightly wrapped at room temperature.\nBring Calvados, granulated sugar, and 2/3 cup water to a boil in a small saucepan, stirring to dissolve sugar. Add figs, reduce heat to low, and simmer gently until figs are very soft, 20–25 minutes. Let cool.\nServe cake with figs and syrup.\nDO AHEAD: Figs can be poached 1 week ahead. Cover and chill.","Image":"//20fix.com/xfood/img/chocolate-torte-with-calvados-poached-figs-51205350.jpg"},{"id":"5080","Title":"Grilled Artisan Cheddar & Fig Jam Sandwich","Ingredients":{"1":"1 crusty rustic roll","2":"2 tablespoons top-quality fig jam, preferably Mitica (see Note)","3":"2 teaspoons fragrant extra-virgin olive oil","4":"Flaky sea salt","5":"3 ounces (85 g) artisan American Cheddar, preferably Prairie Breeze (see Note), cut into 3 thick slices"},"Instructions":"1. Heat a panini press according to the manufacturer's instructions. Alternatively, heat a ridged grill pan or large skillet over medium heat.\n2. Using a serrated knife, cut the roll in half horizontally. Spread each cut side of the roll with 1 tablespoon of the fig jam, drizzle the jam with 1 teaspoon of the oil, and season it with the salt. Arrange the Cheddar pieces closely on the bottom roll half, being sure that the cheese does not hang over the sides of the roll. Cover it with the remaining roll half, jam-side down.\n3. Place the sandwich in the panini press and cook it until the roll is toasted and golden brown and the cheese is desirably melty, about 4 minutes, depending on the press. If using a ridged grill pan or skillet, place the sandwich in the pan and top it with a cast-iron skillet or heavy saucepan. Cook until the underside is toasted, about 2 minutes. Flip the sandwich over, top it with the cast-iron skillet again, and cook until the other side is toasted and the cheese is melty, about 2 minutes more.\n4. Cut the sandwich in half and serve it hot.","Image":"//20fix.com/xfood/img/grilled-artisan-cheddar-fig-jam-sandwich-51201620.jpg"},{"id":"5094","Title":"Cornish Hen in Port Wine and Fig Preserves","Ingredients":{"1":"1 Cornish game hen","2":"Salt","3":"Freshly ground black pepper","4":"2 sprigs fresh rosemary","5":"1/4 cup fig preserves","6":"1/4 cup port wine"},"Instructions":"1. Coat the inside of a 3 1/2-quart slow cooker with cooking spray, if desired.\n2. Sprinkle the hen liberally with salt and pepper. Insert rosemary into cavity. Transfer hen to the slow cooker.\n3. Stir together the fig preserves and port wine in a small bowl and pour over hen.\n4. Cover and cook on High for 5 hours.\n5. Taste, and season again with salt and pepper. Serve sauce over hen.","Image":"//20fix.com/xfood/img/cornish-hen-in-port-wine-and-fig-preserves-51200420.jpg"},{"id":"5271","Title":"Cornmeal Crepes with Figs and Pears","Ingredients":{"1":"2 tablespoons unsalted, shelled raw pistachios","2":"1 large egg","3":"1/2 cup whole milk","4":"1/4 cup all-purpose flour","5":"1/4 cup cornmeal","6":"2 tablespoons sugar","7":"1/2 teaspoon vanilla extract","8":"1/8 teaspoon kosher salt","9":"1 1/4 cups heavy cream, divided","10":"Unsalted butter (for skillet)","11":"1 ripe pear, cored, thinly sliced","12":"4 fresh black Mission figs, quartered","13":"Honey (for drizzling)"},"Instructions":"Preheat oven to 350°F. Spread pistachios on a small rimmed baking sheet; toast, tossing occasionally, until fragrant, 6-8 minutes. Let cool, then coarsely chop; set aside.\nMeanwhile, whisk egg, milk, flour, cornmeal, sugar, vanilla, salt, and 1/4 cup cream in a medium bowl until smooth.\nHeat a 10\" nonstick skillet over medium heat. Lightly coat skillet with butter and add 3 tablespoons batter, swirling to cover the bottom of skillet. Cook, undisturbed, until edges turn golden and center begins to puff, about 2 minutes. Using a heatproof rubber spatula, loosen edges and then, using your fingers, flip crepe and cook until bottom is dry and set, about 30 seconds longer. Transfer to a plate. Repeat with remaining batter, coating skillet with butter between crepes.\nBeat remaining 1 cup cream to soft peaks. Serve crepes folded, topped with whipped cream, pears, figs, and pistachios and drizzled with honey.","Image":"//20fix.com/xfood/img/cornmeal-crepes-with-figs-and-pears-51187090.jpg"}],"t":86,"p":{"limitstart":0,"limit":25,"total":86,"pagesStart":1,"pagesStop":4,"pagesCurrent":1,"pagesTotal":4}}}