{"ingredient":"Meringue","recipes":{"s":1,"d":[{"id":"162","Title":"Icebox Lemon Pie With Meringue","Ingredients":{"1":"2½ cups graham cracker crumbs","2":"12 tablespoons (1½ sticks) unsalted butter, melted","3":"¼ cup sugar","4":"3 large eggs, separated","5":"Juice of 3 lemons","6":"1 (14-ounce) can sweetened condensed milk","7":"1 teaspoon cream of tartar","8":"3 tablespoons sugar"},"Instructions":"Preheat the oven to 300°F. In a medium bowl, combine the graham cracker crumbs, melted butter, and sugar until the crumbs are evenly moistened. Press the mixture into the bottom and sides of a 9-inch pie tin.\nCover and chill the egg whites. In a medium bowl, combine the egg yolks, lemon juice, and condensed milk. Mix well and pour over the graham cracker crust.\nBake until stiff, about 30 minutes. Let cool to room temperature, then chill for at least 3 hours or up to overnight.\nWhen ready to assemble the pie, preheat the oven to 350°F.\nIn the bowl of a stand mixer fitted with the whisk attachment, beat the egg whites and cream of tartar on high speed. With the mixer running, gradually add the sugar and beat until stiff peaks form.\nSpread the meringue over the pie filling.\nBake until the meringue is golden brown, about 12 minutes. Let cool for 30 minutes, then chill for 30 minutes before serving.","Image":"//20fix.com/xfood/img/icebox-lemon-pie-with-meringue.jpg"},{"id":"462","Title":"Lemon Meringue Pie","Ingredients":{"1":"1 Blind-Baked Pie Crust","2":"1 cup sugar","3":"⅓ cup cornstarch","4":"2 large eggs","5":"4 large egg yolks","6":"Zest of 4 lemons","7":"1 cup fresh lemon juice","8":"1 tsp. kosher salt","9":"3 Tbsp. chilled unsalted butter","10":"4 large egg whites","11":"¾ cup sugar","12":"½ tsp. kosher salt","13":"¼ tsp. cream of tartar"},"Instructions":"Whisk sugar and cornstarch in a large saucepan to combine. Add eggs and egg yolks and whisk vigorously, making sure to get into corners of pan, until smooth and pale. Whisk in lemon zest and juice, salt, and 1½ cups water.\nPlace saucepan over medium heat and bring to a simmer, whisking often and making sure to get into corners of pan, 8–10 minutes (mixture should be bubbling and thickened). Reduce heat and continue to simmer, whisking constantly, 3 minutes. Let cool 5 minutes, whisking every minute.\nAdd butter to filling and whisk until melted and fully incorporated. Scrape filling into pie crust; smooth surface. Chill until cold and set, at least 2 hours and up to 3 days.\nCombine egg whites, sugar, salt, and cream of tartar in the bowl of a stand mixer or another large heatproof bowl; set over a large saucepan filled with 1\" simmering water (bowl shouldn’t touch the water). Heat, stirring constantly, until sugar is dissolved and mixture is warm to the touch, about 4 minutes.\nFit bowl onto mixer fitted with whisk attachment (or use an electric mixer) and beat on medium-high speed until meringue is more than tripled in volume and medium peaks form, about 4 minutes. Transfer to a piping bag fitted with a large round tip (or a resealable plastic bag will work—just snip off a corner after bag is filled). Pipe meringue over filling and toast with a kitchen torch or under the broiler.\nDo Ahead: Pie (without meringue) can be made 2 days ahead. Keep chilled.","Image":"//20fix.com/xfood/img/lemon-meringue-pie.jpg"},{"id":"1456","Title":"Meringue Sundae with Peppery Berry Sauce","Ingredients":{"1":"1/2 cup frozen strawberries","2":"1/3 cup frozen raspberries","3":"3 Tbsp. dark brown sugar","4":"3 Tbsp. Chambord liqueur","5":"1/2 tsp. freshly ground black pepper","6":"Pinch of kosher salt","7":"6–8 small meringue cookies","8":"3 large scoops vanilla ice cream (from 1 pint)","9":"Extra-virgin olive oil, flaky sea salt, and basil leaves (for serving)"},"Instructions":"Cook strawberries, raspberries, brown sugar, liqueur, pepper, and kosher salt in a small pot over medium heat, stirring occasionally, until sauce is thickened, about 8 minutes. Let cool to room temperature.\nArrange cookies and ice cream scoops on a plate. Spoon berry sauce over, then top with oil, sea salt, and basil.\nDo Ahead: Sauce can be made 1 day ahead. Transfer to an airtight container and chill. Let come to room temperature before serving.","Image":"//20fix.com/xfood/img/meringue-sundae-with-peppery-berry-sauce.jpg"},{"id":"1545","Title":"Spiced Praline Meringues","Ingredients":{"1":"1/3 cup (50 g) blanched slivered almonds","2":"1 1/2 cups (300 g) granulated sugar","3":"2 tbsp water","4":"1/2 tsp ground cinnamon","5":"1/8 tsp ground cloves","6":"Finely grated zest of 1 large orange (1 tbsp)","7":"1/4 tsp flaky sea salt","8":"5 1/4 oz (150 g) egg whites (from 4 large eggs)"},"Instructions":"Preheat the oven to 375°F/190°C.\nSpread the almonds out on a small rimmed baking sheet and roast in the oven for 5–7 minutes, until lightly browned. Set aside to cool. Line two large rimmed baking sheets with parchment paper and set aside.\nPlace 1/4 cup/50 g of the sugar in a small saucepan with the water and stir to combine. Cook over high heat for about 4 minutes, until it has turned a light golden brown; do not stir, just gently shake the pan to help the sugar dissolve. Add the almonds and cook for 1 minute, so the nuts are coated and the caramel turns dark, without burning. Pour the mixture onto one of the lined baking sheets and set aside until cool.\nOnce cool, break the praline into smaller pieces, place in a food processor and process to form a rough powder. Remove from the machine, place in a shallow bowl and combine with the spices, orange zest and salt. Set aside.\nSpread the remaining sugar out on the second lined baking sheet and place in the oven for 7 minutes, until the sugar is hot. Remove from the oven and lower the temperature to 275°F/130°C. As soon as the sugar is out of the oven, place the egg whites in the bowl of an electric mixer with the whisk attachment in place and beat on high speed until they begin to froth up. Carefully add the hot sugar to the egg whites, 1 tbsp at a time, and continue beating for 7–8 minutes until the mixture is completely cold. At this point it should be silky and thick and keep its shape when you lift a little bit from the bowl.\n. Line two large baking sheets with parchment paper. Use an extra-large serving spoon to scoop up some meringue, and use another large spoon to help shape it into a rough ball the size of a large apple. Sprinkle some praline over half the meringue ball, then place on the baking sheet, repeat with the rest of the mixture, spacing the balls as far apart as possible, as they will increase in size.\nPlace the meringues in the oven for 2–2 1/2 hours. Check that they are done by lifting them from the baking sheet and gently tapping to make sure the outside is completely firm and the center is only a little soft. Remove from the oven and leave on the baking sheet to cool.\nThese will keep for up to 10 days. If you are not hanging them on the tree, wrap them loosely in aluminum foil and keep at room temperature.","Image":"//20fix.com/xfood/img/spiced-praline-meringues.jpg"},{"id":"2115","Title":"Giant Meringue (Pavlova Gigantata)","Ingredients":{"1":"2 cups strawberries, quartered","2":"3 tablespoons mezcal","3":"Zest and juice of 1 lime","4":"3 tablespoons pure cane sugar","5":"Pinch of sea salt","6":"1 cup dried shaved coconut","7":"1 cup pure cane sugar","8":"1/4 cup packed light brown sugar","9":"1/4 cup potato starch","10":"4 large egg whites, at room temperature","11":"Pinch of sea salt","12":"2 tablespoons cold water","13":"2 tablespoons fresh lemon juice","14":"1 cup ice-cold heavy cream","15":"1 tablespoon powdered sugar"},"Instructions":"To make the mezcal berries, in a medium glass bowl, combine the berries, mezcal, lime zest, lime juice, pure cane sugar, and salt. Let the berries rest at room temperature for 2 hours.\nPreheat the oven to 350°F. Line a baking sheet with parchment paper. While the oven is preheating, spread the coconut shavings on the baking sheet and toast until golden, about 5 minutes. Transfer the coconut to a bowl, but keep the lined baking sheet for the Pavlova.\nTo make the Pavlova, in a food processor, pulse the sugars and potato starch until uniformly combined and substantially more fine. Sift the sugar-starch mixture and set aside.\nIn a large bowl with an electric mixer or in a stand mixer, whip the egg whites with the salt to stiff peaks, add the water and whip 1 minute. Add the sugar mixture little by little—a tablespoon at a time—while continuing to whip the meringue. When you’ve added half the sugar mixture, add the lemon juice. Keep whipping and adding the sugar mixture. When all the sugar is incorporated, whip another 2 or 3 minutes, until you have stiff, glossy peaks.\nTaking care not to deflate the meringue, form one giant mass of meringue in the center of the parchment-lined baking sheet. Using a spatula, gently work the meringue closer to the sides of the baking sheet into whatever amorphous shape suits your fancy. After all, perfect circles are for squares, man. As you work, be sure to pull straight up with the end of the spatula to create interesting shapes and curls of meringue.\nWhen you are finished with your edible art project, reduce the oven temperature to 300°F and place the masterpiece in the oven. Bake for 30 minutes, then reduce the oven temperature to 250°F (keep the oven door shut!) and bake another 20 minutes. Turn the oven off and let the meringue rest another 10 minutes, then open the oven door and let the Pavlova cool for another hour or so.\nTo make the whipped cream, using an electric mixer (or a whisk and some elbow grease), whip the heavy cream with the powdered sugar until light and fluffy.\nTo serve, carefully peel the parchment away from the Pavlova (or better yet, serve on the paper to aid in clean up) and garnish as you see fit with heaping spoonfuls of whipped cream, the berries, and the toasted coconut. This is a grab-and-grub scenario, so don’t even bother slicing it—just provide plenty of napkins and scold people who don’t wash their hands before digging in!","Image":"//20fix.com/xfood/img/giant-meringue-pavlova-gigantata.jpg"},{"id":"2547","Title":"Pumpkin and Cookie-Butter Sheet Cake with Toasted Meringue","Ingredients":{"1":"1 cup (2 sticks) unsalted butter, room temperature, plus more for pan","2":"3 cups all-purpose flour, plus more for pan","3":"1 tablespoon baking powder","4":"1 1/2 teaspoons ground cinnamon","5":"1 teaspoon freshly grated nutmeg","6":"1 teaspoon ground ginger","7":"1 teaspoon kosher salt","8":"1/2 teaspoon baking soda","9":"1 1/3 cups canned pumpkin purée","10":"1 cup sour cream","11":"3/4 cup speculoos cookie butter (preferably Biscoff)","12":"2 teaspoons vanilla extract","13":"2 cups (packed) light brown sugar","14":"4 large eggs","15":"4 large egg whites","16":"1 cup granulated sugar","17":"1 teaspoon vanilla extract","18":"1/2 teaspoon freshly grated nutmeg","19":"1/2 teaspoon ground cinnamon","20":"1/2 teaspoon kosher salt","21":"2 tablespoons pepitas (pumpkin seeds)","22":"A 13x9\" baking pan, preferably light metal"},"Instructions":"Preheat oven to 350°F. Butter baking pan, line with parchment paper, then butter parchment. Dust pan with flour, tapping out excess.\nWhisk baking powder, cinnamon, nutmeg, ginger, salt, baking soda, and 3 cups flour in a large bowl. Whisk pumpkin, sour cream, cookie butter, and vanilla in a medium bowl. Using an electric mixer on medium-high speed, beat brown sugar and 1 cup butter in another large bowl until lightened in color and fluffy, about 3 minutes. Add eggs one at a time, beating on medium speed after each addition, until combined. Add dry ingredients in 3 additions, alternating with pumpkin mixture in 2 additions, beginning and ending with dry ingredients. Scrape batter into prepared pan; smooth surface.\nBake cake until golden brown and a tester inserted into the center comes out clean, 50–60 minutes. Transfer pan to a wire rack and let cool, about 2 hours.\nPour enough water into a small saucepan to come 1\" up sides; bring to a simmer. Whisk egg whites, granulated sugar, vanilla, nutmeg, cinnamon, and salt in a large bowl. Place bowl over simmering water, making sure bottom of bowl does not touch water, and cook, stirring constantly, until whites are hot to the touch and sugar is dissolved, 1–2 minutes. Remove bowl from water. Using electric mixer on high speed, beat egg white mixture until cooled, fluffy, and holds stiff peaks, about 5 minutes.\nSpread meringue evenly over cake, creating peaks and valleys with a spatula. Sprinkle pepitas over meringue. If desired, heat with a kitchen torch or broiler, watching carefully and checking every minute, to lightly brown top, about 5 minutes total. Slice into pieces and serve.\nCake, without meringue, can be made 1 day ahead; cover and store at room temperature.","Image":"//20fix.com/xfood/img/pumpkin-and-cookie-butter-sheet-cake-with-toasted-meringue.jpg"},{"id":"2861","Title":"Pineapple Macadamia Nut Meringue Pies","Ingredients":{"1":"3/4 cup salted macadamia nuts (about 3 ounces)","2":"1 cup all-purpose flour","3":"2 tablespoons sugar","4":"1/4 teaspoon salt","5":"1/2 stick (1/4 cup) cold unsalted butter, cut into 1/2-inch cubes","6":"1 large egg, lightly beaten","7":"3 tablespoons unsalted butter","8":"2 1/4 cups diced (1/4 inch) cored peeled fresh pineapple (labeled \"extra sweet\")","9":"1/4 cup packed light brown sugar","10":"1 tablespoon fresh lemon juice","11":"2 large egg whites","12":"1/8 teaspoon cream of tartar","13":"1/4 cup sugar","14":"12 (2- to 2 1/2-inch) metal pie plates or a mini-muffin pan with 12 (1/8-cup) cups; an offset metal spatula"},"Instructions":"Put oven rack in middle position and preheat oven to 375°F. Toast nuts in 1 layer in a shallow baking pan in oven, stirring once or twice, until golden, about 5 minutes. Cool completely in pan on a rack. Coarsely chop 1/4 cup nuts and set aside.\nPulse flour, sugar, salt, and remaining 1/2 cup nuts in a food processor until nuts are finely chopped, then add butter and pulse until mixture resembles coarse meal. Add egg and process until dough begins to come together into a ball but is still crumbly. Form dough into a ball with your hands. Press about 1 tablespoon dough evenly over bottom and up side of each pie plate. Chill shells until firm, about 30 minutes.\nLightly prick bottoms and sides of chilled pie shells all over with a fork.\nBake until edges are golden and bottoms are pale golden, 12 to 15 minutes.\nCool completely in pans on racks. Loosen edges of shells carefully with offset spatula, then carefully remove shells from pans and transfer to a shallow baking pan. Sprinkle chopped nuts into bottoms of shells. Leave oven on.\nSimmer butter, pineapple, brown sugar, and lemon juice in a 12-inch heavy skillet over moderate heat, stirring occasionally, until most of liquid is evaporated and pineapple is slightly translucent, about 10 minutes.\nCool slightly, then spoon a heaping tablespoon of filling into each shell.\nBeat whites with cream of tartar in a large bowl with an electric mixer at high speed until they just hold soft peaks. Gradually beat in sugar and beat until meringue holds stiff, glossy peaks. Spoon about 2 tablespoons meringue over filling of each pie, covering filling completely and sealing meringue to pastry.\nDraw meringue up into small peaks and bake until tops are golden in spots, about 5 minutes.\nCool pies on racks, about 30 minutes. Serve warm or at room temperature.","Image":"//20fix.com/xfood/img/pineapple-macadamia-nut-meringue-pies-235040.jpg"},{"id":"3967","Title":"Flourless Pistachio Cake with Strawberry Meringue","Ingredients":{"1":"Vegetable oil, for cake pan","2":"1 1/2 cups shelled unsalted pistachios (8 ounces)","3":"3/4 cup sugar, divided","4":"6 large eggs, at room temperature","5":"1 teaspoon vanilla extract","6":"1/2 teaspoon kosher salt, plus more for egg whites","7":"1/4 teaspoon ground cardamom","8":"1 1/3 cups freeze-dried strawberries (1.2-ounce package)","9":"5 egg whites, at room temperature","10":"1/2 teaspoon white vinegar","11":"1 cup almond flour (4 ounces)","12":"1 cup superfine sugar","13":"1 tablespoon potato starch","14":"9-inch springform pan"},"Instructions":"Preheat oven to 325°F. Lightly brush a 9-inch springform pan with oil and line bottom with a round of parchment paper. Brush parchment with oil and set pan aside.\nIn a food processor, pulse pistachios with 1/4 cup sugar until finely ground (avoid overgrinding); set aside.\nIn two large bowls, separate the 6 eggs into yolks and whites, reserving the sixth egg white for another use. Add 1/4 cup sugar, vanilla, salt, and cardamom to bowl with egg yolks and beat using an electric mixer until thick and pale yellow, about 2 minutes. Set egg yolk mixture aside and thoroughly clean and dry the beaters.\nAdd a pinch of salt to the bowl with the egg whites and beat using an electric mixer until soft peaks form. Gradually beat in remaining 1/4 cup sugar, and continue beating until stiff peaks form.\nAdd half of the whipped egg whites and all of the ground pistachios to the egg yolk mixture and fold until combined. Add the remaining egg whites and fold until batter is just combined. Pour batter into prepared pan and smooth top with a rubber spatula. Bake until beginning to brown and just barely set, 20–25 minutes.\nIn a food processor, process the strawberries into a fine powder. Set aside 1 Tbsp. of the powder for decorating the cake, and pour the remaining powder into a medium bowl. Whisk in the almond flour and the potato starch.\nIn a large bowl using an electric mixer, beat 5 egg whites and vinegar until soft peaks form, then gradually beat in the sugar and continue to whip until meringue is stiff and glossy and all the sugar has dissolved, 7–8 minutes. Gently fold almond mixture into meringue until just combined.\nRemove cake from oven. Using an offset spatula or table knife, spread meringue mixture evenly over hot cake, starting from the outside and working your way into the center. Return cake to oven and bake until meringue is lightly browned and crisp, 25–30 minutes. Transfer pan to a wire rack to cool, and immediately run a knife around the edge of the cake to loosen it from the pan. Release and remove the side of the springform pan. Let cake cool at least 30 minutes before decorating.\nPlace the reserved strawberry powder in a fine-mesh sieve and dust over cake as desired.\nCake can be made up to one day before serving: cool to room temperature, loosely cover with plastic wrap, and store at room temperature.","Image":"//20fix.com/xfood/img/flourless-pistachio-cake-with-strawberry-meringue-56389337.jpg"},{"id":"4139","Title":"Hazelnut Butter and Coffee Meringues","Ingredients":{"1":"1 cup skin-on hazelnuts","2":"1/4 teaspoon kosher salt","3":"4 large egg whites","4":"Pinch of cream of tartar","5":"1/2 cup granulated sugar","6":"3/4 cup powdered sugar","7":"2 tablespoons coffee beans, chopped"},"Instructions":"Preheat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing once, until golden brown, 10–12 minutes. Remove nuts and reduce oven temperature to 200°. Bundle nuts in a kitchen towel and rub vigorously to remove skins. Spread out and let cool.\nBlend hazelnuts and salt in a food processor until a smooth, creamy nut butter forms (it should be pretty fluid; keep processing if still stiff); set aside.\nUsing an electric mixer on high speed, beat egg whites and cream of tartar until frothy, about 1 minute. With motor running, gradually add granulated sugar and beat until medium peaks form, about 5 minutes. Gradually add powdered sugar and continue to beat until stiff, glossy peaks form, 8–10 minutes.\nTransfer meringue to a large bowl and gently fold in half of reserved hazelnut butter, leaving plenty of streaks. Add remaining hazelnut butter and fold once just to barely blend. Mixture should be marbled with thick ribbons of nut butter.\nSpoon heaping spoonfuls of meringue onto parchment-lined baking sheets (meringues will flatten slightly as they bake, so make them tall) and top with coffee beans. Bake until dry, 2–2 1/2 hours. Turn off heat and let cool in oven.\nDo ahead: Meringues can be made 2 days ahead. Store airtight at room temperature.","Image":"//20fix.com/xfood/img/#NAME?.jpg"},{"id":"4303","Title":"Meringue Roulade with Rose Petals and Fresh Raspberries","Ingredients":{"1":"4 large egg whites","2":"1 1/4 cups/250 g superfine sugar","3":"1 teaspoon vanilla extract","4":"1 teaspoon white wine vinegar","5":"1 teaspoon cornstarch","6":"3 1/2 ounces/100 g mascarpone', \"1 tablespoon confectioners' sugar\", '1 1/2 tablespoons rose water","7":"1 3/4 cups/400 ml heavy cream","8":"1 1/4 cups/150 g fresh raspberries","9":"2 tablespoons dried rose petals","10":"1 teaspoon slivered pistachios (or regular, if unavailable, crushed)', \"Confectioner's sugar, for dusting\"]"},"Instructions":"Preheat the oven to 325°F/160°C.\nLine the base and sides of a 13 by 9-inch/33 by 23-cm jelly roll pan with parchment paper. Allow the paper to rise about 3/8 inch/1 cm above the sides of the pan. To make the meringue, in a large bowl, beat the egg whites with an electric mixer until they begin to firm up. Add the superfine sugar to the whites in spoonfuls or tip into the bowl in a slow stream. Continue beating until a firm, glossy meringue forms. Using a large metal spoon, gently fold in the vanilla, vinegar, and cornstarch. Spread the mixture inside the prepared pan and level with an offset spatula.\nTo make the meringue, in a large bowl, beat the egg whites with an electric mixer until they begin to firm up. Add the superfine sugar to the whites in spoonfuls or tip into the bowl in a slow stream. Continue beating until a firm, glossy meringue forms. Using a large metal spoon, gently fold in the vanilla, vinegar, and cornstarch. Spread the mixture inside the prepared pan and level with an offset spatula.\nBake for 30 minutes, until a crust forms and the meringue is cooked through (it will still feel soft to the touch). Remove from the oven and allow to cool in the pan.\nUnmold the cooled meringue onto a fresh piece of parchment paper. Carefully peel off the lining paper.\nMeanwhile, make the cream. Place the mascarpone, confectioners' sugar, and rose water in a large bowl and whisk by hand until smooth. Add the cream and whisk for about 4 minutes, until the cream just holds its shape. (You can do this in an electric mixer but keep a close eye on it as it's easy to overmix.)\nSpread most of the mascarpone cream over the original underside of the meringue, reserving a few tablespoons. Leave a small border around the edge of the meringue. Scatter most of the raspberries and 1 1/2 tablespoons of rose petals evenly over the cream.\nUsing the paper to assist you and starting from a long edge, roll up the meringue into a perfect log shape. Carefully transfer the log onto a serving dish. Use the remaining cream to create a rough wavy strip along the top of the log (see photo). Chill for at least 30 minutes.\nWhen ready to serve, dust the log with confectioners' sugar, dot with the remaining raspberries, and scatter the remaining rose petals and pistachios evenly over the top.","Image":"//20fix.com/xfood/img/meringue-roulade-with-rose-petals-and-fresh-raspberries-51254480.jpg"},{"id":"4310","Title":"Pineapple Coconut Meringue Torte","Ingredients":{"1":"Batter for Crunchy Meringue Cookies","2":"1/2 fresh pineapple, peeled and cored","3":"Olive oil, for searing","4":"Coarse salt, for sprinkling","5":"1/2 cup heavy cream (120 grams)', \"2 tablespoons confectioners' sugar (16 grams)\", 'Pina Colada Pastry Cream","6":"1/2 cup unsweetened flaked coconut, lightly toasted (36 grams)","7":"a piping bag with a 1/2-inch plain tip"},"Instructions":"Preheat the oven to 200°F. Line 2 baking sheets with parchment paper.\nPrepare the meringue cookie batter as directed. Using a piping bag with a 1/2-inch plain tip, or using a spoon, form the meringue into three 8-inch disks on the lined baking sheets, each about 1/2 inch thick.\nBake for about 45 minutes, until crisp on the outside but still moist in the center. Cool completely in the oven.\nHalve the pineapple lengthwise and cut the pieces crosswise into 1/4-inch-thick slices. Heat a very thin layer of oil in large nonstick skillet or griddle over medium-high heat and add the pineapple. Cook for 4 to 5 minutes, until seared and golden, then flip the pieces and sear the other side. Transfer the pieces to a plate and sprinkle them lightly with salt; cool to room temperature.\nWhip the cream until soft peaks form; sift the confectioners' sugar over it and whip until combined and the cream forms medium-firm peaks. Put the pastry cream in a large bowl and whisk to loosen it.\nAdd about a third of the whipped cream and whisk it into the pastry cream to lighten it. Using a large spatula, add the remaining whipped cream and fold it into the pastry cream until just combined. Reserve about 1/2 cup of the cream and transfer the remainder to a piping bag fitted with a 1/2-inch plain tip.\nPut one meringue disk onto a serving plate and pipe a spiral of pastry cream (using a little less than half of it) over it, covering it completely but leaving a 1/2-inch border around the edge. Blot the pineapple pieces with a paper towel and arrange half of them, fanning them in a concentric circle, over the pastry cream. Put another meringue disk on top and repeat with the remaining pastry cream and pineapple. Top with the remaining meringue disk and, using a small off set spatula, spread the reserved pastry cream in a thin even layer over the top. Sprinkle the coconut evenly over the top.\nThe torte can be sliced immediately and served but is better if refrigerated for at least 1 hour and no longer than 3 hours to soften the meringue.","Image":"//20fix.com/xfood/img/pineapple-coconut-meringue-torte-51254230.jpg"},{"id":"4655","Title":"Banana Meringue Pudding","Ingredients":{"1":"4 large eggs","2":"2/3 cup sugar","3":"1/4 cup cornstarch","4":"4 cups whole milk","5":"2 tablespoons unsalted butter","6":"2 teaspoons vanilla extract","7":"Pinch of kosher salt","8":"1 11-ounce box vanilla wafer cookies","9":"3 ripe bananas, thinly sliced","10":"4 large egg whites","11":"1/2 cup sugar"},"Instructions":"Lightly whisk eggs in a large bowl just to blend. Whisk sugar and cornstarch in a medium saucepan. Gradually whisk milk into sugar mixture and heat over medium heat, whisking often, until very warm to the touch. Gradually whisk half of hot milk mixture into eggs, then whisk egg mixture back into milk mixture in saucepan.\nCook, whisking constantly, until thickened and whisk leaves a trail in pudding (it should be the consistency of mayonnaise), about 4 minutes. Remove from heat, add butter, vanilla, and salt and whisk until butter is melted and mixture is smooth.\nStrain pudding through a fine-mesh sieve into another large bowl. Cover pudding with plastic wrap, pressing directly onto the surface. Chill until cool, about 2 hours.\nSpread one-third of pudding evenly in a 2-qt. baking dish. Top with half of cookies and half of bananas. Repeat layers one more time and top with remaining third of pudding. Cover and chill at least 4 hours.\nJust before serving, heat broiler. Using an electric mixer on medium speed, beat egg whites until foamy. With motor running, gradually add sugar. Increase speed to medium-high and beat until stiff peaks form.\nSpoon meringue over pudding and swirl decoratively. Broil until meringue is dark brown in spots, about 1 minute.\nDo ahead: Pudding (without meringue) can be assembled 2 days ahead. Keep chilled","Image":"//20fix.com/xfood/img/banana-meringue-pudding-51235890.jpg"},{"id":"4987","Title":"Chocolate Meringues and Strawberries","Ingredients":{"1":"1 bag (16 ounce) frozen strawberries, thawed, halved","2":"3/4 cup plus 2 tablespoons granulated sugar, divided","3":"1 teaspoon balsamic vinegar","4":"3 egg whites, at room temperature","5":"1/4 teaspoon cream of tartar","6":"5 teaspoons cocoa powder, sifted","7":"3/4 cup heavy cream', \"2 tablespoons confectioner's sugar\", '2 ounces dark chocolate (60%¿70% cacao), shaved"},"Instructions":"Heat oven to 325°. In a bowl, combine strawberries, 2 tablespoons granulated sugar and vinegar. Using an electric mixer, beat egg whites until peaks form. Add cream of tartar and a pinch of salt; beat to combine. Slowly add remaining 3/4 cup granulated sugar, beating until stiff peaks form. Sprinkle cocoa over egg mixture; whip until just combined. Spread into 6 mounds, 3 inches each, on a parchment paper–lined baking sheet. Make an indentation in the middle of each meringue so sides are 1/2-inch thick. Place in oven, reduce temperature to 300° and bake until meringues are dry on outside and soft in center, 50 minutes. Cool on sheets. Using an electric mixer, whip cream and confectioner's sugar. Top meringues evenly with berry mixture, whipped cream and chocolate.","Image":"//20fix.com/xfood/img/chocolate-meringues-and-strawberries-51208030.jpg"},{"id":"6085","Title":"Berry, Coconut and Meringue Pie","Ingredients":{"1":"1 All-Purpose Crust, Coconut Variation","2":"4 cups (2 pints) wild blueberries, thawed if frozen","3":"1/2 cup packed dark brown sugar","4":"3 tablespoons cornstarch","5":"1/2 teaspoon finely grated lime zest","6":"2 tablespoons fresh lime juice","7":"1/4 teaspoons salt","8":"2 teaspoons unsalted butter","9":"4 large egg whites","10":"1/4 teaspoon cream of tartar","11":"6 tablespoons granulated sugar","12":"2 tablespoons sweetened coconut flakes"},"Instructions":"Heat oven to 350°F. In a bowl, toss blueberries with brown sugar, cornstarch, zest, juice and salt; add to pie pan with crust; dot with butter. Place pie on a baking sheet. Bake on lowest rack until crust is golden, 30 minutes. Ten minutes before pie is done, make meringue: In a mixer, whisk egg whites and cream of tartar until very foamy. Gradually beat in granulated sugar until firm peaks form, 8 minutes. Remove pie from oven; spread meringue on top of hot pie; sprinkle with coconut. Return to oven; bake until meringue is browned, 15 minutes.","Image":"//20fix.com/xfood/img/berry-coconut-and-meringue-pie-51109000.jpg"},{"id":"6301","Title":"Lemon Pudding with Strawberries and Meringue Cigars","Ingredients":{"1":"4 large egg whites","2":"1/4 teaspoon salt","3":"1 cup sugar","4":"3 tablespoons unsalted pistachios (preferably not roasted), finely chopped","5":"2 teaspoons finely grated fresh lemon zest","6":"1/2 cup strained fresh lemon juice","7":"1/2 cup sugar","8":"3 large eggs","9":"3/4 stick (6 tablespoons) unsalted butter, cut into pieces","10":"1 cup heavy cream', \"1/2 cup confectioners' sugar\", '1 pound strawberries, trimmed and halved, or quartered if large","11":"2 large baking sheets; parchment paper; a stand mixer or a powerful handheld electric mixer; a pastry bag fitted with a plain, round 1/2-inch tip (we used Wilton 1A)"},"Instructions":"Heat oven to 200°F with racks in upper and lower thirds. Line baking sheets with parchment paper. Use a pencil to mark parchment with parallel lines 5 inches apart; these lines will be your guides when piping. Turn paper over.\nBeat whites with salt in stand mixer at high speed (or in a large bowl with handheld mixer) until they just hold soft peaks. Gradually add sugar, beating, and continue to beat at high speed until meringue holds stiff, glossy peaks. Secure paper to baking sheets with dabs of meringue.\nSpoon some meringue into pastry bag and pipe 5-inch-long cigars (3/4 to 1 inch wide) onto 1 baking sheet, about 1 inch apart. Add more meringue to pastry bag and pipe more cigars in same manner on other baking sheet.\nSprinkle cigars generously with pistachios.\nBake cigars in oven, switching position of sheets halfway through baking, until crisp but still white, about 2 hours.\nTurn off oven and cool meringue cigars in oven 1 hour, then transfer to wire racks to cool completely.\nSet a large fine-mesh sieve over a large bowl.\nWhisk together zest, juice, sugar, and eggs in a 2-quart heavy saucepan. Add butter and cook over moderately low heat, whisking frequently, until butter melts, curd is thick enough to hold marks of whisk, and first bubble appears on surface, 6 to 9 minutes.\nImmediately force lemon curd through sieve into bowl and chill curd, its surface covered with a round of wax paper, until cold, at least 1 hour.\nBeat cream and confectioners' sugar in another bowl with cleaned beaters until mixture just holds soft peaks. Fold one third of whipped cream into lemon curd to lighten, then fold in remaining cream. Divide among individual bowls and chill, covered, if not using right away.\nTop with strawberries and serve with meringue cigars.","Image":"//20fix.com/xfood/img/lemon-pudding-with-strawberries-and-meringue-cigars-395394.jpg"},{"id":"6358","Title":"Coupe Glacée Meringue","Ingredients":{"1":"2 large egg whites","2":"2/3 cup sugar","3":"1 vanilla bean, split lengthwise","4":"1 tablespoon honey","5":"2 cups mixed fresh berries (such as raspberries, blackberries, strawberries, blueberries)","6":"2 tablespoons honey","7":"2 teaspoons fresh lemon juice","8":"Vanilla ice cream","9":"Fresh mint leaves"},"Instructions":"Preheat oven to 200°F. Line a baking sheet with parchment paper. Using an electric mixer, beat egg whites on medium-high speed in a medium bowl until white and foamy. With mixer running, gradually add sugar by tablespoonfuls, beating until meringue is stiff and glossy. Scrape in seeds from vanilla bean. Add honey and continue to beat until seeds are evenly dispersed and no streaks of honey remain. Drop meringue by heaping tablespoonfuls onto prepared baking sheet.\nBake until dry and slightly golden, about 2 hours. Let meringues cool on sheet (they will crisp as they cool).\nCombine berries, honey, and lemon juice in a medium bowl. Toss to combine. Let stand at room temperature for at least 1 hour to allow juices to form.\nCoarsely crumble meringues. Divide berries and juices among small bowls. Scoop vanilla ice cream into each bowl. Top with crumbled meringues. Garnish with mint.","Image":"//20fix.com/xfood/img/coupe-glacee-meringue-395053.jpg"},{"id":"6371","Title":"Key Lime Meringue Cake","Ingredients":{"1":"2 3/4 cups sifted cake flour (not self-rising; sift before measuring) plus more for pans","2":"2 1/2 teaspoons baking powder","3":"1/2 teaspoon salt","4":"2 sticks (1 cup) unsalted butter, softened, plus more for pans","5":"1 1/2 cups sugar","6":"4 large eggs, warmed in shell in a bowl of warm water 5 minutes","7":"1 tablespoon grated Key lime or lime zest","8":"1 1/2 teaspoons pure vanilla extract","9":"1 cup whole milk","10":"3/4 cup sugar","11":"1/4 cup cornstarch","12":"Pinch of salt","13":"3/4 cup water","14":"3/4 cup fresh Key lime or lime juice","15":"2 large eggs","16":"3 tablespoons unsalted butter, cut into tablespoons","17":"2 teaspoons grated Key lime or lime zest","18":"2 large egg whites', \"3/4 cup confectioners' sugar\", '2/3 cup light corn syrup","19":"2 tablespoons water","20":"1 teaspoon pure vanilla extract","21":"1 teaspoon fresh Key lime or lime juice","22":"1/8 teaspoon salt","23":"2 (9- by 2-inch) round cake pans; a powerful handheld electric mixer or a stand mixer"},"Instructions":"Heat oven to 350°F. with rack in middle. Butter cake pans, then line bottoms with rounds of parchment. Dust pans with additional flour, knocking out excess.\nSift flour, baking powder, and salt together into a bowl.\nBeat together butter and sugar in a large bowl with an electric mixer (or a stand mixer fitted with the paddle attachment) at medium-high speed until pale and fluffy, about 3 minutes. Beat in eggs one at a time, beating well after each addition. Beat in zest and vanilla and continue beating until light and fluffy, 3 to 5 minutes more. At low speed, add flour mixture in 3 batches alternately with milk, beginning and ending with the flour mixture and mixing until batter is just smooth.\nDivide batter between cake pans, spreading it evenly. Bake until a wooden toothpick inserted in the center of each cake comes out clean and cakes begin to pull away from sides of pans, 20 to 25 minutes.\nCool for 15 minutes in pans on racks. Run a thin knife around sides of pans, invert cake layers onto racks, and cool completely.\nWhisk together sugar, cornstarch, and salt in a heavy 2-quart saucepan, then whisk in 3/4 cup water and juice until smooth. Whisk together eggs in a medium heat-proof bowl until well combined.\nBring juice mixture to a boil over medium heat, stirring with whisk, then reduce heat and continue to cook at a slow boil, stirring with whisk, 1 minute (mixture will be thick). Remove pan from heat.\nAdd half of hot juice mixture to eggs in a slow stream, stirring with whisk. Stir egg mixture into juice in pan and cook over medium-low heat, stirring, just until it reaches a simmer. Remove pan from heat and add butter and zest, stirring until butter is melted.\nCover filling with a buttered round of wax paper or parchment paper and chill until cold, about 1 hour.\nCombine frosting ingredients in a large bowl with electric mixer (or stand mixer fitted with the whip attachment). Beat at high speed until frosting is thick and fluffy, 3 to 5 minutes.\nHalve each cake horizontally with a long serrated knife. Put 1 layer on a cake stand or a large plate and spread with one-third of filling (about 2/3 cup).\nStack remaining cake layers using half of remaining filling between each layer.\nSpread top and side of cake generously with frosting.","Image":"//20fix.com/xfood/img/key-lime-meringue-cake-394969.jpg"},{"id":"6636","Title":"Peppermint Meringues","Ingredients":{"1":"3 large egg whites, room temperature","2":"1/8 teaspoon kosher salt","3":"1/3 cup sugar","4":"1/2 cup powdered sugar","5":"1/8 teaspoon peppermint extract","6":"12 drops red food coloring"},"Instructions":"Preheat oven to 200°F. Line a baking sheet with parchment paper. Using an electric mixer, beat egg whites and salt on medium-high speed until white and foamy, about 1 minute. With mixer running, gradually add sugar in 3 additions, beating for 2 minutes between each addition. Beat until firm peaks form, about 2 minutes longer. Add powdered sugar and peppermint extract; beat to blend, about 1 minute.\nDot coloring over surface of meringue; do not stir (the coloring will form swirls when piped). Spoon meringue into a pastry bag fitted with a 1/2\" tip. (alternatively, spoon into a plastic freezer bag, then cut 1/2\" off 1 corner.) Twist top; pipe 1\" rounds onto prepared sheet, spacing 1\" apart.\nBake meringues until dry, about 2 1/2 hours. Let cool completely, about 1 hour (meringues will crisp as they cool). DO AHEAD: Can be made 2 days ahead. Store airtight at room temperature between sheets of parchment or waxed paper.","Image":"//20fix.com/xfood/img/peppermint-meringues-368976.jpg"},{"id":"6792","Title":"Ginger-Yogurt Mousse with Pistachio Meringue","Ingredients":{"1":"2 large egg whites, room temperature","2":"1/8 teaspoon cream of tartar","3":"1/2 teaspoon vanilla extract","4":"2 teaspoons cornstarch","5":"1/2 cup sugar","6":"1/4 cup chopped natural pistachios","7":"1/3 cup sugar","8":"1 2\" piece peeled ginger, cut into 1/4\" slices","9":"1 vanilla bean, split lengthwise","10":"1 cup low-fat plain yogurt","11":"1 cup heavy cream","12":"1 tablespoon chopped natural pistachios"},"Instructions":"Position a rack in center of oven; preheat to 250°F. Line a baking sheet with parchment paper. Using an electric mixer, beat egg whites and cream of tartar in a large bowl until soft peaks form. Beat in vanilla. Gradually beat in cornstarch, then sugar, 1 tablespoon at a time; continue to beat until stiff peaks form. Fold in pistachios. Spread meringue on parchment paper in a 1/3\" layer (meringue will not completely cover parchment). Bake meringue until crisp, about 55 minutes. Let cool, then break into small pieces. DO AHEAD: Can be made 1 day ahead. Store airtight.\nCombine sugar, ginger, and 1/4 cup water in a small saucepan. Scrape in seeds from vanilla bean; add bean. Bring to a boil over medium heat, stirring until sugar dissolves. Remove saucepan from heat and let infuse for 30 minutes. Discard bean. Cover and chill ginger syrup.\nIn a small bowl, whisk together yogurt, cream, and ginger syrup just to blend. Place mixture in a whipped-cream canister. DO AHEAD: Can be made 4 hours ahead. Chill. Dispense into bowls according to manufacturer's instructions. (Alternatively, double ingredients and whip chilled cream until stiff peaks form, then whip in yogurt and syrup. Spoon the mixture into bowls.) Top with crumbled pistachio meringue. Garnish with pistachios.","Image":"//20fix.com/xfood/img/ginger-yogurt-mousse-with-pistachio-meringue-367714.jpg"},{"id":"7176","Title":"Lemon Meringue Pie with Graham Crust","Ingredients":["[\"1 cup whole wheat graham flour (such as Bob's Red Mill whole grain stone-ground graham flour)\", '1/2 cup unbleached all purpose flour","1/4 cup sugar","1/2 teaspoon finely grated lemon peel","10 tablespoons (1 1/4 sticks) unsalted butter, melted, cooled slightly","1 cup sugar","4 teaspoons cornstarch","2/3 cup fresh lemon juice","4 large eggs","1 tablespoon finely grated lemon peel","6 large egg whites, room temperature","1/4 teaspoon cream of tartar","1/4 teaspoon coarse kosher salt","1 cup sugar","Blackberry sauce","Ingredient info: Whole wheat graham flour can be found at some supermarkets and at natural foods stores."],"Instructions":"Preheat oven to 375°. Butter bottom and sides of 9-inch-diameter glass pie plate. Stir first 4 ingredients in medium bowl to blend. Gradually add butter, stirring until moist clumps form. Press dough evenly onto bottom and up sides of prepared pie plate. Bake crust until golden brown and firm to touch, about 20 minutes. Maintain oven temperature.\nMeanwhile, whisk sugar and cornstarch in heavy medium saucepan until no lumps remain. Gradually whisk in lemon juice. Add eggs 1 at a time, whisking to blend well after each addition. Stir in finely grated lemon peel. Whisk mixture constantly over medium heat until filling thickens and boils. Remove from heat; whisk to smooth if necessary. Transfer filling to prepared crust. Smooth top.\nUsing electric mixer, beat egg whites, cream of tartar, and coarse salt in large bowl until frothy. With mixer running, gradually beat in sugar. Continue beating until stiff and glossy.\nSpread meringue over warm filling, sealing meringue to crust at edges. Using spatula, form peaks and swirls in meringue. Bake pie until meringue is golden brown, about 15 minutes. Cool pie completely on rack.\nCut pie into wedges and serve with blackberry sauce.","Image":"//20fix.com/xfood/img/lemon-meringue-pie-with-graham-crust-364673.jpg"},{"id":"7177","Title":"Pecan-Mocha Meringues","Ingredients":{"1":"1/3 cup (packed) golden brown sugar","2":"1 tablespoon unsweetened cocoa powder","3":"1/3 cup egg whites (from about 3 large eggs)","4":"1/4 teaspoon coarse kosher salt","5":"1/8 teaspoon cream of tartar","6":"1/3 cup sugar","7":"2 teaspoons instant espresso powder","8":"1 cup finely chopped toasted pecans","9":"1/2 cup semisweet or bittersweet chocolate chips (optional)","10":"18 (about) untoasted pecan halves"},"Instructions":"Preheat oven to 300°F. Line heavy large baking sheet with parchment paper. Press brown sugar and cocoa powder through sieve into small bowl to remove any lumps; whisk to blend. Using electric mixer, beat egg whites, coarse salt, and cream of tartar in medium bowl until very soft peaks begin to form. With mixer running, gradually add sugar, then espresso powder; beat until medium peaks form. Beat in brown sugar mixture by tablespoonfuls. Continue beating until meringue is very stiff and glossy, 2 to 3 minutes. Fold in chopped pecans and chocolate chips, if desired. Drop mixture by rounded tablespoonfuls onto prepared sheet, spacing about 1 inch apart. Place 1 pecan half atop each meringue, pressing very lightly to adhere.\nBake meringues until dry but still slightly soft when pressed with finger, about 25 minutes. Turn off oven. Cool meringues in oven with door closed until crisp, about 1 1/2 hours. DO AHEAD: Meringues can be made up to 1 day ahead. Store airtight at room temperature.","Image":"//20fix.com/xfood/img/pecan-mocha-meringues-364652.jpg"},{"id":"7279","Title":"Fudgy Meringue Cookies","Ingredients":{"1":"Nonstick vegetable oil spray","2":"1 cup bittersweet chocolate chips (do not exceed 61% cacao; about 6 ounces), divided","3":"1 1/2 cups powdered sugar, divided","4":"1/3 cup unsweetened cocoa powder","5":"2 teaspoons cornstarch","6":"2 large egg whites, room temperature","7":"1/2 teaspoon vanilla extract","8":"1/8 teaspoon cream of tartar"},"Instructions":"Position 1 rack in top third and 1 rack in bottom third of oven and preheat to 350°F. Coat 2 large rimmed baking sheets with nonstick spray. Place 1/2 cup chocolate chips in small microwave-safe bowl. Cook in 15-second intervals until chocolate softens; stir until melted and smooth. Cool chocolate to lukewarm, about 10 minutes. Whisk 1/2 cup sugar, cocoa, and cornstarch in small bowl to blend.\nUsing electric mixer, beat room-temperature egg whites, vanilla, 1/8 teaspoon salt, and cream of tartar in medium bowl until soft peaks form. Add remaining 1 cup sugar in 4 additions, beating just to blend after each addition. Continue to beat until meringue is thick and glossy like marshmallow creme, about 2 minutes longer. Beat in cocoa mixture. Fold in melted chocolate, then 1/2 cup chips.\nDrop batter by rounded tablespoonfuls onto prepared sheets, spacing 3 inches apart. Bake cookies 7 minutes. Reverse sheets and bake until dry-looking and cracked, about 6 minutes. Cool cookies on sheets 5 minutes. Transfer cookies to racks and cool completely.","Image":"//20fix.com/xfood/img/fudgy-meringue-cookies-364072.jpg"},{"id":"7637","Title":"Mexican Chocolate Ice Cream Cake with Orange Meringue","Ingredients":{"1":"Nonstick vegetable oil spray","2":"1/3 cup all purpose flour","3":"1/2 teaspoon ground cinnamon","4":"1/4 teaspoon baking powder","5":"Pinch of salt","6":"6 tablespoons (3/4 stick) unsalted butter, cut into 4 pieces","7":"1/3 cup natural unsweetened cocoa powder","8":"3/4 cup sugar","9":"1 large egg","10":"1/2 teaspoon vanilla extract","11":"12 ounces bittersweet chocolate (do not exceed 61% cacao), chopped","12":"2 3/4 cups half and half, divided","13":"6 large egg yolks","14":"2/3 cup sugar","15":"1/2 teaspoon ground cinnamon","16":"Pinch of salt","17":"4 large egg whites, room temperature","18":"1/2 teaspoon cream of tartar","19":"Pinch of salt","20":"1/2 cup sugar","21":"2 teaspoons finely grated orange peel","22":"9-inch-diameter springform pan with 3-inch-high sides","23":"Candy thermometer","24":"Ice cream maker","25":"Kitchen torch","26":"Soften about 6 cups of purchased chocolate ice cream. Mix in 1/2 teaspoon cinnamon. Spoon the ice cream over the baked brownie layer, freeze, and continue with the recipe."},"Instructions":"Preheat oven to 325°F. Line inside of 9-inch-diameter springform pan with 3-inch-high sides with foil. Coat lightly with nonstick spray. Whisk flour and next 3 ingredients in small bowl. Melt butter in medium saucepan over medium low heat. Remove from heat; whisk in cocoa powder, then sugar. If batter is still hot, let cool. Whisk in egg and vanilla, then flour mixture. Spread batter over bottom of pan.\nBake brownie layer until tester inserted into center comes out with a few moist crumbs attached, 15 to 17 minutes. Cool in pan on rack. Cover and freeze.\nStir chocolate and 1 1/2 cups half and half in medium saucepan over medium heat until chocolate is melted, stirring often. Remove from heat. Whisk egg yolks and next 3 ingredients in medium bowl. Gradually whisk in hot chocolate mixture; return to saucepan. Cook over medium-low heat until mixture leaves path on back of spoon when finger is drawn across and custard registers 170°F to 175°F on candy thermometer, stirring constantly, 6 to 8 minutes.\nStrain custard into another medium bowl. Add remaining 1 1/4 cups half and half. Refrigerate until cold, about 3 hours.\nProcess custard in ice cream maker. Transfer to pan; spread evenly over brownie layer. Cover; freeze overnight. DO AHEAD: Can be made 3 days ahead. Keep frozen.\nUsing electric mixer, beat egg whites in large bowl until foamy. Add cream of tartar and pinch of salt. Beat until soft peaks form. With mixer running, gradually add sugar. Continue to beat until meringue forms stiff glossy peaks. Beat in orange peel. Spread over ice cream layer. Using spatula or back of spoon, swirl decoratively, forming peaks. Freeze until firm, at least 3 hours. DO AHEAD: Can be made 1 day ahead. Cover and keep frozen.\nRemove cake from freezer. Release pan sides; remove foil. Transfer cake to plate. Using kitchen torch, brown meringue or place under broiler 1 to 2 minutes to brown.","Image":"//20fix.com/xfood/img/mexican-chocolate-ice-cream-cake-with-orange-meringue-360257.jpg"},{"id":"8002","Title":"Key Lime Meringue Tart","Ingredients":{"1":"3 large eggs","2":"3 large egg yolks","3":"1/2 cup sugar","4":"1/3 cup fresh Key lime juice (from about 18 limes) or regular fresh lime juice","5":"3 tablespoons fresh lemon juice","6":"1/4 teaspoon coarse kosher salt","7":"1/2 cup (1 stick) unsalted butter, cut into 1/4-inch cubes","8":"6 tablespoons (3/4 stick) unsalted butter, room temperature","9":"3 ounces chilled cream cheese, cut into 1/2-inch cubes","10":"1 tablespoon sugar","11":"3/4 cup unbleached all purpose flour","12":"1/4 teaspoon coarse kosher salt","13":"4 large egg whites, room temperature","14":"2/3 cup sugar","15":"1/4 cup powdered sugar","16":"1 teaspoon vanilla extract","17":"1/4 teaspoon coarse kosher salt","18":"9-inch-diameter tart pan with removable bottom Kitchen torch"},"Instructions":"Whisk eggs, yolks, sugar, lime juice, lemon juice, and coarse salt in medium metal bowl. Set bowl over medium saucepan of simmering water (do not allow bottom of bowl to touch water). Whisk constantly until curd thickens slightly and instant-read thermometer inserted into curd registers 140°F for 3 minutes, 5 to 6 minutes total (do not allow to boil). Remove bowl from over water. Gradually whisk butter into curd a few cubes at a time until smooth, allowing butter cubes to melt before adding more. Strain curd through fine sieve set over small bowl. Press plastic wrap directly onto surface of curd and chill overnight. DO AHEAD: Lime curd can be made 2 days ahead. Keep chilled.\nUsing electric mixer, beat butter, cream cheese, and sugar in medium bowl until smooth. Add flour and salt and beat just until blended. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out.\nPreheat oven to 375°F. Roll out dough on lightly floured work surface to 11- to 12-inch round. Transfer to 9-inch tart pan with removable bottom. Press dough onto bottom and up sides of pan. Trim dough overhang to 1/2 inch, then fold overhang in, forming double-thick sides extending 1/4 inch above sides of pan. Pierce crust all over with fork. Freeze crust 20 minutes.\nLine crust with foil; fill with dried beans or pie weights. Bake until crust is set, about 25 minutes. Remove foil and beans. Continue to bake until crust is golden and cooked through, about 20 minutes longer. Cool crust completely in pan on rack. Spread curd evenly in baked crust. Chill while making meringue.\nUsing electric mixer, beat egg whites in large bowl on medium speed until foamy. Increase speed to medium-high and beat until soft peaks form. Gradually add sugar and powdered sugar 1 tablespoon at a time; beat until meringue is very thick and glossy, about 5 minutes. Beat in vanilla and coarse kosher salt.\nSpoon meringue in dollops atop curd, then spread and swirl decoratively with table knife. Using kitchen torch, brown meringue in spots, creating white and golden peaks and valleys. Chill uncovered at least 1 hour before serving. DO AHEAD: Can be made 4 hours ahead. Keep chilled.\nRemove sides from tart pan. Place tart on platter and serve.","Image":"//20fix.com/xfood/img/key-lime-meringue-tart-357518.jpg"},{"id":"8072","Title":"Dr. Lee's Mocha Meringue","Ingredients":{"1":"1 cup powdered sugar","2":"1 tbsp of cocoa","3":"1/8 tsp cinnamon","4":"1/2 tsp instant coffee powder","5":"4 egg whites","6":"1/2 tsp vanilla","7":"1/2 cup slivered almonds","8":"1/4 tsp salt"},"Instructions":"Preheat oven to 250 degrees. Lightly grease a cookie sheet. Sift powdered sugar, cocoa, coffee and salt. Put dry mix and almonds in blender—grind until it becomes a fine powder. Beat the egg whites and vanilla extract until stiff. Fold the powdered mix with the stiff egg whites. Drop meringue mix with a tablespoon onto cookie sheet. Bake for 2 to 3 hours, turn off the oven, leave meringues in oven for 20 minutes, then serve.\nAdapted from The Moosewood Cookbook by Mollie Katzen.","Image":"//20fix.com/xfood/img/dr-lees-mocha-meringue-357049.jpg"}],"t":40,"p":{"limitstart":0,"limit":25,"total":40,"pagesStart":1,"pagesStop":2,"pagesCurrent":1,"pagesTotal":2}}}